import { Pressable, StyleSheet, Text, View } from 'react-native'
import React from 'react'
import { ScrollView } from 'react-native-gesture-handler'
import { List } from 'react-native-paper'


export default function infc({navigation}) {
    const onPresshundler = () => {
    
    navigation.goBack()
    }
     return(
       <ScrollView style={{backgroundColor:'#D7FFD9'}}>
         <View style={styles.body} >
         <Text style={styles.subtitle}>
         ၇.၃ 	အေအိုင်ဒီအက်စ်ရောဂါ (ခုခံအားကျဆင်းမှုကူးစက်ရောဂါ)
         </Text>
         <Text style={styles.p}>
         {"\n"}•	လူခန္ဓာကိုယ်၏ ခုခံအားကျဆင်းစေသော ဗိုင်းရပ်ပိုးကို အိပ်(ချ်)အိုင်ဗွီပိုးဟုခေါ်သည်။
         {"\n"}•	လူ၏ ကိုယ်ခံအားစနစ်ကို အိပ်ချ်အိုင်ဗွီပိုးက ဖျက်ဆီးပြစ်သဖြင့် ဖြစ်ပေါ်လာသော ရောဂါလက္ခဏာပေါင်းစုကို အေအိုင်ဒီအက်စ်ရောဂါ (ခုခံအားကျဆင်းမှု ကူးစက်ရောဂါ) ဟုခေါ်သည်။
          </Text>
          
          <List.Section title="" style={styles.headtitle}>
      <List.Accordion
        title="အေအိုင်ဒီအက်စ်ရောဂါ အဓိကလက္ခဏာများ" titleNumberOfLines={20} style={{backgroundColor:"#c1e5c3"}} theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`•	အကြောင်းအရင်းမသိ ကိုယ်အလေးချိန် သိသိသာသာ ကျဆင်းခြင်း
•	အကြောင်းအရင်းမသိကြာရှည်ဖျားခြင်း (အဖျားဆက်တိုက် (သို့မဟုတ်) အတက်/အကျရှိခြင်း၊ တစ်လထက်ပိုကြာခြင်း)
•	အကြောင်းအရင်းမသိ တစ်လထက်ပိုကြာအောင် ဝမ်းလျှောခြင်း/ ဝမ်းပျက်ခြင်း
•	ပါးစပ်တွင်း မှက္ခရု ကြာရှည်ဖြစ်ခြင်း
•	ဆင်ရေယုန်ပေါက်ခြင်း တို့ဖြစ်ပါသည်။
အိပ်ချ်အိုင်ဗွီပိုး ကူးစက်ခံရသည်နှင့် ရောဂါလက္ခဏာ ချက်ချင်းမပြတတ်ပါ။ (၅)/ (၁၀) နှစ်ကြာမှ လက္ခဏာပြတတ်ပါသည်။ ရောဂါလက္ခဏာ မပြသေးသော်လည်း အခြားသူများသို့ ကူးစက်နိုင်ပါသည်။`}
        titleNumberOfLines={200} />
      </List.Accordion>

      <List.Accordion
        title="ကူးစက်နိုင်သည့် နည်းလမ်းများ" titleNumberOfLines={20} style={{backgroundColor:"#c1e5c3" }}  theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`၁။	ပိုးရှိသူနှင့် အကာအကွယ်မပါပဲ လိင်ဆက်ဆံရာ (လိင်တူ/ လိင်ကွဲ) မှတဆင့် ကူးစက်ခြင်း
၂။	ပိုးရှိသူ အသုံးပြုပြီးသော မသန့်ရှင်းသော ဆေးထိုးအပ်၊ ဆေးထိုးကိရိယာများနှင့် မူးယစ်ဆေးထိုးသွင်းခြင်း၊ ဆေးထိုးအပ်များ မျှဝေသုံးစွဲခြင်း
၃။	ပိုးရှိသော သွေးသွင်းမိရာမှ ကူးစက်ခြင်း
၄။	ပိုးရှိသော ကိုယ်ဝန်ဆောင်မိခင်မှ သန္ဓေသားသို့ ကူးစက်ခြင်း`}
titleNumberOfLines={200}/>
      </List.Accordion>

      <List.Accordion
        title="ပိုးကူးစက်ခံရနိုင်ခြေရှိသူများ" titleNumberOfLines={20} style={{backgroundColor:"#c1e5c3"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`•	လိင်လုပ်သားများနှင့် ၎င်းတို့၏ လိင်ဆက်ဆံဖက်များ
•	အမျိုးသားချင်း လိင်တူဆက်ဆံသူများ
•	မူးယစ်ဆေး သွေးကြောထဲကို ထိုးသွင်းသုံးစွဲသူများ`}
titleNumberOfLines={200}/>
<Text style={styles.subtitle}>  လိင်တူလိင်ကွဲ ဆက်ဆံသူများတွင် လိင်အင်္ဂါလမ်းကြောင်း၌ အဖြူဆင်းညောင်းကျခြင်း၊ အနာပေါက်ခြင်းများရှိနေပါက အိပ်(ချ်)အိုင်ဗွီပိုး ကူးစက်ခံနိုင်မှုသည် အဆ(၉)ဆခန့် အထိဖြစ်နိုင်ပါသည်။</Text>
        </List.Accordion>

        <List.Accordion
        title="မကူးစက်နိုင်သော နည်းလမ်းများ" titleNumberOfLines={20} style={{backgroundColor:"#c1e5c3"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`•	ချောင်းဆိုးနှာချေခြင်း၊
•	လက်တွဲနှုတ်ဆက်ခြင်း၊
•	ဖက်ခြင်း၊
•	သာမန်နမ်းရှုံ့ခြင်း၊
•	ပန်းကန်၊ ခွက်၊ ဇွန်းအတူတူသုံးစွဲခြင်း၊ အတူစားသောက်ခြင်း၊
•	တယ်လီဖုန်း၊ အိမ်သာ၊ တံခါးလက်ကိုင်၊ ထိုင်ခုံ စသဖြင့် အသုံးဆောင်ပစ္စည်းတို့ကို အတူတူ ကိုင်တွယ်သုံးစွဲခြင်း၊ 
•	တစ်ခန်းတည်းအတူနေခြင်း၊ အတူတူအလုပ်လုပ်ခြင်း တို့ကြောင့် မကူးစက်နိုင်ပါ။
•	ခြင်ကဲ့သို့သော ပိုးမွှားများ ကိုက်ခံရခြင်း`}
titleNumberOfLines={200}/>
<Text style={styles.subtitle}>{"\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0"}သာမန်ထိတွေ့ဆက်ဆံမှုများမှ မကူးစက်နိုင်ပါ။</Text>
        </List.Accordion>

        <List.Accordion
        title="ကာကွယ်နိုင်မည့်နည်းလမ်းများ" titleNumberOfLines={20} style={{backgroundColor:"#c1e5c3"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`•	ကူးစက်မည့်အန္တရာယ်ရှိနိုင်သော အပြုအမူများကို ရှောင်ကြဉ်ရန် အလွန်အရေးကြီးပါသည်။
•	လိင်ကိစ္စအပျော်အပါးလိုက်စားခြင်းကို ရှောင်ကြဉ်ရန်
•	မူးယစ်ဆေးဝါးရှောင်ကြဉ်ရန်
•	တစ်ခါသုံးဆေးထိုးအပ်၊ ဆေးထိုးပြွန်များသုံးစွဲခြင်း၊ လုံခြုံစိတ်ချရသောသွေးသွင်းခြင်း
•	လိင်ဆက်ဆံရာတွင် အကာအကွယ်ပစ္စည်း (ကွန်ဒုံး) စနစ်တကျသုံးစွဲရန်`}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="သွေးစစ်ဆေးခြင်း" titleNumberOfLines={20} style={{backgroundColor:"#c1e5c3"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`•	အိပ်ချ်အိုင်ဗွီပဋိပစ္စည်း ရှိ/မရှိ သိရှိလိုပါက နီးစပ်ရာဆေးရုံ၊ ဆေးခန်းများတွင် အိပ်ချ်အိုင်ဗွီပဋိပစ္စည်း ရှိ/မရှိ သွေးစစ်ဆေးခြင်းဖြင့် သိရှိနိုင်ပါသည်။
•	အိပ်ချ်အိုင်ဗွီပဋိပစ္စည်း ရှိ/မရှိ သွေးစစ်ဆေးမည်ဆိုပါက မိမိဆန္ဒအလျောက် နှစ်သိမ့်ဆွေးနွေးမှုခံယူပြီးမှ နီးစပ်ရာဆေးရုံ/ ဆေးခန်းများနှင့် ကျန်းမာရေးဌာနများတွင် ပြုလုပ်သင့်ပါသည်။
•	သွေးစစ်ဆေးသည့်အဖြေတွင် ပဋိပစ္စည်းမတွေ့ဟုဆိုလျှင် ပြီးခဲ့သော (၆)ပတ်အတွင်း အိပ်ချ်အိုင်ဗွီကူးစက်နိုင်သော အခြေအနေတစ်ရပ်ရပ်နှင့် ထိတွေ့မှုရှိခဲ့သောသူသည် နောက်ထပ်(၄)ပတ်မှ (၆)ပတ်အတွင်း ပြန်လည်စစ်ဆေးရန် ဉီးတည်အုပ်စုဝင်များနှင့် အိပ်ချ်အိုင်ဗွီကူးစက်နိုင်မှု အခြေအနေနှင့် ဆက်လက်၍ ထိတွေ့နေသောသူ (မိမိ၏ လိင်ဆက်ဆံဖက်တွင် အိပ်ချ်အိုင်ဗွီရှိသူ) များတွင် (၆)လ တစ်ကြိမ် စစ်ဆေးရန် ဖြစ်ပါသည်။
•	အိပ်ချ်အိုင်ဗွီပဋိပစ္စည်း ရှိ/မရှိကို ကိုယ်ဝန်ဆောင်မိခင်နှင့် ခင်ပွန်းတို့သည် နီးစပ်ရာ ဆေးရုံ/ ဆေးခန်း၊ ကျန်းမာရေးဌာနများတွင် သွေးစစ်ဆေးသင့်ပါသည်။ အကယ်၍ ကိုယ်ဝန်ဆောင်မိခင်တွင် အိပ်ချ်အိုင်ဗွီပိုးရှိပါက မိခင်မှ ကလေးသို့ ကူးစက်မှုကို ကာကွယ်ခြင်းနှင့် လိုအပ်သော ကျန်းမာရေးစောင့်ရှောက်မှုများကို လျင်မြန်စွာ ရရှိနိုင်မည်။
•	အိပ်ချ်အိုင်ဗွီပိုးရှိသူ မိခင်မှ မွေးဖွားလာသည့် ကလေးငယ်များကို အသက်(၄)ပတ်မှ (၆)ပတ်အတွင်း ဗိုင်းရပ်(စ်) ပိုးကို စစ်ဆေးခြင်းနည်းဖြင့် အိပ်ချ်အိုင်ဗွီပိုးရှိ/ မရှိ စစ်ဆေးနိုင်ပါသည်။ ဗိုင်းရပ် (စ်) ပိုးစစ်ဆေးခြင်းနည်းဖြင့် အိပ်ချ်အိုင်ဗွီပိုးမရှိဟု အဖြေထွက်သောကလေးများကို အသက်(၉)လ နှင့် (၁၈)လတို့တွင် အိပ်ချ်အိုင်ဗွီပဋိ ပစ္စည်း ရှိ/မရှိ စစ်ဆေးရန် (သို့မဟုတ်) မိခင်နို့ဖြတ်ပြီး (၃)လအကြာတွင် ပြန်လည်စစ်ဆေးရန် လိုအပ်ပါသည်။`}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="ဆေးကုသမှုခံယူခြင်း" titleNumberOfLines={20} style={{backgroundColor:"#c1e5c3"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`•	စနစ်တကျ ဆေးကုသမှုခံယူ၍ သက်တမ်းစေ့နေနိုင်ပါသည်။
•	အိပ်ချ်အိုင်ဗွီပိုးရှိသူများသည် ဘဝတစ်သက်တာသောက်သုံးရမည့် အေအာတီဆေးဖြင့် ဆေးကုသမှုခံယူနိုင်ပါသည်။
•	အေအာတီဆေးဝါး သောက်သုံးနေသူများသည် ဆေးကို မပျက်မကွက် နေ့စဉ်အချိန်မှန် ညွှန်ကြားထားသည့်အတိုင်း သောက်သုံးရမည်။
•	အိပ်ချ်အိုင်ဗွီပိုးရှိသူများတွင် လတ်တလော ချောင်းဆိုးခြင်း၊ ညဘက်ချွေးပြန်ခြင်း (သို့မဟုတ်) ပြန်ရည်ကြိတ်များ ကြီးလာခြင်း စသော တီဘီလက္ခဏာများ မရှိပါက Isoniazid Preventive Therapy (IPT) ကို (၆)လတိုက်ကျွေးခြင်းဖြင့် တီဘီရောဂါ ဖြစ်ပွားမှုကို လျှော့ချပေးနိုင်ပါသည်။
•	အိပ်ချ်အိုင်ဗွီပိုးရှိ ကိုယ်ဝန်ဆောင်မိခင်များအတွက် အေအာတီဆေးနှင့် ၎င်းတို့မွေးဖွားလာသော ကလေးများအတွက် အေအာဗွီကာကွယ်ဆေးများကို သက်ဆိုင်ရာမြို့နယ်များတွင် ရရှိနိုင်ပါသည်။
•	အိပ်ချ်အိုင်ဗွီပိုးတွေ့ကလေးများအား အေအာတီဆေးရရှိရန် အေအာတီဆေးကုဌာနများသို့ ညွှန်းပို့ပေးရပါမည်။
•	အိပ်ချ်အိုင်ဗွီပိုး ကူးစက်ခံရသော အမျိုးသမီးများသည် သင့်လျော်သော သားဆက်ခြားနည်းလမ်းများကို နီးစပ်ရာ ဆေးရုံ၊ ဆေးခန်း၊ ကျန်းမာရေးဌာနများတွင် ကျန်းမာရေးဝန်ထမ်းများထံမှ လက်လှမ်းမီစွာ ရရှိနိုင်သည်။
•	အိပ်ချ်အိုင်ဗွီပိုးကူးစက်ခံရသော မွေးကင်းစကလေးများအား ပုံမှန်ကာကွယ်ဆေးထိုး၊ တိုက်ခြင်း ပြုလုပ်သင့်/ မသင့်ကို သက်ဆိုင်ရာ ကျန်းမာရေးဝန်ထမ်းများနှင့် ဆွေးနွေးတိုင်ပင်သင့်ပါသည်။`}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="အေအိုင်ဒီအက်စ်ရောဂါနှင့် ခွဲခြားနှိမ့်ချဆက်ဆံခြင်း" titleNumberOfLines={20} style={{backgroundColor:"#c1e5c3"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`•	ခွဲခြားနှိမ့်ချဆက်ဆံခြင်းသည် အိပ်ချ်အိုင်ဗွီပိုး ကူးစက်ခံရသောသူများကို မှန်ကန်သောဆေးကုသမှုနှင့် ပြုစုစောင့်ရှောက်မှုများရရှိရန် နှောင့်နှေးစေနိုင်သောကြောင့် ခွဲခြားနှိမ့်ချဆက်ဆံခြင်း မပြုလုပ်သင့်ပါ။`}
titleNumberOfLines={200}/>
        </List.Accordion>
        
</List.Section>    

         </View>
       </ScrollView>
     )
   }

   const styles = StyleSheet.create({
    body :{
      flex:1,
      backgroundColor:'#D7FFD9',
      marginBottom:10,
      marginBottom:20,
    },
  headtitle:{
    color:'#102027',
    fontSize:30,
    marginTop:10,
    
  },
  subtitle:{
    color:'#260e04',
    fontSize:18,
    textDecorationLine: 'underline',
  },
  p:{
    margin:7,
    color:'#4e342e',
    fontSize:15,
    lineHeight: 26,
  },
  subp:{
    color:'#4e342e',
    fontSize:15,
    backgroundColor:'#c1e5c3',
    textDecorationLine: 'underline',
  }
    
    })