import { Pressable, StyleSheet, Text, View } from 'react-native'
import React from 'react'
import { ScrollView } from 'react-native-gesture-handler'
import { List } from 'react-native-paper'


export default function infd({navigation}) {
    const onPresshundler = () => {
    
    navigation.goBack()
    }
     return(
       <ScrollView style={{backgroundColor:'#D7FFD9'}}>
         <View style={styles.body} >
         <Text style={styles.headtitle}>
         ၇.၄	ငှက်ဖျားရောဂါ
         </Text>
         <Text style={styles.p}>
         {"\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0"}
         ငှက်ဖျားရောဂါ၏ ယေဘုယျလက္ခဏာများမှာ ချမ်းတုန်ပြီး ကိုယ်ပူဖျားခြင်း၊ ချွေး အလွန်အမင်းထွက်ပြီး အဖျားကျသွားခြင်း၊ ရက်ခြားဖျားခြင်း ပုံစံခြင်းဖျားတတ်ပါသည်။
         </Text>
         <List.Section title="" style={styles.headtitle}>
      <List.Accordion
        title="ဖြစ်ရသည့်အကြောင်းများနှင့် ရောဂါဖြစ်စဉ်" titleNumberOfLines={20} style={{backgroundColor:"#c1e5c3"}} theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`   ငှက်ဖျားရောဂါသည် ငှက်ဖျားပိုးသယ်ဆောင်သော အနောဖိလိခြင်း (Anopheles) ကိုက်ခြင်းမှ တဆင့်ကူးစက်ပြီး ငှက်ဖျားကပ်ပါးပိုး (Malaria parasite) ပလတ်စ်မိုဒီယမ် ကြောင့် ဖြစ်ပွားသည့် အဖျားရောဂါတစ်မျိုး ဖြစ်သည်။
	လူ၌ဖြစ်သော ပလတ်စ်မိုဒီယမ် ကပ်ပါးပိုး(၄)မျိုး ရှိပါသည်။ ၎င်းတို့ထဲမှာ ဖယ်လ်ဆီပါ ရမ်ပိုးသည် ပြင်းထန်ငှက်ဖျားရောဂါအဆင့်သို့ ရောက်ရှိဖြစ်ပွားနိုင်ပြီး အသက်အန္တရာယ်ရှိပါသည်။
  ငှက်ဖျားပိုးကောင်ရေသူများသူ၊ ကိုယ်ခံအားနည်းသူ၊ ကိုယ်ဝန်ဆောင်မိခင်နှင့် ကလေးငယ် တို့တွင်လည်း ရောဂါပိုမိုပြင်းထန်တတ်သည်။
	ငှက်ဖျားပိုးသယ်ဆောင်ထားသော အနော်ဖိလိခြင်သည်  လူကိုကိုက်သောအခါ သွေးထဲမှ တဆင့် လူ၏ အသည်းကလာပ်စည်းထဲသို့ ငှက်ဖျားပိုးများရောက်ရှိ ပွားများပါ သည်။ ၎င်းမှတဆင့် သွေးနီဥအတွင်းတွင် ထပ်မံပွားများပြီး သွေးနီဥများပျက်စီးစေသည့် အတွက် သွေးအားနည်းခြင်းနှင့် အခြားနောက်ဆက်တွဲ ဆိုးကျိုးများလည်း ဖြစ်ပွားစေနိုင် သောကြောင့် စနစ်တကျ ကုသရန် လိုအပ်ပါသည်။
	စောစီးစွာ ရောဂါရှာဖွေစစ်ဆေးခြင်းနှင့် ထိရောက်သော ကုသမှုချက်ချင်း ပေးနိုင်ရန် လိုအပ်ပါသည်။`}
        titleNumberOfLines={200} />
      </List.Accordion>

      <List.Accordion
        title="ပြင်းထန်ရောဂါလက္ခဏာများ" titleNumberOfLines={20} style={{backgroundColor:"#c1e5c3" }}  theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`•	တခြားသူအကူအညီမပါပဲ မတ်တပ်မရပ်နိုင်ခြင်း၊ လမ်းမလျှောက်နိုင်ခြင်း၊ မထိုင်နိုင် ခြင်း
•	ပါးစပ်မှ ဆေးမသောက်နိုင်အောင် အော့အန်ခြင်း
•	အလွန်အမင်း အဖျားတက်ခြင်း
•	ကယောင်ကတမ်းဖြစ်ခြင်း
•	ငိုက်မျဉ်းခြင်း၊ စိတ်ရှုပ်ထွေးခြင်း၊ စိတ်လှုပ်ရှားလွယ်ခြင်း၊ ရန်လိုခြင်း၊ ပတ်ဝန်းကျင်ကို စိတ်မဝင်စားတော့ခြင်း၊ အပြုအမူ၊ အမူအရာ ပြောင်းလဲခြင်း
•	တက်ခြင်း၊ မေ့မျောခြင်း
•	အလွန်အမင်း သွေးအားနည်းခြင်း၊ မျက်လွှာဖြူခြင်း
•	မျက်စိဝါခြင်း၊ အသားဝါခြင်း
•	ခြေဖျား၊ လက်ဖျားအေးစက်ပြီး သွေးလန့်သောကလက္ခဏာများရှိခြင်း
•	မှိန်းလွန်းခြင်း
•	ပြင်းထန်စွာ ခေါင်းကိုက်ခြင်း
•	ဇက်ခိုင်ခြင်း
•	အသက်ရှုရခက်ခြင်း၊ ရင်အလွန်ကြပ်ခြင်း
•	ဆီးမည်းမည်းသွားခြင်း၊ ဆီးနည်းခြင်း၊ ဆီးမသွားခြင်း
•	သွေးယိုစီးမှုများရှိခြင်း`}
titleNumberOfLines={200}/>
<Text style={styles.subtitle}>{"\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0"}ပြင်းထန်ငှက်ဖျားရောဂါလူနာမှာအရေးပေါ်ကုသရန် လိုအပ်ပြီး ဆေးရုံသို့ ချက်ခြင်း လွဲပြောင်းပေးရန်အရေးကြီးပါသည်။</Text>
      </List.Accordion>

      <List.Accordion
        title="ငှက်ဖျားရောဂါ စမ်းသပ်စစ်ဆေးခြင်း ဆောင်ရွက်ရန်" titleNumberOfLines={20} style={{backgroundColor:"#c1e5c3"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`၁။	သွေးဖောက်၍ ငှက်ဖျားပိုးအမျိုးအစား စစ်ဆေးရပါမည်။
•	သွေးမှန်ပြားကို စစ်ဆေးနိုင်ပါသည်။
•	အမြန်သွေးစစ်ကိရိယာ (RDT/ Rapid Diagnostic Test) ဖြင့်လည်း စစ်နိုင်ပါသည်။
•	အမျိုးသမီးများ (အသက် ၁၅နှစ်မှ ၄၅ နှစ်အတွင်း) ငှက်ဖျားဖြစ်ပါက ကိုယ်ဝန်ရှိ မရှိ မေးမြန်းစစ်ဆေးပါ။
၂။	ပိုးတွေ့ပါက ပြင်းထန်ရောဂါလက္ခဏာ ရှိ/မရှိ စစ်ဆေးပါ။
၃။	ရောဂါပိုးတွေ့ရှိမှုနှင့် ပြင်းထန်ရောဂါလက္ခဏာများရှိ မရှိပေါ် မူတည်၍ လိုအပ်သော ကုသမှု၊ လွှဲပြောင်းပေးပို့မှုများ ဆောင်ရွက်ပေးရန်ဖြစ်ပါသည်။`}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="ကာကွယ်နိုင်မည့် နည်းလမ်းများ" titleNumberOfLines={20} style={{backgroundColor:"#c1e5c3"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`•	ငှက်ဖျားပိုးသယ်ဆောင်လာသော ခြင်သည် အဓိကအားဖြင့် ညအခါတွင် ကိုက်လေ့ရှိ သော်လည်း မည်သည့်အချိန် မည်သည့်နေရာမဆို ခြင်ထောင်ဖြင့် အိပ်ခြင်း (အထူး သဖြင့် ဆေးစိမ်ခြင်ထောင်ဖြင့် အိပ်ခြင်း)
•	ခြင်ကိုက်ခံရခြင်းမှ ကင်းဝေးရန် အဝတ်အစား လုံလုံခြုံခြုံဝတ်ခြင်း၊ အင်္ကျီလက်ရှည်၊ ဘောင်းဘီရှည် ဝတ်ခြင်း
•	အဝတ်အစား လွတ်နေသော လက်၊ ခြေတို့အား ခြင်းမကိုက်မိစေသည့် ဆေးလိမ်းခြင်း
•	ခြင်ခိုအောင်းနိုင်သော အိမ်အနီးရှိ ခြုံနွယ် ပိတ်ပေါင်းများကို ရှင်းလင်းခြင်း
•	ရပ်ကွက်ကျေးရွာအနိးရှိ စိမ့်၊ စမ်း၊ ချောင်းများကို ခြင်မပေါက်ပွားစေရန် ရေစီးရေလာ ကောင်းအောင် လူထုအားဖြင့် ပူးပေါင်းဆောင်ရွက်ခြင်း
•	ပိုးလောက်လန်းစားငါးများကို ရေတွင်းရေကန်များတွင် ထည့်ခြင်းတို့ဖြင့် ငှက်ဖျား ရောဂါကူးစက်မှုမှ ကာကွယ်နိုင်ပါသည်။`}
titleNumberOfLines={200}/>
<Text style={styles.subtitle}>ငှက်ဖျားရောဂါသည် စောစီးစွာ သိရှိကုသမှုခံယူပါက အသက်အန္တရာယ်ထိခိုက်မှု အလွန်နည်းပါသောကြောင့် ငှက်ဖျားရောဂါ ဖြစ်ပွားသည်ဟု သံသယရှိပါက နီးစပ်ရာဆေးရုံ၊ ဆေးခန်း၊ ကျန်းမာရေးဌာန၊ ငှက်ဖျားစေတနာ့ဝန်ထမ်း၊ ကျန်းမာရေးလုပ်သားသို့ (၂၄)နာရီ အတွင်းအမြန်ဆုံးသွားရောက် သွေးစစ်ပြီးဆေးကုသမှုခံယူကြပါရန် လိုအပ်ပါသည်။</Text> 
        </List.Accordion>

</List.Section>
           
     
         </View>
       </ScrollView>
     )
   }

   const styles = StyleSheet.create({
    body :{
      flex:1,
      backgroundColor:'#D7FFD9',
      marginBottom:10,
      marginBottom:20,
    },
  headtitle:{
    color:'#102027',
    fontSize:30,
    marginTop:10,
    
  },
  subtitle:{
    color:'#260e04',
    fontSize:18,
    textDecorationLine: 'underline',
  },
  p:{
    margin:7,
    color:'#4e342e',
    fontSize:15,
    lineHeight: 26,
  },
  subp:{
    color:'#4e342e',
    fontSize:15,
    backgroundColor:'#c1e5c3',
    textDecorationLine: 'underline',
  }

    
    })