import { Pressable, StyleSheet, Text, View } from 'react-native'
import React from 'react'
import { ScrollView } from 'react-native-gesture-handler'
import { List } from 'react-native-paper'


export default function infj({navigation}) {
    const onPresshundler = () => {
    
    navigation.goBack()
    }
     return(
       <ScrollView style={{backgroundColor:'#D7FFD9'}}>
         <View style={styles.body} >
         <Text style={styles.subtitle}>
         ၇.၁၀	ကူးစက်မြန် အီဘိုလာဗိုင်းရပ်စ်ရောဂါ
         </Text>
         <Text style={styles.p}>
         
         {"\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0"}
         အီဘိုလာဗိုင်းရပ်စ်ရောဂါသည် ကူးစက်မြန်ရောဂါတစ်မျိုးဖြစ်ပြီး ကုသရန်ခက်ခဲသည့် အပြင် ရောဂါပြန့်ပွားမှုအား ထိန်းချုပ်ရန် ခက်ခဲသောရောဂါဖြစ်သည်။ ရောဂါဖြစ်ပွားသူ (၁၀)ဉီးတွင် (၅)ဉီးမှ (၉)ဉီးခန့် အသက်ဆုံးရှုံးနိုင်ပါသည်။
        </Text>

        <List.Section title="" style={styles.headtitle}>
      <List.Accordion
        title="ရောဂါသံသယလက္ခဏာများ" titleNumberOfLines={20} style={{backgroundColor:"#c1e5c3"}} theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`အီဘိုလာဗိုင်းရပ်စ်ရောဂါ ကူးစက်ဖြစ်ပွားနေသော နိုင်ငံများသို့ သွားရောက်ခဲ့သူများ (သို့မဟုတ်) နိုင်ငံတကာ ခရီးသွားသူများ၊ ကူးစက်မြန် အီဘိုလာရောဂါလူနာအား တိုက်ရိုက် ပြုစုကုသ ထိတွေ့ကိုင်တွယ်ခဲ့သူများ၊ ရောဂါရှိသော တောရိုင်းတိရစ္ဆာန်များအား ထိတွေ့ကိုင် တွယ်သူများတွင်
•	ဖျားခြင်း၊ အားအင်ချည့်နဲ့ခြင်း၊ ကြွက်သားနှင့် အဆစ်အမြစ်များ နာကျင်ကိုက်ခဲခြင်း၊ ခေါင်းကိုက်ခြင်း၊ လည်ချောင်းနာခြင်း၊ အစားအသောက်ပျက်ခြင်း၊ အစာမျိုရခက် ခြင်း၊ အသက်ရှုရခက်ခြင်း၊ ကြို့ထိုးခြင်း၊ အန်ခြင်း၊ အရည်ဝမ်းသွားခြင်း၊ ဗိုက်နာခြင်း
•	အီဘိုလာဗိုင်းရပ်စ်ပိုးသည် အသည်းနှင့် ကျောက်ကပ်များ ပျက်စီးနိုင်ခြင်း၊ ခန္ဓာကိုယ် အတွင်းနှင့်အပြင် သွေးယိုထွက်ခြင်း၊ အသက်အန္တရာယ် ဖြစ်နိုင်ခြင်း`}
        titleNumberOfLines={200} />
      </List.Accordion>

      <List.Accordion
        title="ကူးစက်နိုင်သည့် နည်းလမ်းများ" titleNumberOfLines={20} style={{backgroundColor:"#c1e5c3" }}  theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`•	အီဘိုလာဗိုင်းရပ်စ်ရောဂါသည် ရောဂါပိုးရှိသော လူ(သို့မဟုတ်) တိရစ္ဆာန်၏ တံတွေး၊ သွေး၊ ခန္ဓာကိုယ်မှ ထွက်သော အရည်တို့နှင့် တိုက်ရိုက်ထိတွေ့ကိုင်တွယ်ခြင်း မှတဆင့် ကူးစက်နိုင်ပါသည်။
•	လူနာ၏သွေးနှင့် ခန္ဓာကိုယ်မှ အရည်များ ထိတွေ့ထားသော အရာဝတ္ထုများနှင့် ထိတွေ့ကိုင်တွယ်ခြင်းတို့မှလည်း ကူးစက်နိုင်သည်။
•	ရောဂါပိုးရှိသောလူနာနှင့် လိင်ဆက်ဆံခြင်းမှလည်း ကူးစက်နိုင်ပါသည်။
•	အီဘိုလာဗိုင်းရပ်စ်ရောဂါသည် လေ၊ ရေ၊ အစားအစာတို့မှ တဆင့် မကူးစက်နိုင်ပါ။`}
titleNumberOfLines={200}/>
      </List.Accordion>

      <List.Accordion
        title="ကာကွယ်နိုင်မည့် နည်းလမ်းများ" titleNumberOfLines={20} style={{backgroundColor:"#c1e5c3"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`•	တစ်ကိုယ်ရေသန့်ရှင်းရေးကို အထူးဂရုပြုပါ။
•	လက်ကိုရေနှင့် ဆပ်ပြာဖြင့် မကြာခဏ ဆေးကြောပါ။
•	ရောဂါပိုးရှိသူလူနာ၏ သွေးနှင့် ၎င်းခန္ဓာကိုယ်မှ ထွက်သော အရည်များအား အကာ အကွယ် (ဥပမာ - လက်အိတ်၊ နှာခေါင်းစည်း၊ အပေါ်ဖုံးအဝတ်၊ လည်ရှည်ဖိနပ်) မပါပဲ ထိတွေ့ကိုင်တွယ်ခြင်း မပြုရ။
•	ရောဂါပိုးရှိသော လူ၊ တိရစ္ဆာန်တို့၏ သွေးနှင့် ၎င်းခန္ဓာကိုယ်မှ ထွက်သော အရည်များ ရှိနိုင်သည့် အရာဝတ္ထုပစ္စည်း (ခုံများ၊ စားပွဲများ၊ အိပ်ရာ၊ လှေကား လက်ရန်း၊ နံရံ စသည်) တို့နှင့် ထိတွေ့ကိုင်တွယ်ခြင်း မပြရ။
•	အထူးသဖြင့် လွန်ခဲ့သော (၁)လအတွင်း အီဘိုလာဗိုင်းရပ်စ်ရောဂါ ကူးစက်ဖြစ်ပွား သောနိုင်ငံများသို့ သွားရောက်ခဲ့သူများသည် မိမိတွင် သံသယလက္ခဏာများ ဖြစ်ပေါ် လာပါက ကျန်းမာရေးဌာနသို့ ချက်ချင်းသတင်းပို့ ဆေးကုသမှုခံယူပါ။
•	သံသယလက္ခဏာ ဖြစ်ပွားသူများ တွေ့ရှိပါက နီးစပ်ရာကျန်းမာရေးဌာနသို့ ချက်ချင်း သတင်းပို့ပါ။
•	ရောဂါဖြစ်ပွားကူးစက်နေသည့် နိုင်ငံများသို့ သွားရောက်ခြင်းကို ရှောင်ကြဉ်ပါ။
•	ရောဂါဖြစ်ပွားကူးစက်လျက်ရှိသော နိုင်ငံများသို့ သွားရောက်ခဲ့ပြီး မိမိနိုင်ငံတွင်းသို့ ပြန်လည်ဝင်ရောက်လာသူများအနေဖြင့် ကျန်းမာရေးဌာနများသို့ ဆက်သွယ်သတင်း ပေးပို့၍ ရောဂါကာကွယ်ရေးနှင့် ပတ်သက်သော အကြံဉာဏ် ရယူဆောင်ရွက်ပါ။
•	ကျန်းမာရေးဝန်ထမ်းများအနေဖြင့် အီဘိုလာဗိုင်းရပ်စ်ရောဂါလူနာများ ကာကွယ် ကုသရာတွင် ကိုယ်ခန္ဓာကာကွယ်ရေး ဝတ်စုံနှင့် ပစ္စည်းများပြည့်စုံစွာ စနစ်တကျ ဝတ်ဆင်၍ လုပ်ငန်းဆောင်ရွက်ရမည်။ ပြည့်စုံသော ကိုယ်ခန္ဓာကာကွယ်ရေးဝတ်စုံနှင့် ပစ္စည်းများဝတ်ဆင်ခြင်းမပြုဘဲ လူနာအား ထိတွေ့ကိုင်တွယ်ခြင်း မပြုရပါ။`}
titleNumberOfLines={200}/>
        </List.Accordion>

</List.Section>
         
         </View>
       </ScrollView>
     )
   }

   const styles = StyleSheet.create({
    body :{
      flex:1,
      backgroundColor:'#D7FFD9',
      marginBottom:10,
      marginBottom:20,
    },
  headtitle:{
    color:'#102027',
    fontSize:30,
    marginTop:10,
    
  },
  subtitle:{
    color:'#260e04',
    fontSize:18,
    textDecorationLine: 'underline',
    margin:10,
  },
  p:{
    margin:7,
    color:'#4e342e',
    fontSize:15,
    lineHeight: 26,
  },
  subp:{
    color:'#4e342e',
    fontSize:15,
    backgroundColor:'#c1e5c3',
    textDecorationLine: 'underline',
  }
    
    })