import { Pressable, StyleSheet, Text, View } from 'react-native'
import React from 'react'
import { ScrollView } from 'react-native-gesture-handler'
import { List } from 'react-native-paper'


export default function infl({navigation}) {
    const onPresshundler = () => {
    
    navigation.goBack()
    }
     return(
       <ScrollView style={{backgroundColor:'#D7FFD9'}}>
         <View style={styles.body} >
         <Text style={styles.subtitle}>
         ၇.၁၂	အရှေ့အလယ်ပိုင်းဒေသ အသက်ရှုလမ်းကြောင်းဆိုင်ရာ (မားစ်) ကူးစက်မြန်ရောဂါ
         </Text>
         <Text style={styles.p}>
         {"\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0"}
         အရှေ့အလယ်ပိုင်းဒေသ အသက်ရှုလမ်းကြောင်းဆိုင်ရာ ကူးစက်မြန်ရောဂါ Middle East Respiratory Syndrome (MERS-CoV) ရောဂါသည် ဗိုင်းရပ်စ်ပိုးတစ်မျိုးကြောင့်ဖြစ်သော ပြင်းထန်အသက်ရှုလမ်းကြောင်းဆိုင်ရာ ကူးစက်ရောဂါတစ်ခုဖြစ်သည်။ အဆိုပါရောဂါပိုးသည် လူတစ်ဦးမှ တစ်ဦးသို့ အသက်ရှုလမ်းကြောင်းမှ တစ်ဆင့် ကူးစက်ကာ အသက်အရွယ်မရွေး ဖြစ်ပွားနိုင်ပြီး ရောဂါဖြစ်ပွားသူ (၁၀)ဦးတွင် (၃) ဦးခန့် အသက်ဆုံးရှုံးနိုင်ပါသည်။ </Text>
         <List.Section title="" style={styles.headtitle}>
      <List.Accordion
        title="ရောဂါလက္ခဏာများ" titleNumberOfLines={20} style={{backgroundColor:"#c1e5c3"}} theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`     အဆိုပါရောဂါဖြစ်ပွားလျက်ရှိသော နိုင်ငံများသို့ သွားရောက်ခဲ့သူ ခရီးသွားများသည် (၁၄) ရက်အတွင်း အပြင်းဖျားခြင်း၊ ချောင်းဆိုးခြင်း၊ အသက်ရှုမဝခြင်း၊ အသက်ရှုခက်ခြင်း၊ နှာရည်ယိုခြင်း၊ နှာချေခြင်း၊ လည်ချောင်းနာခြင်၊ ဝမ်းလျှောခြင်း၊ အန်ခြင်း စသော သံသယလက္ခဏာများ ဖြစ်ပွားပါက နီးစပ်ရာကျန်းမာရေးဌာနသို့ ချက်ခြင်းသတင်းပို့ ဆေးကုသရန် လိုအပ်ပါသည်။
	  နာတာရှည်ရောဂါတစ်ခုခု (ဥပမာ- ဆီးချိုရောဂါ၊ နှလုံးရောဂါ၊ ကျောက်ကပ်ရောဂါ၊ အဆုတ်ရောဂါ) ခံစားနေရသူများအား မားစ်ကူးစက်မြန်ရောဂါ ကူးစက်ပါက ပိုမိုပြင်းထန်းပြီး အသက်အန္တရာယ် ရှိနိုင်ပါသည်။`}
        titleNumberOfLines={200} />
      </List.Accordion>

      <List.Accordion
        title="ကူးစက်နိုင်သည့် နည်းလမ်းများ" titleNumberOfLines={20} style={{backgroundColor:"#c1e5c3" }}  theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`မားစ်ကူးစက်မြန်ရောဂါသည် လူတစ်ဦးမှ တစ်ဦးသို့ ချောင်းဆိုးခြင်း၊ နှာချေခြင်းမှ တိုက်ရိုက်သော်လည်းကောင်း ရောဂါဖြစ်ပွားသူ၏ ချွဲ၊ သလိပ်၊ ခန္ဓာကိုယ်အရည်၊ အသုံး အဆောင်ပစ္စည်းများကို ကိုင်တွယ်ထိတွေ့ခြင်းမှသော်လည်းကောင်း ကူးစက်နိုင်ပါသည်။`}
titleNumberOfLines={200}/>
      </List.Accordion>

      <List.Accordion
        title="ကာကွယ်နိုင်မည့် နည်းလမ်းများ" titleNumberOfLines={20} style={{backgroundColor:"#c1e5c3"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`•	တစ်ကိုယ်ရေသန့်ရှင်းရေးကို အထူးဂရုပြုဆောင်ရွက်ခြင်း
•	နှာချေ၊ ချောင်းဆိုးလျှင် လက်ကိုင်ပုဝါ (သို့) တစ်ရှူးစက္ကူ(သို့) နှာခေါင်းစည်းဖြင့် ဖုံးအုပ်ခြင်း
•	လက်ကို ရေနှင့်ဆပ်ပြာဖြင့် စင်ကြယ်စွာ ဆေးကြောခြင်း
•	ကောင်းစွာအိပ်စက်အနားယူခြင်း
•	အာဟာရ ပြည့်ဝသည့် အစားအစာများ စားသုံးခြင်း
•	လေကောင်းလေသန့်ရရှိအောင် ဆောင်ရွက်နေထိုင်ခြင်း
•	သေချာစွာချက်ပြုတ်ထားသော အစားအစာများကိုသာ စားသုံးခြင်း
•	သစ်သီး/ ဟင်းသီးဟင်းရွက်များကို အစိမ်းစားသုံးမည်ဆိုပါက သေချာစွာဆေးကြောပြီးမှ စားသုံးခြင်း
•	လူထူထပ်သောနေရာများနှင့် ပွဲလမ်းသဘင်များအား သွားရောက်ခြင်းမှ ရှောင်ကြဉ်ခြင်း
•	ရောဂါရှိသူ၏ နေအိမ်နှင့် ဆေးရုံများသို့ မလိုအပ်ဘဲ သွားရောက်ခြင်းမှ ရှောင်ကြဉ်ခြင်း
•	တိရစ္ဆာန်များ (အထူးသဖြင့် -ကုလားအုတ်) ကိုထိတွေ့ကိုင်တွယ်ခြင်းမှ ရှောင်ကြဉ်ခြင်း`}
titleNumberOfLines={200}/>
<Text style={styles.subtitle}>{"\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0"}
  ရောဂါဖြစ်ပွား ကူးစက်လျက်ရှိသော နိုင်ငံများမှ မိမိနိုင်ငံအတွင်းသို့ ပြန်လည်ဝင်ရောက်လာသူများ အနေဖြင့် (၁၄)ရက်အတွင်း သံသယ ရောဂါလက္ခဏာများ ဖြစ်ပေါ်လာပါက နီးစပ်ရာ ဆေးရုံ၊ ဆေးခန်း၊ ကျန်းမာရေးဌာနများသို့ ချက်ခြင်းသတင်းပို့၍ ရောဂါကာကွယ် ကုသ ထိန်းချုပ်ခြင်းလုပ်ငန်းများ ဆောင်ရွက်ကြရန် လိုအပ်ပါသည်။
{"\n"}{"\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0"}
ကူးစက်လွယ်သော ရောဂါဖြစ်၍ ဆေးရုံဝန်ထမ်းများအနေဖြင့် လူနာပြုစုကိုင်တွယ်ရာတွင် အထူးဂရုပြုရန် လိုအပ်ပါသည်။
</Text>
        </List.Accordion>

</List.Section>
         </View>
       </ScrollView>
     )
   }

   const styles = StyleSheet.create({
    body :{
      flex:1,
      backgroundColor:'#D7FFD9',
      marginBottom:10,
      marginBottom:20,
    },
  headtitle:{
    color:'#102027',
    fontSize:30,
    marginTop:10,
    
  },
  subtitle:{
    color:'#260e04',
    fontSize:18,
    textDecorationLine: 'underline',
    margin:10,
  },
  p:{
    margin:7,
    color:'#4e342e',
    fontSize:15,
    lineHeight: 26,
  },
  subp:{
    color:'#4e342e',
    fontSize:15,
    backgroundColor:'#c1e5c3',
    textDecorationLine: 'underline',
  }

    
    })