import { Pressable, StyleSheet, Text, View } from 'react-native'
import React from 'react'
import { ScrollView } from 'react-native-gesture-handler'
import { List } from 'react-native-paper'


export default function inft({navigation}) {
    const onPresshundler = () => {
    
    navigation.goBack()
    }
     return(
       <ScrollView style={{backgroundColor:'#D7FFD9'}}>
         <View style={styles.body} >
         <Text style={styles.subtitle}>
         ၇.၂၀	အသည်းရောင်အသားဝါ (အီး)
         </Text>
         <Text style={styles.p}>{"\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0"}
         အသည်းရောင် အသားဝါရောဂါ(အီး) ပိုးကြောင့် ဖြစ်ပွားသော ရောဂါဖြစ်ပါသည်။ ရောဂါပိုးဝင်ရောက်ပြီး (၂)ပတ်မှ (၆)ပတ်အတွင်း များသောအားဖြင့် အလိုအလျောက် သက်သာသွားလေ့ရှိသော်လည်း အချို့တွင် ရုတ်တရက်အသည်းပျက်စီးပြီး သေဆုံးနိုင်သည် အထိဖြစ်ပွားတတ်ပါသည်။ </Text>
         
         <List.Accordion
        title="ရောဂါလက္ခဏာများ" titleNumberOfLines={20} style={{backgroundColor:"#c1e5c3"}} theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`•ဖျားခြင်း\n•အစားအသောက်ပျက်ခြင်း\n•အသားဝါခြင်း၊ မျက်လုံးဝါခြင်း၊ ဆီးအရောင်ရင့်ခြင်း\n•ပျို့အန်ခြင်း\n•ဗိုက်အောင့်ခြင်း၊ ယားခြင်း၊ အနီစက်များထွက်ခြင်း\n•အဆစ်အမြစ်ကိုက်ခဲခြင်း\n•အသည်းကြီး၍ ဝမ်းဗိုက်နာကျင်ခြင်း
    တစ်ခါတစ်ရံတွင် အသည်းရောင်အသားဝါရောဂါ (အီး) သည် ပြင်းထန်စွာခံစားရတတ်ပြီး ရုတ်တရက် အသည်းပျက်စီးခြင်း အခြေအနေအထိ ရောက်ရှိကာ အသက်ဆုံးရှုံးနိုင်ပါသည်။ ကိုယ်ဝန်ဆောင်မိခင်များတွင် ကိုယ်ဝန်ဒုတိယနှင့် တတိယ (၃)လပတ်များ၌ ရောဂါပိုးကူးစက်ခံရပါက အသည်းပျက်စီးခြင်း ပိုမိုဖြစ်ပွားနိုင်ပြီး ကိုယ်ဝန်ဆောင်မိခင်နှင့် သန္ဓေသား သေဆုံးသည်အထိ ဖြစ်နိုင်ပါသည်။`}
        titleNumberOfLines={200} />
      </List.Accordion>

      <List.Accordion
        title="ကူးစက်နိုင်သည့် နည်းလမ်းများ" titleNumberOfLines={20} style={{backgroundColor:"#c1e5c3" }}  theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`•	အသည်းရောင်အသားဝါရောဂါ (အီး) ပိုးသည် အများအားဖြင့် မသန့်ရှင်းသော ရေ၊ အညစ်အကြေး၊ မစင်စသည်တို့မှ တဆင့် အစာအိမ်နှင့် အူလမ်းကြောင်းအတွင်းသို့ ရောက်ရှိကူးစက်ခြင်း
•	သေချာစွာကျက်အောင် ချက်ပြုတ်မထားသော အသား၊ အသားစိမ်း (သို့မဟုတ်) ရောဂါပိုးကူးစက်ခံရသော တိရစ္ဆာန်တို့၏ အသားများအား စားသုံးမိခြင်း
•	ရောဂါပိုးပါဝင်နေသော သွေး(သို့) သွေးနှင့် ဆက်စပ်ပစ္စည်းများ သွင်းမိခြင်း
•	ရောဂါရှိသော ကိုယ်ဝန်ဆောင်မိခင်မှ သန္ဓေသားတို့ ကူးစက်ခြင်း
      တိုက်ပွဲများဖြစ်ပွားပြီး လုံခြုံမှုမရှိသော ဒုက္ခသည်စခန်းများ၊ ကယ်ဆယ်ရေးစခန်းများ၊ သန့်ရှင်းသော သောက်သုံးရေ မရရှိသော ဒေသများတွင် ကပ်ရောဂါအသွင် (သို့မဟုတ်) အစုလိုက်အပြုံလိုက် ဖြစ်ပွားတတ်သည်။`}
titleNumberOfLines={200}/>
      </List.Accordion>

      <List.Accordion
        title="ကာကွယ်နိုင်မည့် နည်းလမ်းများ" titleNumberOfLines={20} style={{backgroundColor:"#c1e5c3"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`•	တစ်ကိုယ်ရေသန့်ရှင်းရေး ဂရုစိုက်ပါ။ အစားအစာ မကိုင်တွယ်မီ၊ မချက်ပြုတ်မီ၊ အစာမစားမီနှင့် အိမ်သာအသုံးပြုပြီးတိုင်း လက်ကိုဆပ်ပြာဖြင့် စင်ကြယ်စွာ ဆေးကြောပါ။
•	အစားအစာများအား သေချာစွာ ကျက်အောင်ချက်ပြုတ်၍ ပူနွေးနွေးစားသုံးပါ။ အသား၊ ငါးနှင့် ပင်လယ်စာများအား မချက်ပြုတ်ဘဲ အစိမ်းစားသုံးခြင်းမှ ရှောင်ကြဉ်ပါ။
•	လက်သုပ်စာများ၊ ယင်နားစာများ စားသုံးခြင်းမှ ရှောင်ကြဉ်ပါ။ အစားအစာမျာအား ယင်မနားအောင် ဖုံးအုပ်ထားပါ။ 
•	အသီးအရွက်နှင့် အသားငါးများအား သန့်ရှင်းသောရေဖြင့် စင်ကြယ်စွာ ဆေးကြောပြီးမှ ချက်ပြုတ်စားသုံးပါ။ သစ်သီးဝလံများအား အခွံနွှာပြီးမှ စားသုံးပါ။
•	ရေကို ကျိုချက်သောက်သုံးပါ။
•	ယင်လုံအိမ်သာ ဆောက်လုပ်သုံးစွဲပါ။
•	ရောဂါဖြစ်ပွားသူလူနာများအနေဖြင့် အရေပြားနှင့် မျက်သားဝါပြီးနောက် (၁၀) ရက်ကြာသည်အထိ မိမိနေအိမ်တွင်သာ နေထိုင်ပါ။ အစားအသောက်ရောင်းချသူများတွင် ရောဂါဖြစ်ပွားပါက အရေပြားနှင့် မျက်သားဝါးပြီးနောက် (၁၀) ရက်ကြာသည် အထိအစားအသောက် ကိုင်တွယ်ရောင်းချခြင်းအား ရပ်နားထားပါ။
•	အကိုက်အခဲပျောက်ဆေးများ မလိုအပ်ဘဲ သောက်သုံးခြင်းမှ ရှောင်ကြဉ်ပါ။
•	အရက်အလွန်အကျွံသောက်သုံးခြင်းမှ ရှောင်ကြဉ်ပါ။
•	ဖျားခြင်း၊ အန်ခြင်း၊ ဗိုက်အောင့်ခြင်း၊ အစားအသောက်ပျက်ခြင်း၊ ကိုယ်လက်မအီမသာဖြစ်ခြင်း၊ အရေပြားနှင့် မျက်သားဝါခြင်း စသည့်ရောဂါလက္ခဏာများ ဖြစ်ပေါ်လာပါက နီးစပ်ရာကျန်းမာရေးဌာနသို့ အမြန်ဆုံးသွားရောက်ပြသပါ။ အဆိုပါရောပါ လက္ခဏာဖြစ်ပွားသူ သံသယလူနာများအား တွေ့ရှိပါက နီးစပ်ရာကျန်းမာရေးဌာနသို့ ချက်ချင်းသတင်းပို့ပါ။`}
titleNumberOfLines={200}/><Text style={styles.subtitle}>အသည်းရောင်အသားဝါရောဂါ (အီး) အတွက် ကာကွယ်ဆေးမရှိသေးပါ။</Text>
        </List.Accordion>
        
         </View>
       </ScrollView>
     )
   }

   const styles = StyleSheet.create({
    body :{
      flex:1,
      backgroundColor:'#D7FFD9',
      marginBottom:10,
      marginBottom:20,
    },
  headtitle:{
    color:'#102027',
    fontSize:30,
    marginTop:10,
    
  },
  subtitle:{
    color:'#260e04',
    fontSize:18,
    textDecorationLine: 'underline',
  },
  p:{
    margin:7,
    color:'#4e342e',
    fontSize:15,
    lineHeight: 26,
  },
  subp:{
    color:'#4e342e',
    fontSize:15,
    backgroundColor:'#c1e5c3',
    textDecorationLine: 'underline',
  }
    
    })