import { Pressable, StyleSheet, Text, View } from 'react-native'
import React from 'react'
import { ScrollView } from 'react-native-gesture-handler'
import { List } from 'react-native-paper'


export default function Pertwo({navigation}) {
    const onPresshundler = () => {
    
    navigation.goBack()
    }
     return(
       <ScrollView  style={{backgroundColor:'#B2FEF7'}}>
         <View style={styles.body} >
         <Text style={styles.subtitle}>
         (ခ) ကိုယ်လက်လှုပ်ရှား အားကစား နှင့် ကျန်းမာရေးနှင့် ညီညွတ်သော လူနေမှု ဘဝပုံစံများ
         </Text>
         <Text style={styles.p}>
         <Text style={styles.subtitle}>ကိုယ်လက်လှုပ်ရှားလေ့ကျင့်ခန်း</Text>
           {"\n"}
           {"\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0"}
           ခန္ဒာကိုယ် ကျန်းမာကြံ့ခိုင်ရန် ရည်ရွယ်၌ ပြုလုပ်ရမည့် အမျိုးအစား၊ ပြင်းထန်မှု၊ အချိန် နှင့်အကြိမ်တို့ကို စီစဉ်ရေးဆွဲထားသည့် အစီးအစဉ်အတိုင်း စနစ်တကျကိုယ်လက်လှုပ်ရှား ဆောင်ရွက်ခြင်းဖြစ်သည်။
           </Text>
           <List.Section title="" style={styles.headtitle}>
      <List.Accordion
        title="ခန္ဒာကိုယ်လှုပ်ရှားမှု" titleNumberOfLines={20} style={{backgroundColor:"#a0e4de"}} theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`       နေ့စဉ်လုပ်နေကျ ထိုင်၊ ထ၊ လမ်းလျှောက် စသည်များ၊ အသက်မွေးဝမ်းကျောင်းအလိုက် လုပ်ကိုင်ရသောလှုပ်ရှားမှု၊ အားလပ်နားနေချိန်မှာ ပြုလုပ်သော လှုပ်ရှားမှုတို့ပါဝင်ပါသည်။
ရောဂါကာကွယ်ခြင်း၊ ကုသခြင်း၊ ပြန်လည်ထူထောင်ခြင်းနှင့် ကျန်းမာရေး အဆင့်အတန်း မြှင့်တင်ခြင်း လုပ်ငန်းများတွင် ဆေးဝါးမပါ၊ အကုန်အကျ သက်သာပြီး မိမိကိုယ်တိုင် ဆောင် ရွက်နိုင်သောလုပ်ငန်းမှာ ကိုယ်လက်လှုပ်ရှားလေ့ကျင့်ခန်းဖြစ်ပါသည်။
ကိုယ်လက်လှုပ်ရှားလေ့ကျင့်ခန်းပြုလုပ်ခြင်း ရရှိိနိုင်သော အကျိုးကျေးဇူးများ
	ပုံမှန် ကိုယ်လက်လှုပ်ရှား လေ့ကျင့်ခန်းပြုလုပ်ခြင်းဖြင့် အောက်ပါ ရောဂါဖြစ်ပွားမှုကို ကာကွယ်နိုင်ခြင်း၊ ရောဂါဖြစ်ပွားနှုန်းနည်းစေခြင်းနှင့် ရောဂါရှိသော်လည်း ကျန်းမာစွာနေနိုင် စေပါသည်။
	(၁) နှလုံးသွေးကြောရောဂါများ
	(၂) သွေးတိုးရောဂါ
	(၃) အဝလွန်ရောဂါ
	(၄) သွေးချိုဆီးချိုရောဂါ
	(၅) ခါးနာရောဂါ၊ အဆစ်အမြစ်ရောင်ရောဂါ
	(၆) သွေးတွင် အဆီဓါတ်များခြင်း၊
	(၇) ကင်ဆာရောဂါများ
	(၈) သွေးကြောတွင်း သွေးခဲပိတ်ရောဂါ
	(၉) မှတ်ဉာဏ် ချို့ယွင်းမှုရောဂါ၊ သူငယ်ပြန်ရောဂါများ
       ထို့အပြင် အကြောင်းအမျိုးမျိုးကြောင့် အသက်အရွယ်အမျိုးမျိုးတွင် သေဆုံးနှုန်းကို လျော့နည်းကျဆင်းစေသည့်အပြင် အသက်အရွယ်အိုမင်းသည်အထိ သူတပါး အကူအညီမလို ကိုယ့်အားကိုယ်ကိုး၊ ကိုယ့်ခြေထောက်ပေါ်ကိုယ်ရပ်တည်နိုင်သည့် ပျော်ရွှင် ကျန်းမာသော ဘဝ ရရှိနိုင်ပါသည်။`}
        titleNumberOfLines={200} />
      </List.Accordion>

      <List.Accordion
        title="ကိုယ်လက်လှုပ်ရှားလေ့ကျင့်ခန်းနှင့် ပတ်သက်၍ သိထားသင့်သော အခြေခံအချက်များ" titleNumberOfLines={20} style={{backgroundColor:"#a0e4de" }}  theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`•	ကိုယ်လက်လှုပ်ရှား လေ့ကျင့်ခန်းပြုလုပ်ခြင်းကို ငယ်စဉ်ကလေးဘဝကစ၍ ပြုစုပျိုးထောင် ရပါမည်။
•	ရောဂါရှိသော်လည်း (သို့) အသက်အရွယ်ကြီးလာသော်လည်း သင့်လျော်သော ကိုယ်လက် လှုပ်ရှားလေ့ကျင့်ခန်းများ ပြုလုပ်နိုင်ပါသည်။ 
•	ကိုယ်လက်လှုပ်ရှား လေ့ကျင့်ခန်းဆောင်ရွက်ရာတွင် လေ့ကျင့်ခန်းအမျိုးအစား၊ ပြင်းထန်မှု၊ အချိန်ကြာမြင့်မှုနှင့် အကြိမ်တို့အပေါ်မူတည်၍ အကျိုးကျေးဇူးရရှိမှု ကွာခြားပါသည်။`}
titleNumberOfLines={200}/>
      </List.Accordion>

      <List.Accordion
        title="ကျန်းမာရေးအတွက် အကျိုးရှိစေမည့် ကိုယ်လက်လှုပ်ရှား လေ့ကျင့်ခန်း (၄)မျိုး" titleNumberOfLines={20} style={{backgroundColor:"#a0e4de"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`၁။သက်လုံးကောင်းမှုနှင့်သက်ဆိုင်သော လေ့ကျင့်ခန်း`}
titleNumberOfLines={200} style={styles.subp}/>
        <List.Item title={`    ဤလေ့ကျင့်ခန်းသည် ကိုယ်ခန္ဒာရှိကြွက်သားအများစု ပါဝင်ပြီး အချိန်ကြာကြာ ဆောင် ရွက်ရသောလေ့ကျင့်ခန်းဖြစ်ပါသည်။ သက်လုံကောင်းလာခြင်းဖြင့် မိမိလုပ်လိုသော အလုပ် များကို ပိုမိုလုပ်ကိုင်နိုင်မှာဖြစ်ပါသည်။ ထို့အပြင် နာတာရှည်ရောဂါများကိုလည်း မဖြစ်ပွားအောင်ကာကွယ်နိုင်ပါသည်။
	သက်လုံးကောင်းမှုနှင့်သက်ဆိုင်သောလေ့ကျင့်ခန်းများ
•	လမ်းလျှောက်ခြင်း (ပြင်ပ/လမ်းလျှောက်စက်)
•	ရွရွပြေးခြင်း၊ တာဝေးပြေးခြင်း
•	စက်ဘီးစီးခြင်း
•	ရေကူးခြင်း၊ လှေလှော်ခြင်း
•	ဘောလုံး၊ ဘော်လီဘော၊ ဘတ်စကတ်ဘောကစားခြင်း
•	ကြက်တောင်ရိုက်ခြင်း၊ တင်းနစ်ရိုက်ခြင်း
•	အေရိုးဗစ် ကစားခြင်း
•	လှေကားအဆင်းအတက်ပြုလုပ်ခြင်း
•	ခြေလျင်တောင်တက်ပြုလုပ်ခြင်း`}
titleNumberOfLines={200}/>
<List.Item title={`၂။ကြွက်သားအင်အားသန်မာမှုနှင့် သက်ဆိုင်သောလေ့ကျင့်ခန်း`}
titleNumberOfLines={200} style={styles.subp}/>
        <List.Item title={`    ကိုယ်ခန္ဓာရှိ ကြွက်သားများကြီးထွားသန်မာလာစေရန် ဆောင်ရွက်ရသော လေ့ကျင့် ခန်းဖြစ်ပါသည်။ ကြွက်သားအင်အားသန်မာမှုသည် ခန္ဓာကိုယ်ရွေ့လျားလှုပ်ရှားလုပ်ကိုင်နိုင်မှု အတွက် အဓိကအထောက်အကူပြုပါသည်။ မူလချိနဲ့နေသူများအတွက် ကြွက်သားအင်အား အနည်းငယ်တိုးရုံဖြင့် အမှီအခိုကင်းစွာ လှုပ်ရှားသွားလာပြုနိုင်ပါမည်။ ခန္ဓာကိုယ်အဆီမတိုး အောင် ထိန်းသိမ်းနိုင်သဖြင့် အဝလွန်ရောဂါ၊ ဆီးချိုရောဂါတို့အတွက် ကာကွယ်တားဆီး ကုသရန် အထောက်အကူပြုပါသည်။
ကြွက်သားအင်အားသန်မာမှုအတွက်လေ့ကျင့်ခန်း
•	အလေးမ (အလေးတုံး/အလေးမစက်များအသုံးပြုခြင်း)
•	စပရိန်များ/မျှော့ကြိုးများ အသုံးပြုသော လေ့ကျင့်ခန်းများ
•	မိမိကိုယ်ခန္ဓာအလေးချိန်ကို အသုံးပြုသော လေ့ကျင့်ခန်းများ - ဒိုက်ထိုးခြင်း၊ ဘာတန်းခိုခြင်း၊ ထိုင်ထပြုလုပ်ခြင်း`}
titleNumberOfLines={200}/>
<List.Item title={`၃။ခန္ဓာကိုယ်ဟန်ချက်ထိန်းသိမ်းမှုနှင့် သက်ဆိုင်သော လေ့ကျင့်ခန်း`}
titleNumberOfLines={200} style={styles.subp}/>
        <List.Item title={`ခန္ဓာကိုယ်ဟန်ချက်ထိန်းသိမ်းမှုနှင့် သက်ဆိုင်သော လေ့ကျင့်ခန်း
	ခန္ဓာကိုယ်ဟန်ချက် ထိန်းသိမ်းပေးနိုင်သော လေ့ကျင့်ခန်းဖြစ်ပါသည်။ ခန္ဓာကိုယ် ဟန်ချက်ပျက်၍ လဲကျခြင်းစသော မတော်တဆထိခိုက်ဒါဏ်ရာရခြင်းများကို ကာကွယ်ပေး ပါသည်။
ခန္ဓာကိုယ်ဟန်ချက်ထိန်းသိမ်းမှုနှင့် သက်ဆိုင်သော လေ့ကျင့်ခန်းများ
•	ခြေတစ်ချောင်းထောက်ရပ်ခြင်း
•	ထိုင်နေရာမှ လက်ကိုင်အားပြုမသုံးလဲ မတ်တပ်ရပ်ခြင်း
•	ဘယ်ညာတစ်လှည့်စီ ဖနောင့်နှင့် ခြေဖျားထိပ် ထိကပ်လမ်းလျှေက်ခြင်း
•	ထိုက်ကျိကစားခြင်း
•	ခန္ဓာကိုယ်ဟန်ချက်ထိန်း ဘောလုံးပျော့များ၊ ဘုတ်ပြားများ အသုံးပြုလေ့ကျင့်ခြင်း`}
titleNumberOfLines={200}/>
<List.Item title={`၄။ခန္ဓာကိုယ်ပျော့ပျောင်းမှုနှင့် သက်ဆိုင်သောလေ့ကျင့်ခန်း`}
titleNumberOfLines={200} style={styles.subp}/>
        <List.Item title={`     ခန္ဓာကိုယ်အရိုးအဆစ်များကို ပျော့ပျောင်းစေသော လေ့ကျင့်ခန်းဖြစ်ပါသည်။ ခန္ဓာကိုယ် အရိုးအဆစ်များ ပျော့ပျောင်းခြင်းသည် ထိခိုက်ဒါဏ်ရာရမှု၊ လဲကျမှုတို့ကို ကာကွယ်တားဆီး ပေးနိုင်ပါသည်။ 
	ခန္ဓာကိုယ်ပျော့ပျောင်းမှုနှင့် သက်ဆိုင်သောလေ့ကျင့်ခန်းများ
•	ထိုက်ကျိ
•	ယောဂ
•	အကြောအဆစ်များ ဆွဲဆန့်ပေးခြင်း
	သတိပြုရန်
	ပျော့ပျောင်းလွန်းက အဆစ်လွှဲတတ်ပါသည်။ တင်းလွန်းက အကြောကြွက်သားများ ပြတ်တတ်ပါသည်။`}
titleNumberOfLines={200}/>
      </List.Accordion>
      <List.Accordion
        title="ကိုယ်လက်လှုပ်ရှား လေ့ကျင့်ခန်း လုပ်ရမည့်အတိုင်းအတာ" titleNumberOfLines={20} style={{backgroundColor:"#a0e4de"}} theme={{colors:{primary:'#8e61ff'}}} >
          <List.Item title={`ကလေးနှင့် လူငယ်များ`}
titleNumberOfLines={200} style={styles.subp}/>
        <List.Item title={`•	ပြင်းထန်မှုအတော်အသင့်ရှိသည့် ကိုယ်လက် လှုပ်ရှား လေ့ကျင့်ခန်း (သို့) ပြင်းထန် သော ကိုယ်လက်လှုပ်ရှားလေ့ကျင့်ခန်းကို နေ့စဉ် (၆၀) မိနစ်ပြုလုပ်သင့်ပါသည်။
•	ပြင်းထန်သော ကိုယ်လက်လှုပ်ရှား လေ့ကျင့်ခန်းကို တစ်ပတ်လျှင် (၃)ရက် ခန့်ပါသင့် ပါသည်။
•	တစ်နေ့ (၆၀) မိနစ် ပြုလုပ်သည့်အထဲတွင် ကြွက်သားအင်အား သန်မာမှုအတွက် ကြွက်သားအုပ်စုများစွာ ပါဝင်သော လေ့ကျင့်ခန်းနှင့် အရိုးသန်မာစေသော လေ့ကျင့် ခန်း ဉပမာ - ကြိုးခုန်ခြင်းကို အနည်းဆုံး တစ်ပတ်လျှင် (၃)ရက် ပါဝင်သင့်ပါသည်။`}
titleNumberOfLines={200}/>

<List.Item title={`လူကြီး`}
titleNumberOfLines={200} style={styles.subp}/>
        <List.Item title={`•	ပြင်းထန်မှုအတော်အသင့်ရှိသည့် ကိုယ်လက်လှုပ်ရှား လေ့ကျင့်ခန်း (ဉပမာ - တစ်နာရီ ၃မိုင်နှုန်း လမ်းလျှောက်ခြင်း) ကို တစ်ပတ်လျှင် ၁၅၀ မိနစ်ခန့်ပြုလုပ်ပါ။
•	ကြွက်သားအင်အားသန်မာမှုအတွက် ကြွက်သား အုပ်စုများစွာပါဝင်သော လေ့ကျင့်ခန်း ကို တစ်ပတ်လျှင် (၂) ရက်နှင့် အထက်ပြုလုပ်သင့်ပါသည်။
•	ပြင်းထန်သော ကိုယ်လက် လှုပ်ရှား လေ့ကျင့်ခန်း (ဉပမာ - ရွရွပြေးခြင်း၊ တစ်နာရီ ၅မိုင်နှုန်းနှင့် အထက်ပြေးခြင်း) ကို တစ်ပတ်လျှင် ၇၅ မိနစ်ခန့်ပြုလုပ်ပါ။
•	ပြင်းထန်မှု အတော်အသင့်ရှိသည့် ကိုယ်လက်လှုပ်ရှား လေ့ကျင့်ခန်းကို တစ်နေ့ (၃၀) မိနစ် တစ်ပတ်လျှင် (၃)ရက် ပြုလုပ်နိုင်ပါသည်။
•	ပြင်းထန်သော ကိုယ်လက်လှုပ်ရှား လေ့ကျင့်ခန်းကို တစ်နေ့ (၁၅)မိနစ် တစ်ပတ်လျှင် (၂)ရက် ပြုလုပ်နိုင်ပါသည်။`}
titleNumberOfLines={200}/>
<List.Item title={`အသက်(၆၅)နှစ်နှင့်အထက် လူကြီးများ`}
titleNumberOfLines={200} style={styles.subp}/>
        <List.Item title={`•	လူကြီး အတိုင်းအတာအတိုင်း ဆောင်ရွက်နိုင်ပါသည်။
•	သို့သော် ကိုယ်လက် လှုပ်ရှား အလေ့အကျင့် မရှိသူများနှင့် ပိုမိုအိုမင်းလာပါက ချင့်ချိန် ဆောင်ရွက်ရပါမည်။
•	အသက်(၅၀)ကျော်လာပါက ဆရာဝန်နှင့်ပြသတိုင်ပင်ပြီး ဆောင်ရွက်ပါကပိုကောင်း ပါသည်။
•	ကိုယ်လက်လှုပ်ရှားလေ့ကျင့်ခန်းကို သွေးချိုဆီးချိုရောဂါ၊ နှလုံးရောဂါရှိသူများပင်လျှင် ဆရာဝန်နှင့် တိုင်ပင်ပြသဆောင်ရွက်နိုင်ပါသည်။`}
titleNumberOfLines={200}/>
<List.Item title={`ကိုယ်ဝန်ဆောင်မိခင်များ`}
titleNumberOfLines={200} style={styles.subp}/>
        <List.Item title={`ကိုယ်ဝန်ဆောင်စဉ်အတွင်းနှင့်မွေးဖွားပြီးချိန်တွင်
•	ပြင်းထန်မှုအတော်အသင့်ရှိသည့် ကိုယ်လက်လှုပ်ရှား လေ့ကျင့်ခန်း (ဉပမာ - တစ်နာရီ ၃မိုင်နှုန်း လမ်းလျှောက်ခြင်း) ကို တစ်ပတ်လျှင် ၁၅၀ မိနစ်ခန့် ဆောင်ရွက်သင့်ပါ သည်။
•	လေ့ကျင့်ခန်း ဆောင်ရွက်ခြင်းကို ပုံမှန်ဆောင်ရွက်သင့်ပါသည်။
•	ပြင်းထန်သော ကိုယ်လက်လှုပ်ရှား လေ့ကျင့်ခန်း ဆောင်ရွက်နေကျြဖစ်ပါက ဆက်လက် ဆောင်ရွက်နိုင်ပါသည်။ သို့သော် ဆရာဝန်နှင့် တိုင်ပင်ဆောင်ရွက်သင့်ပါသည်။
ကိုယ်ဝန်ဆောင်စဉ် ကာလတွင်
•	ကိုယ်လက်လှုပ်ရှား လေ့ကျင့်ခန်း စတင်ပြုလုပ်မည်ဆိုပါက ပြင်းထန်မှု နည်းနည်းနှင့် စ၍ ဖြေးဖြေးချင်းတိုး၍သာ ဆောင်ရွက်သင့်ပါသည်။
•	ကိုယ်ဝန်တောင်စဉ် ကာလတွင် ပက်လက် လဲလျောင်း ဆောင်ရွက်ရသော၊ ချော်လဲ နိုင်သော၊ ဝမ်းဗိုက်ထိခိုက်နိုင်သော လေ့ကျင့်ခန်းများ ရှောင်ကြဉ်သင့်ပါသည်။`}
titleNumberOfLines={200}/>
<List.Item title={`        ကိုယ်ဝန်ဆောင်စဉ်ကာလတွင် ကိုယ်လက်လှုပ်ရှား လေ့ကျင့်ခန်းပြုလုပ်ခြင်းကြောင့် အချိန်မကျမီ ကလေးစောမွေးခြင်း၊ ပေါင်မပြည့်သော ကလေးမွေးခြင်း၊ ကိုယ်ဝန်ပျက်ခြင်း၊ ကလေးကြီးထွားမှု ထိခိုက်ခြင်း၊ မိခင်နို့ထွက်ပြောင်းလဲခြင်းတို့မဖြစ်ပါ။`}
titleNumberOfLines={200} style={styles.subp}/>
 </List.Accordion>
 <List.Accordion
        title="လေ့ကျင့်ခန်း ပြင်းထန်မှုကို ခန့်မှန်းခြင်း" titleNumberOfLines={20} style={{backgroundColor:"#a0e4de"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`သတိမူမိသောပင်ပန်းမှုနှုန်း
	ပြင်းထန်မှုအတော်အသင့်
•	အင်အားစိုက်ထုတ်လုပ်ကိုင်ရပြီး အသက်ရှုနှုန်းနှင့် နှလုံးခုန်နှုန်းမြန်စေနိုင်သော အတိုင်းအတာပြင်းထန်
•	အင်အားပိုမိုစိုက်ထုတ်လုပ်ကိုင်ရပြီး အသက်ရှူနှုန်း အလွန်မြန်ကာ ရင် (နှလုံး) တဒိန်းဒိန်း ခုန်စေနိုင်သော အတိုင်းအတာ`}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="သတိပြုရန်အချက်များ" titleNumberOfLines={20} style={{backgroundColor:"#a0e4de"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`•	ကိုယ်လက်လှုပ်ရှား လေ့ကျင့်ခန်း စတင်ပြုလုပ်မည်ဆိုပါက ပြင်းထန်မှု နည်းနည်းနှင့် စ၍ ဖြေးဖြေးချင်းတိုး၍သာ ဆောင်ရွက်သင့်ပါသည်။ 
(အထူးသဖြင့် မူလက ကိုယ်လက်လှုပ်ရှားမှု နည်းသူဖြစ်ပါက)
•	ကြွက်သားအင်အားသန်မာမှုအတွက် လေ့ကျင့်ခန်းများပြုလုပ်စဉ် အသင့်အောင့်မ ထားပါနှင့်။ သွေးပေါင်ချိန် တက်စေနိုင်ပါသည်။
•	ထိခိုက်မှုကာကွယ်သော အားကစားအထောက်အကူပစ္စည်းများ သုံးစွဲပါ။ (ဥပမာ - စက်ဘီးစီးဦးထုပ်)
•	ရေများများသောက်ပေးပါ။
•	ခါးကွေးဆန့်မှုပါဝင်သော လှုပ်ရှားမှုများအတွက် တင်ပါးနေရာမှ ကွေးဆန့်ပါ။ ခါးမှ ကွေးဆန့်ခြင်း မပြုလုပ်ပါနှင့်။
•	ကိုယ်လက် လှုပ်ရှား လေ့ကျင့်ခန်း မစတင်မှ သွေးပူလေ့ကျင့်ခန်းနှင့် လေ့ကျင့်ခန်းအပြီး သွေးအေးလေ့ကျင့်ခန်းပြုလုပ်ပါ။
•	ပြုလုပ်သော ကိုယ်လက်လှုပ်ရှား ‌လေ့ကျင့်ခန်းသည် အလွန်မောပမ်းနွမ်းနယ်စေပြီး ခန္ဓာကိုယ်နာကျင်စေသည့် အတိုင်းအတာ မဖြစ်ရပါ။`}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="အောက်ပါအခြေအနေများတွင် ဆရာဝန်နှင့် တိုင်ပင်ဆွေးနွေးပါ။" titleNumberOfLines={20} style={{backgroundColor:"#a0e4de"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`ကိုယ်လက် လှုပ်ရှား လေ့ကျင့်ခန်းပြုလုပ်စဉ် ကာလတွင်
•	ယခင်မရှိခဲ့သော ဝေဒနာ တစ်ခုခု ခံစားရခြင်း
•	ခေါင်းမူးဝေခြင်း
•	အသက်ရှူ မဝခြင်း၊ အသက်ရှူကြပ်ခြင်း
•	ရင်ဘတ်အောင့်ခြင်း
•	ကိုယ်အလေးချိန်ကျလာခြင်း
•	ကိုယ်လက်ကိုက်ခဲဖျားနာခြင်း
•	အဆစ်အမြစ်ယောင်ခြင်း
•	ခြေဖဝါး၊ ခြေကျင်းဝတ်နာခြင်း
•	အူကျရောဂါဖြစ်လာခြင်း
	မူလကတည်းက နာတာရှည်ရောဂါ (နှလုံးရောဂါ၊ သွေးချိုဆီးချိုရောဂါ၊ အဆစ်အမြစ် ရောင် ရောဂါရှိသူများ) သည် မိမိတို့နှင့် သင့်လျော်သော ပြုလုပ်ရမည့် လေ့ကျင့်ခန်း အမျိုးအစားနှင့် ပြင်းထန်းမှု အတိုင်းအတာတို့ကို သက်ဆိုင်ရာဆရာဝန်နှင့် တိုင်ပင်ဆွေးနွေးပြီးမှ ဆောင်ရွက်သင့်ပါသည်။
•	ပျော်ရွှင်ကျန်းမာသော ဘဝရရန် ခန္ဓာကိုယ်လှုပ်ရှားမှု မရှိခြင်းထက် ခန္ဓာကိုယ် လှုပ်ရှား ဆောင်ရွက်မှုများ ရှိခြင်းက ပေးစွမ်းနိုင်ပါသည်။
•	ကိုယ်လက်လှုပ်ရှားလေ့ကျင့်ခန်းလုပ်ခြင်းသည် ပျော်ရွှင်ကျန်းမာသောဘဝ ရရှိနိုင်ရန် လူတိုင်းအတွက် ကောင်းမွန်စိတ်ချရသော နည်းလမ်းကောင်း ဖြစ်ပါသည်။
•	နှလုံးရောဂါ၊ သွေးချိုဆီးချိုရောဂါ၊ အဆစ်အမြစ်ရောင်ရောဂါရှိသူများပင် ကိုယ်လက်လှုပ်ရှား လေ့ကျင့်ခန်းပြုလုပ်ခြင်းဖြင့် ရောဂါကုသရာတွင် အထောက် အကူပေးပါသည်။
•	ကိုယ်လက်လှုပ်ရှား လေ့ကျင့်ခန်း ကိုယနေ့မှစပြီး စတင်ပါ။
•	ကိုယ်လက်လှုပ်ရှား လေ့ကျင့်ခန်းကို တစ်ပိုင်တစ်နိုင် ကြိုးစားဆောင်ရွက်ပါ။
ကျန်းမာရေးနှင့်ညီညွတ်သော လူနေမှုဘဝပုံစံများ
	ကျန်းမာခြင်းဆိုသည်မှာ ခန္ဓာကိုယ်ချို့ယွင်းမှုကင်း၍ ရောဂါဘယကင်းရှင်းယုံ သာမက၊ ကိုယ်၏ ကျန်းမာခြင်း၊ စိတ်၏ချမ်းသာခြင်း၊ လူမှုရေးသုခနှင့် ပြည့်စုံခြင်းတို့ကို ဆိုလိုပါသည်။
၁။	လက်ဆေးခြင်းအမူအကျင့်များအပါအဝင် တစ်ကိုယ်ရေသန့်ရှင်းမှုကို ဆောင်ရွက်ပါ။
၂။	အန္တရာယ်ကင်း၍ ကျန်းမာရေးနှင့်ညီညွတ်သည့် အာဟာရပြည့်ဝသော အစားအစာ များကို စားသုံးပါ။ ဆီနှင့် အငန်းများသော အစားအစာများကို ရှောင်ကြဉ်ပါ။ ဟင်းချိုမှုန့် စားသုံးခြင်းကို လုံးဝရှောင်ကြဉ်ပါ။
၃။	လူကို အန္တရာယ်ဖြစ်စေတတ်သော ဓါတ်သတ္ထုနှင့် ပိုးမွှားကင်းစင်သည့် သန့်ရှင်းသော ရေကို‌ သောက်သုံးပါ။
၄။	ရာသီဉတုနှင့် လိုက်လျောညီထွေစွာ ဝတ်စားဆင်ယင်နေထိုင်ပါ။
၅။	အသက်အရွယ်နှင့် လိုက်လျောညီထွေသည့် သင့်တင့်မျှတသော ကိုယ်လက်လှုပ်ရှားမှု ကို နေ့စဉ်မှန်မှန်ဆောင်ရွက်ပါ။
၆။	နေ့စဉ်လုပ်ငန်းဆောင်တာများ ဆောင်ရွက်ခြင်းကြောင့် ပင်ပန်းနွမ်းနယ်မှုကို ပြေ ပျောက်စေရန် လုံလောက်စွာအနားယူပါ။
၇။	ဘယ်အချိန်အိပ်အိပ်၊ ဘယ်နေရာအိပ်အိပ် ခြင်ထောင်ဖြင့် အိပ်ပါ။ ဖြစ်နိုင်လျှင် ဆေးစိမ် ခြင်ထောင်ဖြင့် အိပ်ပါ။
၈။	ကျန်းမာရေးနှင့် ညီညွတ်သည့် သန့်ရှင်းသော ယင်လုံအိမ်သာကို သုံးစွဲပါ။
၉။	အရက်သောက်ခြင်းကို ရှောင်ကြဉ်၍ ဆေးလိပ်နှင့်ဆေးရွက်ကြီးထွက် ပစ္စည်းများ သောက်သုံးခြင်း၊ ကွမ်းစားခြင်းတို့ကို လုံးဝရှောင်ကြဉ်ပါ။
၁ဝ။	မူးယစ်ဆေးဝါးနှင့် စိတ်ကိုပြောင်းလဲစေသော ဆေးဝါးများ သုံးစွဲခြင်းကို လုံးဝရှောင် ကြဉ်ပါ။
၁၁။	လိင်အပျော်အပါးလိုက်စားခြင်းကို ရှောင်ကြဉ်ပါ။ မရှောင်နိုင်ပါက ကွန်ဒုံးသုံးစွဲပါ။
၁၂။	သဘာဝပတ်ဝန်းကျင် (ရေ၊ မြေ၊ လေ)ကို ညစ်ညမ်းစေသည့် အပြုအမူများဖြစ်သော မြေပေါ်ရေပေါ်တွင် မစင်စွန့်ခြင်း၊ စည်းကမ်းမဲ့ အမှိုက်စွန့်ပစ်ခြင်း၊ အန္တရာယ်ဖြစ်စေ သည့် ဓါတ်ငွေ့များ၊ မီးခိုးငွေ့များကို စည်းကမ်းမဲ့ စွန့်ထုတ်ခြင်းတို့ကို ရှောင်ကြဉ်ပါ။
၁၃။	ယာဉ်အန္တရာယ်ကင်းဝေးရေးအတွက် ယာဉ်စည်းကမ်း လမ်းစည်းကမ်းများကို လိုက်နာပါ။
၁၄။	စိတ်ဖိစီးမှုများ တတ်နိုင်သလောက် လျှော့ချပါ။
၁၅။	သဘာဝဘေးအန္တရာယ်နှင့် ပတ်သက်သော သတင်းအချက်အလက်များကို အစဉ်သတိ ပြုလိုက်နာဆောင်ရွက်ပါ။`}
titleNumberOfLines={200}/>
        </List.Accordion>

    </List.Section>

         </View>
       </ScrollView>
     )
   }

   const styles = StyleSheet.create({
    body :{
      flex:1,
      backgroundColor:'#B2FEF7',
      marginBottom:10,
      marginBottom:20,
    },
  headtitle:{
    color:'#102027',
    fontSize:30,
    marginTop:10,
    
  },
  subtitle:{
    color:'#260e04',
    fontSize:18,
    textDecorationLine: 'underline',
    margin:10,
  },
  p:{
    margin:7,
    color:'#4e342e',
    fontSize:15,
    lineHeight: 26,
  },
  subp:{
    color:'#4e342e',
    fontSize:15,
    backgroundColor:'#a0e4de',
    textDecorationLine: 'underline',
  }
    
    })