import { Image, Pressable, StyleSheet, Text, View,Dimensions } from 'react-native'
import React from 'react'
import { ScrollView } from 'react-native-gesture-handler'
import { List } from 'react-native-paper'


export default function Neoeight({navigation}) {
    const onPresshundler = () => {
    
    navigation.goBack()
    }
     return(
       <ScrollView style={{backgroundColor:'#D1D9FF'}}>
         <View style={styles.body} >
         <Text style={styles.subtitle}>
         အစာအုပ်စုနှင့် အာဟာရဓါတ်များ
         </Text>

         <List.Section title="" style={styles.headtitle}>
    
  <List.Accordion
        title="အစာအုပ်စုများ" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5"}} theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`အစားအစာတို့တွင် ကြွယ်ဝစွာပါဝင်သည့် အာဟာရဓာတ်များ၏ အဓိကအကျိုးပြုမှု အပေါ်မူတည်၍ အစာအုပ်စု(၃)စု ခွဲခြားထားပါသည်။ အစာအုပ်စု (၃)စုမှ အစားအစာများကို စုံလင်မျှတစွာ ပါဝင်အောင် နေ့စဉ်ပြင်ဆင်စားသုံးရပါမည်။
အာဟာရဓာတ်
	အာဟာရဓာတ်သည် အသွေး၊ အသား၊ အင်အားတို့ကို ဖြစ်စေတတ်သော ဩဇာဓာတ် ဖြစ်သည်။ သက်ရှိသတ္တဝါတို့ ခန္ဓာကိုယ် အသက်ရှင်ကျန်းမာရေးအတွက် လိုအပ်သော ဇီဝဓာတု ပစ္စည်းများဖြစ်ပြီး အစားအစာများ စားသုံးခြင်းဖြင့် ရရှိနိုင်သည်။ ခန္ဓာကိုယ် ဖွံ့ဖြိုး ခြင်း၊ လှုပ်ရှားသွားလာခြင်း၊ မျိုးဆက်ပွားခြင်း၊ အင်အားဖြစ်စေခြင်းနှင့် ရောဂါကာကွယ်ခြင်း တို့အတွက် အာဟာရဓာတ်အမျိုးမျိုးလိုအပ်သည်။ အာဟာရလိုအပ်ချက်များသည် အသက် အရွယ်၊ ကျား/မ ကိုယ်လက်လှုပ်ရှားမှု၊ ကျန်းမာရေးအခြေအနေတို့အရ ကွာခြားသည်။
အာဟာရဓာတ်(၆)မျိုး
	ခန္ဓာကိုယ်အတွက် လိုအပ်သော အာဟာရဓာတ် (၆)မျိုးမှာ (က) ကစီဓာတ် (ခ) အဆီ ဓာတ် (ဂ) အသားဓာတ် (ဃ) သတ္တုဓာတ် (င) ဗီတာမင်ဓာတ်နှင့် (စ) ရေဓာတ်တို့ ဖြစ်ကြ သည်။`}
        titleNumberOfLines={200} />
      </List.Accordion>

      <List.Accordion
        title="အစာအုပ်စုနှင့် အာဟာရဓာတ် ကြွယ်ဝသောအစာများ" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5" }}  theme={{colors:{primary:'#8e61ff'}}}
        >
     <Image source={require('../to/neoeight.png')} style={styles.img}/>
        <List.Item title={`အာဟာရမျှတစေရန် နေ့စဉ်စားသုံးသည့် အကြိမ်တိုင်းတွင် အစာအုပ်စု (၃)စုလုံး ပါအောင်စားပါ။`}
titleNumberOfLines={200}/>
      </List.Accordion>
      
      <List.Accordion
        title="အစာအာဟာရဆိုင်ရာ လိုက်နာသင့်သည့် အချက်များ" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`၁။	နေ့စဉ် စားသုံးသည့်အကြိမ်တိုင်းတွင် အစာအုပ်စု (၃)စုလုံး ပါအောင်စားပါ။
၂။	အသား၊ ငါး၊ ဥအမျိုးမျိုး၊ နို့နှင့် နို့ထွက်ပစ္စည်းများကို နေ့စဉ်စားသုံးပါ။
၃။	ဟင်းသီးဟင်းရွက်နှင့် သစ်သီးဝလံများကို များများစားသုံးပါ။
၄။	အိုင်အိုဒင်းဆားကိုသာ သုံးစွဲပါ။
၅။	ရေကိုလုံလောက်အောင်သောက်ပါ။
၆။	အသင့်စားအစားများထက် သန့်ရှင်းလတ်ဆတ်၍ ဘေးဥပါဒ်အန္တရာယ်ကင်းသော သဘာဝအစာများကို ရွေးချယ်စားသုံးပါ။
၇။	အဆီအမျိုးမျိုး၊ အငန်နှင့် ချိုသောအစာများကို ဆင်ခြင်၍ စားသုံးပါ။
၈။	အချိုရည်များကို ဆင်ခြင်၍ သောက်သုံးပါ။
၉။	ကိုယ်ဝန်ဆောင်များနှင့် နို့တိုက်မိခင်များ အာဟာရပြည့်ဝသောအစာများ ပိုစားပါ။ အစားမရှောင်ပါနှင့်၊ မွေးစမှအသက်(၆)လထိ မိခင်နို့တစ်မျိုးတည်းသာ တိုက်ကျွေးပါ။
၁၀။	အသက် (၆)လမှ စတင်၍ အာဟာရပြည့်ဝသော ဖြည့်စွက်စာအမျိုးမျိုးကို အသက် အရွယ်အလိုက် စုံလင်အောင်ကျွေးရင်း မိခင်နို့ကို အသက် (၂)နှစ်အထိ တိုက်ကျွေးပါ။
၁၁။	ကလေးများနှင့် ပျိုဖော်ဝင်အရွယ်များ အစွမ်းကုန် ကြီးထွားဖွံ့ဖြိုးနိုင်စေရန် ခန္ဓာကိုယ် ကြီးထွားဖွံ့ဖြိုးနိုင်စေရန် ခန္ဓာကိုယ်ကြီးထွားဖွံ့ဖြိုးစေသော အစာများပို၍ကျွေးပါ။
၁၂။	သက်ကြီးဘိုးဘွားဘဝတွင် အာဟာရဓါတ်များ ကြွယ်ဝသည့်အစာများကိုသာ ရွေးချယ်စားသုံးပါ။`}
titleNumberOfLines={200}/>
        </List.Accordion>
        <Text style={styles.subtitle}>အဏုအာဟာရဓါတ်များ</Text>
        <List.Accordion
        title="ဗီတာမင်အေ အာဟာရ" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`ဗီတာမင်အေသည်ကလေးများ ပုံမှန်ကြီးထွားဖွံ့ဖြိုးရေးနှင့် ကျန်းမာရေးကြံ့ခိုင်ရေး၊ မျက်စိကျန်းမာရေးနှင့် အမြင်အာရုံကောင်းမွန်ရေးအတွက်လည်း အရေးကြီးသော ဗီတာမင် တစ်မျိုးဖြစ်သည်။
အစားအစာမှ ဗီတာမင်အေ အလုံအလောက်မရရှိပါက ဗီတာမင်အေ ချို့တဲ့နိုင်ခြင်း
(၁)	ကိုယ်ဝန်ဆောင် အမျိုးသမီးများ မလိုအပ်ဘဲ အစားရှောင်လျှင် ဗီတာမင်အေ အလုံ အလောက် မရရှိနိုင်တော့ပေ။ ထိုမိခင်များ၏ နို့ကိုစို့ရသော ကလေးများ ဗီတာမင်အေ ချို့တဲ့ တတ်သည်။
(၂)	နို့တိုက်မိခင်များ မလိုအပ်ဘဲ အစားရှောင်လျှင် ဗီတာမင်အေ အလုံအလောက် မရရှိ နိုင်တော့ပေ။ ထိုမိခင်များ၏ နို့ကိုစို့ရသောကလေးများ ဗီတာမင်အေ ချို့တဲ့တတ် သည်။
(၃)	ကလေးငယ်များကို ဗီတာမင်အေကြွယ်ဝသည့် အစားအစာများ လုံလောက်စွာ မကျွေးလျှင် ထိုကလေးများ၌ ဗီတာမင်အေ ချို့တဲ့တတ်သည်။`}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="ဗီတာမင်အေ ချို့တဲ့လျှင်" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`•	ကလေးများ ပုံမှန်မကြီးထွား မဖွံ့ဖြိုးနိုင်ပါ။
•	ကူးစက်ရောဂါအမျိုးမျိုးကြောင့် မကြာခဏဖျားနားတတ်သည်။
•	ဖျားနားလျှင် နာတာရှည်တတ်သည်။ ပြင်းထန်တတ်သည်။
•	ကြက်မျက်သင့်ရောဂါ ခံစားရတတ်သည်။
•	မျက်ဖြူသားနှင့် မျက်ကြည်လွှာတို့ ခြောက်သွေ့ပြီး မတောက်ပြောင်တော့ပေ။
•	မျက်ကြည်လွှာတွင် အနာဖြစ်နိုင်သည်။
•	အနာပျောက်သော်လည်း အပြင်တိမ်စွဲနိုင်သည်။
•	မျက်ကြည်လွှာပေါက်၍ မျက်စိကွယ်ခြင်းတို့ ဖြစ်တတ်သည်။
•	အခြားရောဂါများဖြစ်ပွားပါက ရောဂါပြင်းထန်ပြီး အသက်အန္တရာယ်ကြုံတွေ့ရတတ် သည်။`}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="ဗီတာမင်အေဓာတ် များများပါသည့် အစာများစားပါ။ ကျွေးပါ။" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`(၁)	ကိုယ်ဝန်ဆောင်နှင့် နို့တိုက်မိခင်များ ဗီတာမင်အေ ကြွယ်ဝသည့်အစာများကို လုံလောက်စွာ စားသုံးပါ။
(၂)	မီးဖွားပြီး ပထမတစ်ရက် နှစ်ရက်တွင်ထွက်သည့် နို့ဦးရည်သည် ဗီတာမင်အေ အလွန် ကြွယ်ဝသည်။ ကလေးကို နို့ဦးရည်တိုက်ဖြစ်အောင် တိုက်ပါ။
(၃)	ကလေးအသက် (၆)လအထိ မိခင်နို့တစ်မျိုးတည်းကိုသာ တိုက်ကျွေးပါ။
(၄)	အသက် (၆)လမှစ၍ ထမင်းခွံ့သည့်အခါ ဗီတာမင်အေကြွယ်ဝသည့် အောက်ပါအစား အစာများကို အသက်အရွယ်အလိုက် ထည့်ကျွေးပါ။
	အသည်းအမျိုးမျိုး၊ ဉအမျိုးမျိုး၊ နို့အမျိုးမျိုး၊ အစိမ်းရင့်ရောင် ဟင်းရွက်များ၊ နီဝါရောင် သစ်သီးများ၊ အဝါရောင် ဟင်းသီးများအဝါရောင်နှင့် အနီရောင် သစ်ဉသစ်ဖုများ။`}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="အင်အားဖြည့် ဗီတာမင်အေ ဆေးလုံးသောက်ပါ။ တိုက်ကျွေးပါ။" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`(၁)	နို့တိုက်မိခင်တိုင်း မွေးဖွားပြီး တစ်လအတွင်း အင်အားပြည့် ဗီတာမင်အေ ယူနစ်နှစ် သိန်းပါ ဆေးလုံးတစ်လုံး တစ်ကြိမ်သောက်ပါ။
        (၂)	အသက် (၆)လမှ (၁၁)လအရွယ်အထိ ကလေးတိုင်းကို အင်အားပြည့် ဗီတာမင်အေ ယူနစ်တစ်သိန်းပါ ဆေးလုံးတစ်လုံး တစ်ကြိမ်တိုက်ကျွေးပါ။
        (၃)	အသက် (၁) နှစ်မှ (၅)နှစ်အတွင်း ကလေးတိုင်းကို အင်အားပြည့်ဗီတာမင်အေ ယူနစ် နှစ်သိန်းပါ ဆေးလုံးတစ်လုံး (၆)လတစ်ကြိမ် တိုက်ကျွေးပါ။
        (၄)	ဝက်သက်ပေါက်သော ကလေးများ လတ်တလောပြင်းထန် အာဟာရချို့တဲ့ပြီး ပိန်လှီ (သို့မဟုတ်) ဖောယောင်နေသော ကလေးများကို ဗီတာမင်အေ ဆေးလုံးတိုက်ပါ။ (ပထမနေ့တွင် တစ်လုံး၊ ဒုတိယနေ့တွင် တစ်လုံး၊ ၁၅ ရက်မြောက်နေ့တွင် တစ်လုံး တိုက်ပါ။)`}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="ဗီတာမင်ဘီဝမ်း" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`ဗီတာမင်ဘီဝမ်း ချို့တဲ့မှုကြောင့် သူငယ်နာ (ဘယ်ရီဘယ်ရီ) ရောဂါဖြစ်နေသော ကလေးသည် အချိန်မီကုသမှု မခံရပါက သေဆုံးသွားနိုင်သည်။ ထိုကလေးအတွက် ဗီတာမင် ဘီဝမ်း ထိုးဆေးသည် အသက်ကယ်ဆေးဖြစ်ပါသည်။
ရောဂါဖြစ်ရခြင်းအကြောင်းရင်း
•	နို့တိုက်မိခင် အစားရှောင်လွန်းခြင်း
•	ဆန်ကို အလွန်ဖြူသည်အထိ ကြိတ်ခွဲစားသုံးခြင်း
•	ဆန်ကို အထပ်ထပ်ဆေးကြောခြင်း၊ ထမင်းရည်ငှဲ့ခြင်း
ဗီတာမင်ဘီဝမ်း ချို့တဲ့မှုကြောင့်ဖြစ်သည့် သူငယ်နာ (ဘယ်ရီဘယ်ရီ)ရောဂါ၏ လက္ခဏာများ
•	မိခင်နို့စို့နေသည့် အသက် (၁)လမှ (၆)လအရွယ် ကလေးများတွင် အများဆုံး ဖြစ်တတ်ပါသည်။
•	ကျန်းမာနေသော ကလေးသည် ရုတ်တရက်
o	တအင်အင် အဆက်မပြတ် ငိုညည်းနေခြင်း
o	ငိုညည်းနေရာမှ အဆက်မပြတ် ငိုညည်းနေခြင်း
o	အသက်ရှူ ခက်ခဲလာခြင်း
o	ပြာနှမ်းလာခြင်း
o	အော့အန်ခြင်း
o	မျက်ဖြူလန်ခြင်းတို့ ဖြစ်တတ်ပါသည်။
နို့စို့ကလေးငယ်များတွင် ဗီတာမင်ဘီဝမ်းချို့တဲ့မှုကြောင့် သူငယ်နာ (ဘယ်ရီဘယ်ရီ) ရောဂါ မဖြစ်စေရန်
•	ကိုယ်ဝန်ဆောင်နှင့် နို့တိုက်မိခင်များ အာဟာရဖြစ်သည့် အစားအစာများ စုံလင်လုံလောက် အောင်စားပါ။ အစားမရှောင်ပါနှင့်။
•	အလွန်ဖြူအောင် ကြိတ်ခွဲထားသည့်ဆန်ကို မစားသင့်ပါ။
•	ထမင်းချက်ရန် ဆန်ဆေးသည့်အခါ ဆန်ကိုရေနှင့် အထပ်ထပ် ပွတ်သပ်ဆေးကြော ခြင်းမှ ရှောင်ကြဉ်ပါ။
•	ထမင်းရည်မငှဲ့ဘဲ ရေခန်းချက်စားသည့်အကျင့် ပြုလုပ်ပါ။ အကယ်၍ ထမင်းရေခန်း မချက်စားပါက မိသားစုဝင်အားလုံး ထမင်းရည်သောက်ပါ။
ဗီတာမင်ဘီဝမ်း ကြွယ်ဝသည့် အစားအစာများ
•	ပဲအမျိုးမျိုး
•	အဆီလွတ် ဝက်သား
•	မောင်းထောင်းဆန် (ဆန်လုံးညို)
•	လျှော့ကြိတ်ဆန်
•	ပြုတ်ဆန် (ပေါင်းဆန်၊ စပါးအခွံမချွတ်မီ ရေနွေးငွေ့ဖြင့် ပေါင်းထားသောဆန်) တို့သည် ဗီတာမင်ဘီဝမ်း ကြွယ်ဝသည့် အစားအစာများ ဖြစ်ကြပါသည်။
ဗီတာမင်ဘီဝမ်း ဆေးပြား
•	ကိုယ်ဝန်ဆောင်မိခင်များ ကိုယ်ဝန် (၉)လမှ မွေးဖွားပြီး (၃)လအထိ ဗီတာမင်ဘီဝမ်း ပါသည့် ဆေးပြားကို သတ်မှတ်ထားသော ပမာဏအတိုင်း နေ့စဉ်သောက်ပါ။
သံဓာတ်အာဟာရ
	သံဓာတ်သည် အရေးကြီးသော သတ္တုအာဟာရတစ်မျိုးဖြစ်သည်။ သံဓာတ်ချို့တဲ့လျှင် သွေးအားနည်းရောဂါ ခံစားရမည်။
ကိုယ်ဝန်ဆောင်များ သွေးအားနည်းလျှင်
•	ကိုယ်ဝန်ဆောင်နေစဉ်၊ မွေးဖွားစဉ်နှင့် မွေးဖွားပြီး ကာလများအတွင်း အသက် အန္တရာယ် ကြုံတွေ့နိုင်သည်။
•	လမစေ့၊ ပေါင်မပြည့်သောကလေး မွေးဖွားတတ်သည်။`}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="ကလေးများ သွေးအားနည်းလျှင်" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`•	ခန္ဓာကိုယ်ပုံမှန် မကြီးထွားနိုင်ပါ။
•	ကျောင်းသင်ခန်းစာများတွင် အာရုံမစူးစိုက်နိုင်သဖြင့် ပညာရေးနှောင့်နှေးမည်။
•	ရောဂါရလွယ်သည်။`}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="ကလေး၊ လူကြီးမရွေး၊ သွေးအားနည်းလျှင်" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`•	အားအင်ချိနဲ့မည်။ ကျန်းမာရေးချို့တဲ့မည်။
•	ရောဂါပြင်းထန်လျှင် နှလုံးရောဂါဖြစ်ခြင်း၊ ဖောရောင်ခြင်း၊ နှလုံးပျက်ယွင်းခြင်း ဖြစ်နိုင်ပါသည်။`}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="သံဓာတ်ကြွယ်ဝသော အစာများ" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`•	သံဓာတ်ချို့တဲ့သဖြင့် သွေးအားနည်းရောဂါဖြစ်ခြင်းမှ ကာကွယ်ရန် သံဓာတ်အာဟာရ ကြွယ်ဝသော အစားအစာများကို နေ့စဉ်စားသုံးရန် လိုအပ်သည်။ 
•	အသား၊ အသည်းနှင့် သွေးခဲတို့သည် သံဓာတ်အထူးကြွယ်ဝသဖြင့် တတ်နိုင်သမျှ စားသုံးသင့်သည်။
•	ဟင်းနုနယ်ရွက်၊ မုန်ညှင်းရွက်၊ ကန်စွန်းရွက်၊ ကင်းပုံရွက်၊ ချဉ်ပေါင်ရွက်စသည့် အစိမ်း ရင့်ရောင် ဟင်းသီးဟင်းရွက်များနှင့် ပဲအမျိုးမျိုးသည် သံဓာတ် အတော်အတန် ကြွယ်ဝသဖြင့် နေ့စဉ် စားသုံးသင့်သည်။
•	အသားဓါတ်နှင့် အချဉ်ဓါတ် (ဗီတာမင်စီ) သည် ဟင်းသီးဟင်းရွက်များနှင့်ပဲအမျိုးမျိုး မှ သံဓါတ်ကို အစာလမ်းကြောင်းမှ လွယ်ကူစွာစုပ်ယူနိုင်အောင် ကူညီသည်။`}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="ဆင်ခြင်သင့်သည် စားသောက်နည်းများ" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`ထမင်းမစားမီ (၁) နာရီနှင့် ထမင်းစားပြီး (၂) နာရီအတွင်း လက်ဖက်ရည် အချို သောက်ခြင်း၊ ရေနွေးကြမ်း ဖန်ဖန်သောက်ခြင်း လက်ဖက်သုပ်စားခြင်းတို့သည် အစာလမ်း ကြောင်းမှ သံဓာတ်စုပ်ယူမှုကို အနှောင့်အယှက်ဖြစ်စေနိုင်ပါသည်။
သံဓာတ်ဆေးပြား
	ကိုယ်ဝန်ဆောင်စဉ် ကာလအတွင်း သံဓာတ်ဆေးပြားကို ပထမအကြိမ် ကိုယ်ဝန်စပြ ချိန်မှစ၍ နေ့စဉ် သတ်မှတ်ထားသော ပမာဏအတိုင်းသောက်ပါ။ ပျိုဖော်ဝင်အမျိုးသမီးတိုင်း သံဓာတ်ဆေးပြားကို ကျန်းမာရေးဌာနမှ သတ်မှတ်ထားသော ပမာဏအတိုင်းသောက်ပါ။
အိုင်အိုဒင်းအာဟာရ
	အိုင်အိုဒင်းသည် သံဓာတ်၊ ထုံးဓာတ်တို့ကဲ့သို့ပင် သတ္တုအာဟာရဓါတ်တစ်မျိုးဖြစ် သည်။ ခန္ဓာကိုယ် ပုံမှန်ကြီးထွားရေး၊ ဦးနှောက်ဖွံ့ဖြိုး၍ ဉာဏ်ရည်ထက်မြက်ရေး၊ ခန္ဓာကိုယ် ၏ ဇီဝကမ္မလုပ်ငန်းများ ပုံမှန်လည်ပတ်ရေးတို့အတွက် အိုင်အိုဒင်းအာဟာရကို လုံလောက် စွာ စားသုံးကြရမည်။
ကိုယ်ဝန်ဆောင်မိခင် အိုင်အိုဒင်းအာဟာရချို့တဲ့လျှင်
•	ကိုယ်ဝန်ပျက်ကျတတ်သည်။
•	ကလေးအသေ မွေးတတ်သည်။
•	လမစေ့၊ ပေါင်မပြည့်သောကလေး၊ ဆွံ့အနားမကြားသောကလေး၊ ဉာဏ်ရည်နိမ့် သောကလေး၊ ခြေလက်မသန်စွမ်းသောကလေးမွေးတတ်သည်။`}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="ကလေးငယ်များ အိုင်အိုဒင်းအာဟာရ ချို့တဲ့လျှင်" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`•	ခန္ဓာကိုယ် စံချိန်မီ မကြီးထွားနိုင်ဘဲ သေးကွေး ပုညှက်နေမည်။ ဉာဏ်ထိုင်းမည်။
•	လည်ပင်းကြီးရောဂါဖြစ်မည်။ သွက်လက်ဖျတ်လတ်မှုမရှိ၊ ထုံထိုင်းနှေးကွေးမည်။
အိုင်အိုဒင်းဆား လူတိုင်းစား
•	အိုင်အိုဒင်းအာဟာရကို လုံလောက်စွာရရှိရန် အိုင်အိုဒင်းဆားကို နေ့စဉ်စားသုံးရမည်။`}
titleNumberOfLines={200}/>
<Text style={styles.subtitle}>သန္ဓေသားဘဝမှစ၍ သက်ကြီးရွယ်အိုဘဝအထိ အိုင်အိုဒင်းအာဟာရကို
လုံလောက်စွာ မှီဝဲကြရမည်။</Text>
        </List.Accordion>

        <List.Accordion
        title="သန်ကောင်ရောဂါ" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`ကလေးများတွင် သန်ကောင်ရောဂါစွဲကပ်လျှင် အာဟာရချို့တဲ့၍ ခန္ဓာကိုယ်ကြီးထွား မှုနှင့် သင်ယူနိုင်စွမ်း နှေးကွေးမည်။
သန်ကောင်ရောဂါ ကာကွယ်ရေး
•	အစားအစာမပြင်ဆင်မီ၊ အစာမစားမီနှင့် အိမ်သာဝင်ပြီးတိုင်း လက်ကိုဆပ်ပြာနှင့် စင်ကြယ်စွာ ဆေးကြောပါ။
•	သန့်ရှင်းသော အစားအစာများကို စားသုံးပါ။
•	တစ်ကိုယ်ရေသန့်ရှင်းရေးနှင့် ပတ်ဝန်းကျင်သန့်ရှင်းရေးကို ပုံမှန်ဆောင်ရွက်ပါ။
•	ကိုယ်ဝန်ဆောင်မိခင်တိုင်း ကိုယ်ဝန် (၃)လ နောက်ပိုင်းတွင် ကျန်းမာရေးဌာနမှ သတ်မှတ်ထားသော သန်ချဆေးဖြင့် အနည်းဆုံးတစ်ကြိမ် သန်ချပါ။
•	အသက် (၂) နှစ်မှ (၉)နှစ်အထိ ကလေးတိုင်း (၆)လ တစ်ကြိမ် ပုံမှန်သန်ချပါ။
•	မြေကြီးပေါ်တွင် ဆော့ကစားပြီးတိုင်း လက်ကိုဆပ်ပြာနှင့်စင်ကြယ်စွာဆေးကြောပါ။
•	အပြင်ထွက်တိုင်း ဖိနပ်စီးပါ။`}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="ဘဝရှေ့ဆောင်ရက်တစ်ထောင်" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`သန္ဓေသားဘဝမှ အသက် (၂)နှစ်အတွင်းဘဝအစ၏ ပထမရက်ပေါင်း (၁၀၀၀) ကာလတွင် အာဟာရဆိုင်ရာ ပံ့ပိုးဖြည့်ဆည်းမှုသည် ရေတို၊ ရေရှည် အကျိုးကျေးဇူးများကို ရရှိစေနိုင်၍ ထိုကလေး၏ ဘဝတစ်လျှောက်လုံးအတွက် အရေးအကြီးဆုံးနှင့် ထိရောက်မှုအရှိဆုံး လုပ်ဆောင်ချက်ဖြစ်ပါသည်။`}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="ကိုယ်ဝန်ဆောင်နှင့် နို့တိုက်မိခင် အာဟာရ" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`ကိုယ်ဝန်ဆောင်မိခင်နှင့် နို့တိုက်မိခင်များ အစာပို၍စားပါ။ ထမင်းနှင့် ဟင်းတစ်နပ် ပိုစားပါ။ အစားရှောင်ရန် (လုံးဝ) မလိုပါ။
	နို့တိုက်မိခင်သည် ငန်လွန်းသော အစာမှလွဲ၍ အစား (လုံးဝ) မရှောင်ရပါ။ မိခင်နို့တွင် ကလေးငယ်အတွက် လိုအပ်သောအာဟာရများ ပြည့်စုံကာ လုံလောက်သော ပမာဏရရှိစေ ရန် နို့တိုက်မိခင်ဘဝတွင် ကိုယ်ဝန်ဆောင်ဘဝထက် ပိုစားရပါမည်။ အစာအုပ်စု (၃) မျိုးစလုံး ပါအောင် စားသောက်ရမည်ဖြစ်သည့်အပြင် ပမာဏအားဖြင့်လည်း ပိုစားရမည်ဖြစ်ပါသည်။
	မွေးရာပါ ကိုယ်အင်္ဂါချို့တဲ့မှုများ (ဉပမာ-နှုတ်ခမ်းကွဲ၊ အာခေါင်ကွဲ) ဖြစ်ခြင်းမှ ကာကွယ်ရန် ကိုယ်ဝန်ရှိကြောင်း စတင်သိရှိချိန်မှစ၍ သံဓါတ် (၆၀ ကီလိုဂရမ်) နှင့် ဖောလစ် အက်စစ် (၄၀၀ မိုက်ခရိုဂရမ်) ဆေးပြား တစ်နေ့တစ်ပြား နေ့စဉ်သောက်ပါ။
	ကိုယ်ဝန် (၃)လနောက်ပိုင်းတွင် သန်ချဆေးပြား (Mebendazole 500 mg) တစ်ကြိမ် သောက်သုံးရမည်။
	ကိုယ်ဝန် (၉)လမှစ၍ ကလေးမွေးဖွားပြီး (၃)လအထိ ဗီတာမင်ဘီဝမ်း ဆေးပြားကို သတ်မှတ်ထားသော ပမာဏအတိုင်း နေ့စဉ်သောက်သုံးရပါမည်။`}
titleNumberOfLines={200}/>
        </List.Accordion>
        <Text style={styles.subtitle}>မိခင်နို့တစ်မျိုးတည်း တိုက်ကျွေးခြင်း </Text>
        <List.Accordion
        title="မိခင်နို့ရည်၏ အာဟာရ" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`မိခင်နို့သည် ကလေးငယ် ကျန်းမာစွာကြီးထွားပြီး ဖွံ့ဖြိုးမှုအတွက် အကောင်းဆုံး အာဟာရဖြစ်ပါသည်။ မွေးဖွားပြီး ပထမ (၆)လအတွင်း ကလေးငယ် လိုအပ်သော တစ်ခုတည်းသာ အာဟာရဖြစ်ပါသည်။ ကလေးငယ်အတွက် အစာကြေလွယ်ပြီး ကလေးငယ်ကို အာဟာရဓာတ်များ လျင်မြန်စွာပေးနိုင်ပါသည်။
•	အာဟာရကြွယ်ဝပြီး ရောဂါကာကွယ်ပေးသည့်ဓာတ်များ ပါဝင်သော နို့ဦးရည်ကို တိုက်ဖြစ် အောင်တိုက်ပါ။
•	မွေးဖွားပြီး (၁) နာရီအတွင်း စောနိုင်သမျှ စောစောတိုက်ပါ။
•	ကလေးငယ်ကို မွေးဖွားပြီး အသက် (၆)လအထိ မိခင်နို့တစ်မျိုးတည်းသာ တိုက်ပါ။
•	မိခင်နို့တစ်မျိုးတည်း တိုက်ကျွေးခြင်းဆိုသည်မှာ မိခင်နို့မှလွဲ၍ရေ၊ အခြားအရည်များ (သို့) အစားအစာများကို ပထမ (၆)လအတွင်း မကျွေးခြင်းကို ဆိုလိုပါသည်။
•	မိခင်နို့တွင် ရေဓာတ်အများအပြား ပါဝင်ပါသည်။ ကလေးငယ် နို့ဆာသည့်အခါတိုင်း တိုက်ပါ။ နို့စို့လိုသည့်အခါတိုင်း နို့စို့ခွင့်ရရှိပါက ပူပြင်းခြောက်သွေ့သော ရာသီဉတု များမှပင် ရေထပ်မံတိုက်ကျွေးရန် မလိုပါ။
•	မိခင်နို့ကို ခဏခဏတိုက်ပါ။ အချိန်ကြာကြာ တိုက်ပါ။ ကလေးဆာတိုင်း တိုက်ပါ။
•	မိခင်နို့တွင် အဆီဓာတ်၊ သကြားစက်၊ ဗီတာမင်နှင့် သတ္တုဓာတ်များ အလုံအလောက် ပါဝင်သည်။ အစာကြေလွယ်သည်။
မိခင်နို့တစ်မျိုးတည်း တိုက်ကျွေးခြင်း၏ အကျိုးကျေးဇူးများ
•	နို့ဦးရည်နှင့် မိခင်နို့သည် ကလေးငယ် ရောဂါမဖြစ်ပွားစေရန်အတွက် မိခင်မှ ကလေး ကိုပေးနိုင်သည့် ပထမဆုံးနှင့် တန်ဖိုးအရှိဆုံးကာကွယ်ဆေး ဖြစ်ပါသည်။
•	မိခင်နို့တိုက်ကျွေးခြင်းဖြင့် ကလေးငယ်တွင် ဝမ်းလျှော့ခြင်း၊ အသက်ရှုလမ်းကြောင်း ရောဂါ ကူးစက်ဝင်ရောက်ခြင်းနှင့် နာတာရှည်ရောဂါများ ဖြစ်ပွားမည့်အန္တရာယ်ကို လျှော့ချနိုင်ပါသည်။
•	မိခင်နို့တိုက်ကျွေးခြင်းဖြင့် မိခင်နှင့် ကလေးငယ်တို့ကြား သံဃောဇဉ်တွယ်တာမှု ပိုမို ခိုင်မာစေပါသည်။`}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="မိခင်များအတွက် အကျိုးကျေးဇူးများ" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`•	နောက်တစ်ကြိမ် ကိုယ်ဝန်ဆောင်ခြင်းကို နှောင့်နှေးကြန့်ကြာစေနိုင်သည်။
•	မိခင်တွင် မမျိုးဉအိမ်ကင်ဆာ၊ ရင်သားကင်ဆာတို့ဖြစ်ပွားမည့် အန္တရာယ်ကို လျှော့ချ ပေးနိုင်သည်။
ကလေးကို မိခင်နို့ ခဏခဏတိုက်ပါ။
•	မိမိ၏ရင်သွေးကို နို့ဝအောင်တိုက်နိုင်သည်ဟုယုံကြည်စိတ်မွေးပါ။ နို့ထွက်များပါမည်။
•	အချိန်ကြာကြာ တိုက်ပါ။
•	အသက် (၆)လ မတိုင်မီ နေ့ရောညပါ မိခင်နို့တစ်မျိုးတည်း တိုက်ပါ။
•	မိခင်သည် အာဟာရပြည့်ဝစွာ စားသုံးပါက အမြွာပူးကလေးအတွက်လည်း မိခင်နို့ လုံလောက်စွာ တိုက်ကျွေးနိုင်ပါသည်။
•	(၆)လပြည့်ပြီးနောက် အာဟာရကြွယ်ဝသော ဖြည့်စွက်အစာများကို စတင်ကျွေးရင်း ကလေးငယ် (၂) နှစ်ကျော်သည်အထိ ဆက်လက်၍ တိုက်ကျွေးပါ။
ကလေးသူငယ် အစာကျွေးမွေးပြုစုခြင်း
	သင့်ကလေးကျန်းမာဖွံ့ဖြိုးစေရန် မိခင်နို့နှင့် ဖြည့်စွက်စာကိုစနစ်တကျ တိုက်ကျွေးပါ။	ဖြည့်စွက်စာဆိုသည်မှာ ကလေးအသက် ၆လပြည့်လျှင် မိခင်နို့နှင့်အတူ ဖြည့်စွက် ကျွေးမွေးရသည့် အခြားအစားအစာများကို ဆိုလိုသည်။
•	ကလေးအသက် (၆)လပြည့်လျှင် မိခင်နို့နှင့်အတူ ထမင်း၊ အသားငါး၊ အသီးအရွက်၊ ပဲအမျိုးမျိုး၊ ငှက်ပျောသီး၊ ကြက်ဉစသည့် အဖတ်များ ဆန်ပြုတ်၊ စွပ်ပြုတ်နှင့် အရည် အမျိုးမျိုးကို ဖြည့်စွက်ကျွေးရန် လိုအပ်ပါသည်။
•	အသက် (၆)လပြည့်ပြီးသော ကလေးအား ဖြည့်စွက်စာကျွေးရာတွင် ဆီအနည်းငယ် (လက်ဖက်ရည်ဇွန်း တစ်ဇွန်းခန့်) ထည့်၍ ကျွေးရပါမည်။
•	သစ်ဉ၊ သစ်ဖုနှင့် မုန့်ပဲသရေစာများ အပါအဝင် အစားအစာမျိုးစုံတို့ကို တဖြည်းဖြည်း အကျင့်လုပ်၍ ကျွေးရပါမည်။
ငါးနှစ်အောက်ကလေး အစာခဏခဏကျွေး
•	ငါးနှစ်အောက်ကလေးများသည် လူကြီးများကဲ့သို့တစ်ကြိမ်တည်းနှင့် အစာအများကြီး မစားနိုင်ကြပါ။ လူကြီးများကဲ့သို့ တစ်နေ့လျှင် နှစ်ကြိမ်စားရုံဖြင့် မလုံလောက်ပါ။
•	တစ်နေ့လျှင် ထမင်းသုံးကြိမ် ကျွေးပါ။•	အာဟာရပြည့်ဝသော မုန့်ပဲသရေစာများ တစ်နေ့လျှင် (၂) ကြိမ်ကျွေးပါ။
•	ကလေးစားချင်အောင် ချော့မြှူ၍ ကျွေးရမည်။

နေမကောင်းသည့်ကလေး အစာပိုကျွေး
	ကလေးငယ် နေမကောင်းဖြစ်နေစဉ်နှင့် ဝမ်းပျက်ဝမ်းလျှောဖြစ်နေစဉ်
•	အစာမကျွေးဘဲ မထားပါနှင့်၊ ကလေးက မစားချင်သည့်တိုင် ချော့မြှူပြီး ကျွေးပါ။
•	အစာကို တစ်ကြိမ်ကျွေးလျှင် ပမာဏနည်းနည်းနှင့် အကြိမ်များများ ကျွေးပါ။
•	အစာပျော့ပျော့ ကျွေးပါ။ အရည်များများ တိုက်ပါ။
•	မိခင်နို့ ဆက်တိုက်ပါ။ ဓာတ်ဆားရည်၊ ဆန်ပြုတ်၊ စွပ်ပြုတ် တိုက်ပါ။
•	အာဟာရပြည့်ဝမှ မြန်မြန်နာလန်ထမည်။
•	ကလေးအစာမဝင်ပါက နီးစပ်ရာ ကျန်းမာရေးဌာနသို့ အမြန်ပြပါ။
	နာလန်ထချိန်တွင် ကလေးခံတွင်း ပြန်ကောင်းလာတတ်ပါသည်။ နာမကျန်းဖြစ်စဉ် လျော့နည်းသွားသော ကိုယ်အလေးချိန်ကို အမြန်ပြန်လည်ရရှိအောင် နာလန်ထချိန်တွင် အစာပိုကျွေးပါ။`}
titleNumberOfLines={200}/>
        </List.Accordion>

        <Text style={styles.subtitle}>မိခင်နို့ တိုက်ကျွေးခြင်း နှင့် ဖြည့်စွက်စာ ကျွေးမွေးခြင်း (Breast Feeding & Supplementary Feeding)</Text>

        <List.Accordion
        title="မိခင်နို့ တိုက်ကျွေးခြင်း" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`၁။ ကိုယ်ဝန်ဆောင် မိခင် နှင့် နို့တိုက်မိခင်များ အစာပို၍ စားပါ။ ထမင်းဟင်း တစ်နှပ်စာ ပိုစားပါ ၊ အစားရှောင်စရာမလိုပါ။ 
၂။ ရင်သွေးငယ်အား မွေးပြီး တစ်နာရီအတွင်း မိခင်နို့ကို စတင် တိုက်ကျွေးပါ။ 
၃။ ပထမပိုင်းတွင် မိခင်နို့ အထွက်နည်းသည့်တိုင် ကလေးငယ်မှ နို့စို့ပေးပါက တဖြည်းဖြည်း နို့ရည်ထွက်လာပါလိမ့်မည်။ 
၄။ ပထမ ၃-၄ရက်တွင် ထွက်သော နို့ရည်သည် အဝါရောင်ဖြစ်ပြီး နို့ဦးရည် ဟုခေါ်သည်။ ၎င်း နို့ဦးရည်သည် ကလေးအတွက် ရောဂါကာကွယ်ပေးသောဓာတ်များ အများအပြားပါဝင်သည်။ 
၅။ နို့ဦးရည် သည် ကလေးအတွက် ပထမဦးဆုံးရရှိသော သဘာဝ ကာကွယ်ဆေး ဖြစ်ပါသည်။ အချို့မိခင်များသည် နို့ဦးရည်ကို ပထမဆုံး ထွက်လာသဖြင့် မသန့်ရှင်း ဟု ထင်မြင်မှားပြီး ညှစ်ထုတ်ပစ်ခြင်းများ မပြုလုပ်သင့်ပါ။ 
၆။ ပထမ ၆လတွင် ရင်သွေးငယ်အား မိခင်နို့မှ လွဲ၍ အခြားနို့မှုန့် ၊ အရည် ၊ ရေ လုံးဝ(လုံးဝ) မတိုက်ပါနှင့်။ အကယ်၍ နို့မလောက်ဟု ယူဆပါက ဆေးခန်းမှ ဆရာမ များကို တိုင်ပင်ပါ။ 
၇။ မိခင်နို့တွင် ရေဓာတ်လုံလောက်စွာ ပါဝင်သဖြင့် ရေတိုက်ရန် မလိုပါ။ ရေကို အပိုဆောင်းတိုက်ပါက အာဟာရချို့တဲ့မှု ဖြစ်နိုင်ပါသည်။ 
၈။ မိခင်နို့ကို ခဏခဏတိုက်ပါ။ အချိန်ကြာကြာ တိုက်ပါ။ ကလေးဆာတိုင်း တိုက်ပါ။ 
၉။ မိခင်နို့တိုက်ခြင်းဖြင့် ဝမ်းပျက်ဝမ်းလျော နှင့် အခြားရောဂါများ မရနိုင် ။ ဓာတ်မတည့်ခြင်းများ မဖြစ်နိုင်ပါ။ 
၁၀။ မိခင်နို့တွင် ကလေးငယ်အတွက် သင့်လျော်၍ အစာကြေလွယ်သော ပရိုတင်း၊ မရှိမဖြစ် အမိုင်နိုအက်ဆစ်၊ အဆီဓာတ်၊ မရှိမဖြစ် ဖက်တီးအက်ဆစ်၊ သံဓာတ်၊ ဗီတာမင် အေ၊ ဘီဝမ်း၊ အိုင်အိုဒင်း နှင့် အခြားအာဟာရဓာတ်များ စုံလင်စွာ ပါဝင်သည်။ 
၁၁။ မိခင်နို့ တိုက်ကျွေးရာတွင် မှန်ကန်သော အနေအထား နှင့် မှန်ကန်စွာ တိုက်ကျွေးရမည်။ 
၁၂။ လတ်တလော ဖျားနာနေသော ကလေး၊ ဝမ်းသွားနေသော ကလေးအား မိခင်နို့ ဆက်လက်တိုက်ကျွေးရမည်။ 
၁၃။ ကီလိုမပြည့် / လစေ့သောကလေးများ အားလုံးလိုလို မိခင်နို့သောက်စို့နိုင်ကြသည်။ 
၁၄ ။ ကီလိုမပြည့် / လမစေ့သော ကလေးများ၏ တစ်ဝက်ခန့်သည်ပင်လျှင် မိခင်နို့ ကောင်းမွန်စွာ သောက်စို့နိုင်သည်။ 
၁၅။ ကောင်းစွာ မသောက်/မစို့ နိုင်သော ကလေးများအား မိခင်နို့ကို ခွက်ငယ်ဖြင့် တိုက်ကျွေးရမည်။ ခွက်ငယ်ဖြင့် တိုက်နည်းကို ဆေးခန်းမှ ဆရာမများထံတွင် သင်ကြားပါ။ 
၁၆။ ညစ်ထုတ်ထားသော မိခင်နို့ရည်ကို အချိန်ကြာမြင့်စွာ အသုံးပြုနိုင်ရန် အောက်ပါ ညွှန်ကြားချက်များဖြင့် သိမ်းဆည်းထားနိုင်ပါသည်။ `}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="ကလေး နို့ဆာသည့် လက္ခဏာများ" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`•	ဂနာမငြိမ် ၊ ပါးစပ်ဟ လာပြီး ဦးခေါင်းကို ဘယ်ညာယမ်းခြင်း 
•	လျှာကို ထုတ်လိုက် / သွင်းလိုက် လုပ်ခြင်း 
•	လက်ချောင်း လက်သီးဆုပ်တို့ကို စုပ်ယူခြင်း 
•	ကလေးငိုခြင်းသည် နို့ဆာခြင်း၏ နောက်ကျသော လက္ခဏာဖြစ်သဖြင့် ကလေးငိုသည်အထိ မစောင့်သင့်ပါ။ 
ကလေးကို နို့ဆာတိုင်း မိခင်နို့ကို တိုက်ကျွေးပါ။ အကြမ်းအားဖြင့် ၂-၃ နာရီကြား တစ်ခါ တိုက်ကျွေးသင့်ပါသည်။ ညပိုင်းတွင်လည်း ဆက်လက်တိုင်ကျွေးသင့်ပါသည်။ `}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="ဖြည့်စွက်စာ ကျွေးမွေးခြင်း" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`ကလေး အသက် ၆လ ပြည့်လျှင် မိခင်နို့ နှင့်အတူ အခြား အစားအစာများ ဖြည့်စွက်ကျွေးရန် လိုအပ်ပါသည်။ 
အသက် ၆လ ပြည့်ပြီးသော နို့စို့ကလေးအား ဖြည့်စွက်စာ ကျွေးရာတွင် ---- 
•	ဆန်ပြုတ်(သို့)ထမင်းပျော့ပျော့ ညှက်နေအောင် ပြုလုပ်၍ စတင်ကျွေးပါ။ 
•	အစာတစ်မျိုးတည်းကိုသာ စ၍ ကျွေးပါ။ 
•	၎င်းအစာတစ်မျိုးတည်းကိုသာ ၃-၄ရက်ခန့် ဆက်၍ ကျွေးပါ။
•	ထိုအစာကို ကောင်းကောင်း စားတတ်မှ နောက်ထပ် အစာသစ်တစ်မျိုးကို တိုး၍ ကျွေးပါ။ 
•	၆လ မှ ၉လ ၊ ၉လ မှ ၁၂လ နှင့် ၁၂လ အထက် ဖြည့်စွက်စာကျွေးရမည့်ဇယား ကို ကြည့်ပါ။ (စာမျက်နှာ? ) 
•	ဖြည့်စွက်စာကျွေးတိုင်း ကျွေးတိုင်း ဆီ လဘက်ရည်ဇွန်း (၁) ဇွန်း ထည့်ကျွေးရပါမည်။
•	အာဟာရ ဖြစ်သည့် အစားအစာများ မျိုးစုံအောင် တဖြည်းဖြည်း အကျင့်လုပ်၍ ကျွေးရန် 
•	အာဟာရဖြစ်သည့် သစ်ဥသစ်ဖု နှင့် မုန့်ပဲ သွားရည်စာများ ကျွေးရန် အထူးသတိပြုရပါမည်။ 
•	မည်သည့် အချိုရည်ကိုမျှ မတိုက်ပါနှင့် ။ `}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="နေမကောင်းသည့်ကလေး အစာပိုပြီးကျွေး" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`ကလေးငယ် နေမကောင်းဖြစ်နေစဥ် နှင့် ဝမ်းပျက်ဝမ်းလျှောဖြစ်နေစဥ် အစာမကျွေးဘဲ မထားပါနှင့် ၊ အစာပျော့ပျော့ ခဏခဏကျွေးပါ။ အရည်များများတိုက်ပါ။ မိခင်နို့ ဆက်တိုက်ပါ။ ဓာတ်ဆားရည် ၊ ဆန်ပြုတ် ၊ စွပ်ပြုတ် တိုက်ပါ ။`}
titleNumberOfLines={200}/>
        </List.Accordion>
        <Image source={require('../to/neoeightfour.png')} style={styles.img1}/>
</List.Section>
     </View>
       </ScrollView>
     )
   }

   const styles = StyleSheet.create({
    body :{
      flex:1,
      backgroundColor:'#D1D9FF',
      marginBottom:10,
      marginBottom:20,
    },
  headtitle:{
    color:'#102027',
    fontSize:30,
  },
  subtitle:{
    color:'#260e04',
    fontSize:18,
    textDecorationLine: 'underline',
  },
  p:{
    margin:7,
    color:'#4e342e',
    fontSize:15,
    lineHeight: 26,
  },
  subp:{
    color:'#4e342e',
    fontSize:15,
    backgroundColor:'#bcc3e5',
    textDecorationLine: 'underline',
  },
  img :{
        backgroundColor:'#bcc3e5',
        width: Dimensions.get('screen').width/1,
        height: Dimensions.get('screen').height/4,
        resizeMode: 'contain'
      },

      img1 :{
        backgroundColor:'#bcc3e5',
        width: Dimensions.get('screen').width/1,
        height: Dimensions.get('screen').height/2,
        resizeMode: 'contain'
      },
    
    })