import { Pressable, StyleSheet, Text, View } from 'react-native'
import React from 'react'
import { ScrollView } from 'react-native-gesture-handler'
import { List } from 'react-native-paper'


export default function Neoone({navigation}) {
    const onPresshundler = () => {
    
    navigation.goBack()
    }
     return(
       <ScrollView style={{backgroundColor:'#D1D9FF'}}>
         <View style={styles.body}>
         <List.Section title="၅။ မွေးကင်းစကလေး ကျန်းမာ ဖွံ့ဖြိုးရေး" style={styles.headtitle}>
      <List.Accordion
        title="(က) မိခင်နှင့်ကလေး ကျန်းမာရေးစောင့်ရှောက်မှု လက်စွဲစာအုပ်တွင် ပါဝင်သော လိုက်နာရမည့် အချက်များကို ရှင်းပြခြင်း" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5"}} theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`၁။ ဤစာအုပ်သည် ကိုယ်ဝန်ဆောင်မိခင် နှင့် မွေးကင်းစကလေးမှ အသက် ၅ နှစ်ကလေးအထိ အလွန်အရေးကြီးသော စာအုပ်တစ်အုပ်ဖြစ်သည်။ 
၂။ ဤစာအုပ်ကို ကလေးအသက် ၅ နှစ်အထိ အသုံးပြုနိုင်ပါသည်။ ထို့ကြောင့် စာအုပ်ကို နေဒဏ်၊ မိုးဒဏ်တို့နှင့် ထိခိုက်ပျက်စီးခြင်းမဖြစ်စေရန် သေချာထိန်းသိမ်းဖို့ လိုအပ်ပါသည်။ မဟုတ်ပါက စာအုပ်ထဲတွင် ရေးမှတ်ထားသည်များသည် ပျက်စီး၍ ဖတ်၍မရ ဖြစ်တတ်ပါသည်။ 
၃။ ကိုယ်ဝန်ဆောင်နေစဥ်အတွင်းတွင် ကိုယ်ဝန်ဆောင်နှင့်ပတ်သက်သော ကျန်းမာရေးဆိုင်ရာ အချက်အလက်များကို မှတ်သားထားပါသည်။ အရေးကြီးပါသည်။ (ဥပမာ။ ။ ကိုယ်ဝန်ပတ်၊ ကျန်းမာရေးအခြေအနေများ၊ ဆေးများ၊ စမ်းသပ်စစ်ဆေးမှုများ၊ အန္တရာယ်လက္ခဏာများ စသဖြင့် ပါဝင်သည်) 
၄။ ဤစာအုပ်ငယ်ကို သင်နှင့် သင်၏ကလေး မည်သည့် ဆေးရုံ / ဆေးခန်းကိုပဲ သွားသွား အမြဲ တပါတည်း ယူဆောင်လာရမည်ဖြစ်သည်။ သို့မှသာ ကျန်းမာရေးဝန်ထမ်းများအနေဖြင့် သင်နှင့် သင်၏ကလေး ကျန်းမာရေးအခြေအနေများကို လွယ်ကူစွာသိနိုင်မည်ဖြစ်ပါသည်။ 
၅။ ၅ နှစ်အောက်ကလေးတစ်ယောက်လျှင် စာအုပ်တစ်အုပ် အသုံးပြုရမည်ဖြစ်သည်။ 
၆။ ဤစာအုပ်ထဲတွင် ကျန်းမာရေးဆိုင်ရာအချက်အလက်များကို အသေးစိတ်ရေးမှတ်ထားပါသည်။ 
•	မွေးဖွားနေစဥ် ကလေး၏ ကျန်းမာရေးဆိုင်ရာအချက်အလက်များကို အသေးစိတ် မှတ်ယူထားပါသည်။ (ဥပမာ။ ။ မွေးစကိုယ်အလေးချိန်၊ လစေ့/ မစေ့၊ ဦးခေါင်းလုံးပတ်အနေအထား၊ မွေးစက ကျန်းမာရေးအခြေအနေ၊ မိခင်၏ ကိုယ်ဝန်ဆောင်စဥ်အတွင်း ကျန်းမာရေးပြဿနာများ)
•	သားဆက်ခြားခြင်းနှင့်ပတ်သတ်၍ နည်းလမ်းများစွာကို စာအုပ်ထဲတွင် ဖတ်ရှုနိုင်ပြီး ကျန်းမာရေးဝန်ထမ်းမှလည်း အသေးစိတ် ရှင်းလင်းပြောပြပေးမည်ဖြစ်ပါသည်။ 
•	ကလေး၏ ဦးခေါင်းလုံးပတ်အနေအထားကို အစဥ်လိုက် တိုင်းတာခြင်း (ဦးနှောက် ပုံမှန် ဖြစ်မဖြစ်သိရှိရန် အရေးကြီးသည်) 
•	ဗီတာမင် အေ ပေးခြင်းနှင့် သံချခြင်း တို့ကို ပုံမှန်မှတ်သားခြင်း 
•	မွေးစမှ အသက် ၅ နှစ်အထိ ကလေး၏ ကျန်းမာရေးဆိုင်ရာ အသေးစိတ်အချက်အလက်အားလုံး 
•	ပုံမှန်ကြီးထွားဖွံ့ဖြိုးမှုကို သိရှိနိုင်ရန် အသက် ၅ နှစ်အထိ ပုံမှန်မှတ်သားခြင်း 
•	လက်မောင်းပတ်တိုင်းတာခြင်း၊ ကိုယ်အလေးချိန်၊ အရပ်အမြင့် စသည့် အသေးစိတ် အချက်အလက်များကို မှတ်သားထားခြင်း (ဤသို့ မှတ်သားထားခြင်းကြောင့် သင်၏ကလေး အာဟာရချို့တဲ့သလား၊ ညှက်သလားကို စောလျှင်စွာ သိရှိရမည်ဖြစ်ပြီး ကြိုတင်ကာကွယ်နိုင်မည်ဖြစ်ပါသည်)
•	ကာကွယ်ဆေးထိုးခြင်းဆိုင်ရာ အချက်အလက်များလည်း မှတ်သားထားသောကြောင့် အရေးကြီးပါသည်။ 
•	၆ လအထိ မည်သို့ နို့တိုက်ကျွေးရမည် ၆ လကျော်လျှင် ဖြည့်စွက်စာ မည်သို့ကျွေးရမည်ကို ဤစာအုပ်ထဲတွင် အသေးစိတ်ရေးသားထားပါသည်။ ကလေးအသက် ၅ နှစ်အထိ မည်သို့ကျွေးမွေးရမည်၊ မည်သည့်အစာအုပ်စုများသည် ကောင်းသည်ကိုလည်း ပြောပြထားပါသည်။ 
•	သင်၏ ကလေးအတွက် အန္တရာယ်လက္ခဏာများကိုလည်း ဖတ်ရှုနိုင်ပြီး ဆေးခန်းသို့လာပါကလည်း ရှင်းပြမည်ဖြစ်ပါသည်။ 
•	ဤစာအုပ်မှ သင်၏ ကလေးကို မည်သို့ ပြုစုရမည်ကို ပြောပြပေးမည်ဖြစ်သည့်အပြင် ဓာတ်ဆားရည် ပြုလုပ်နည်းနှင့် ဓာတ်ဆားရည် မည်မျှပမာဏတိုက်ရမည်ကို ရှင်းပြပေးမည်ဖြစ်သည်။ 
•	စိတ်ကူးကြည့်ပါ။ အကယ်၍သင်သာ ဤမျှအရေးကြီးသော ကျန်းမာရေးမှတ်တမ်းစာအုပ်ကို ဖျောက်ပစ်လိုက်မယ်ဆိုရင် သင်၏ကလေးဟာလည်း တဖြည်းဖြည်းပျောက်ကွယ်သွားမှာဖြစ်ပါသည်။ ဒါဟာ ပြန်အစားထိုးမရဘူးနော်။ 
•	ထပ်ပြောပါမယ်၊ ဒါကြောင့် ဤ အရေးကြီးသော ကျန်းမာရေးမှတ်တမ်းစာအုပ်ကို ပျောက်တာ ပျက်စီးတာတွေ လုံးဝ လုံးဝ မဖြစ်ပါစေနဲ့။ 
•	ဤစာအုပ်က ဆေးခန်းက အလကားပေးတာဖြစ်ပါတယ်။ ပျောက်ဆုံးသွားပါက အသစ်ထပ်ပေးမှာ ဖြစ်သော်လည်း စာအုပ်ထဲမှ အရေးကြီးသော ကျန်းမာရေးမှတ်တမ်းများဟာ ထာဝရ ပျောက်ဆုံးသွားမှာ ဖြစ်ပါတယ်။ ကျေးဇူးပြု၍ လုံးဝ လုံးဝ မပျက်စီး မဖျောက်ပစ်ပါနဲ့ ။`}
        titleNumberOfLines={200} />
      </List.Accordion>

      <List.Accordion
        title="မွေးဖွားပြီးနောက် မွေးကင်းစကလေးကို ပုံမှန် ရက်ချိန်းပြသခြင်း" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5" }}  theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`ကျန်းမာသောကလေး ပုံမှန် ရက်ချိန်းပြန်လည်ပြသခြင်း ( မွေးစကိုယ်အလေးချိန် 2.5 kg နှင့်အထက် )
•	ပထမအကြိမ် ( မွေးပြီး ၂၄ နာရီအတွင်း )
•	ဒုတိယအကြိမ် ( မွေးပြီး ၃ ရက်မြောက်နေ့ )
•	တတိယအကြိမ် ( မွေးပြီး ၇ ရက်မြောက်နေ့ )
ကျန်းမာသောကလေး ပုံမှန်ရက်ချိန်းပြန်လည်ပြသခြင်း (မွေးစကိုယ်အလေးချိန် 2.0 မှ 2.4kg)
•	ပထမအကြိမ် (မွေးပြီး ၂၄ နာရီအတွင်း)
•	ဒုတိယအကြိမ် (မွေးပြီး ၄၈ နာရီ မှ ၇၂ နာရီအတွင်း)
•	တတိယအကြိမ် (မွေးပြီး ၇ရက် မှ ၁၄ ရက်အတွင်း)
•	စတုတ္ထအကြိမ် (မွေးပြီး ၆ ပတ်မပြည့်ခင် တစ်ကြိမ်)  

၆ လအထိ ပုံမှန်မွေးကင်းစကလေးကို ပြုစုစောင့်ရှောက်ခြင်း 
•	မွေးကင်းစကလေးကို မကိုင်ခင်နှင့် ကိုင်ပြီးတိုင်း လက်ကို ဆပ်ပြာနှင့် ဆေးကိုဆေးရပါမည်။ 
•	အချိန်တိုင်း နွေးထွေးစွာ ထားပါ။ 
•	မွေးပြီး မိနစ် ၃၀ မှ ၆၀ အတွင်း မိခင်နို့မထွက်လျှင်တောင် မိခင်နို့ကို တိုက်ကို တိုက်ကျွေးရမည်ဖြစ်သည်။ 
•	အိမ်မှာ မွေးဖွားလျှင် 7.1% ကလိုဟက်ဇဒင်းဆေးရည်ကို ချက်တိုင်ကို တစ်ရက်လျှင်တစ်ကြိမ် ၇ရက်ကြာ သုတ်လိမ်းပေးရမည်ဖြစ်သည်။ ကလိုဟက်ဇဒင်းမှလွဲ၍ အခြားမည်သည့်အရာကိုမျှ ချက်တိုင်ကို မသုတ်လိမ်းပါနှင့်။ 
•	ချက်ကြွေမှ ရေချိုးပေးခြင်းသည် အကောင်းဆုံးဖြစ်ပြီး မွေးပြီး ၂၄ နာရီအတွင်း ရေ လုံးဝ လုံးဝ မချိုးပေးရပါ။ 
•	ကာကွယ်ဆေးကို ဆေးခန်းတွင် ထိုးနှံပေးရသည်မှာ အရေးကြီးပါသည်။ အဘယ်ကြောင့်ဆိုသော် ကာကွယ်ဆေးသည် ရောဂါများစွာကို ကာကွယ်ပေးခြင်းကြောင့်ဖြစ်ပါသည်။`}
titleNumberOfLines={200}/>
      </List.Accordion>

    </List.Section>
         </View>
       </ScrollView>
     )
   }

   const styles = StyleSheet.create({
    body :{
      flex:1,
      backgroundColor:'#D1D9FF',
      marginBottom:10,
      marginBottom:20,
    },
  headtitle:{
    color:'#102027',
    fontSize:30,
    marginTop:10,
    
  },
  subtitle:{
    color:'#260e04',
    fontSize:18,
    textDecorationLine: 'underline',
    margin:10,
  },
  p:{
    margin:7,
    color:'#4e342e',
    fontSize:15,
    lineHeight: 26,
  },
  subp:{
    color:'#4e342e',
    fontSize:15,
    backgroundColor:'#bcc3e5',
    textDecorationLine: 'underline',
  }
    
    })