import { Pressable, StyleSheet, Text, View ,Dimensions,Image} from 'react-native'
import React from 'react'
import { ScrollView } from 'react-native-gesture-handler'
import { List } from 'react-native-paper'


export default function Neoseven({navigation}) {
    const onPresshundler = () => {
    
    navigation.goBack()
    }
     return(
       <ScrollView style={{backgroundColor:'#D1D9FF'}}>
         <View style={styles.body} >
         <Text style={styles.subtitle}>
         (ဆ) ပုံမှန်ကာကွယ်ဆေးထိုးနှံတိုက်ကျွေးခြင်း (IMMUNIZATION)
         </Text>
         <Text style={styles.p}>        မွေးကင်းစကလေးများသည် ပို၍ ရောဂါကူးစက်ဖြစ်ပွားနိုင်ပါသည်။ ထို့ကြောင့် ရောဂါကူးစက်မှုကို ကာကွယ်ရန် ကာကွယ်ဆေးထိုးနှံရန် အလွန်အရေးကြီးပါသည်။ ကာကွယ်ဆေးထိုးခြင်းဖြင့် မွေးကင်းစကလေးများ လမ်းလျှောက်တတ်စကလေးများအား ပြင်းထန်သောနောက်ဆက်တွဲဆိုးကျိုးများ ရှိသော ရောဂါများ ၊ အသက်အန္တရာယ်ထိခိုက်စေနိုင်သော အဖြစ်များသော ရောဂါများမှ ကာကွယ်ပေးနိုင်ပါသည်။ ကာကွယ်ဆေးထိုး ၊ ဆေးတိုက်ခြင်း အစီအစဥ် စာရွက်ကို ဆေးခန်းတွင် ဖြစ်နိုင်လျှင် ကပ်ထားသင့်ပါသည်။ မိခင် နှင့် ကလေး ကျန်းမာရေးစောင့်ရှောက်မှု လက်စွဲစာအုပ်တွင်လည်း ပါဝင်ပါသည်။</Text>

         
         <Image source={require('../to/neoadd.png')} style={styles.img}/>
        
         

         <List.Accordion
        title="၁-၁။ တီဘီရောဂါ" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5"}} theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`တီဘီရောဂါသည်များသောအားဖြင့် အဆုတ်ကို ထိခိုက်စေပြီး ပြင်းထန်ပါက ဦးနှောက်၊ အရိုးနှင့်အဆစ် အပါအဝင် အခြားခန္ဓာကိုယ် အစိတ်အပိုင်းများကို ထိခိုက်စေနိုင်ပါသည်။ တီဘီရောဂါပိုးသည် လေထဲမှတစ်ဆင့် ကူးစက်ပျံ့ နှံ့ ပါသည်။
ကလေးများတွင်ဖြစ်ပွားပါက
• အားအင်ကုန်ခမ်းမောပန်းလွယ်မည်။ ကစားလိုစိတ်မရှိပါ။
• ကိုယ်ခန္ဓာကြီးထွားဖွံ့ဖြိုးမှု ရပ်တန့်နေခြင်း၊ အဖျားရှိခြင်းနှင့် ညဘက်ချွေးထွက်ခြင်းများလည်း ဖြစ်တတ်သည်။
• အရိုးအဆစ်တီဘီဖြစ်ပွားပါက တင်ပဆုံရိုး၊ ဒူးနှင့် ကျောရိုးတို့တွင် ရောင်ခြင်း၊ နာခြင်းနှင့် မသန်စွမ်းခြင်း၊ လမ်းမလျှောက်နိုင်ခြင်းများ ဖြစ်တတ်ပါသည်။
တီဘီရောဂါ ကာကွယ်ရန်နည်းလမ်းမှာ -
ကလေးငယ်များအား မွေးပြီးလျှင်ပြီးခြင်း ဘီစီဂျီကာကွယ်ဆေးကို စောနိုင်သမျှအစောဆုံး ထိုးနှံပေးရမည်။ မွေးစတွင် မထိုးနှံနိုင်ပါက အသက်(၂)လတွင် ထိုးနှံပေးရမည်။ ကလေး အသက် (၁၂) လ မတိုင်မီ ဘီစီဂျီ ကာကွယ်ဆေးတစ်ကြိမ် ထိုးနှံပေးရန်ဖြစ်ပါသည်။
ဘယ်ဘက်လက်မောင်း အပေါ်ပိုင်းတွင် အရေပြားထဲသို့ (၁)ကြိမ် ထိုးနှံပေးပါသည်။`}
        titleNumberOfLines={200} />
      </List.Accordion>

      <List.Accordion
        title=" ၁-၂။ အသည်းရောင်အသားဝါ ဘီ ရောဂါ" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5" }}  theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`အသည်းရောင်အသားဝါဘီရောဂါပိုး ကူးစက်ခံရသော အသက်တစ်နှစ်အောက်ကလေးငယ်များ၏ (၉၀%)သည် နာတာရှည်ဖြစ်လာ ကြသည်။ မွေးပြီးလျှင်ပြီးခြင်း စောစီးစွာ ကာကွယ်ဆေးထိုးပေးရန် အရေးကြီးပါသည်။
အသည်းရောင်အသားဝါဘီရောဂါပိုးကူးစက်ခံရသူ၏ သွေးနှင့် အခြားခန္ဓာကိုယ်အရည်များမှ ကူးစက်ပြန့်ပွား သည်။ HIV ရောဂါပိုးထက် အဆ (၅၀) မှ (၁၀၀) ထိ ပိုမိုကူးစက်နိုင်ပါသည်။
အသည်းရောင်အသားဝါ ဘီ ရောဂါဖြစ်ပွားသော ကလေးသည်
• အားနည်းခြင်း၊
• ဝမ်းဗိုက်မအီမသာ ဖြစ်ခြင်း၊
• အော့အန်ခြင်း၊
• ဗိုက်အောင့်ခြင်း၊
• မျက်စိနှင့် အသားဝါခြင်း - စသည့်ရောဂါလက္ခဏာများ ခံစားရနိုင်ပါသည်။
နာတာရှည် အသည်းရောဂါဖြစ်ပွားသူ လူနာများသည် အသည်းပျက်စီးခြင်းကြောင့်ဖြစ်သော လက္ခဏာများဖြစ်သည့်
• ခြေထောက်ရောင်ခြင်း
• ဝမ်းဗိုက်ဖောင်းခြင်း
• သွေးအန်ခြင်း
• သတိဖောက်ပြန်ခြင်းနှင့် အမူအရာပြောင်းလဲခြင်း စသောဝေဒနာများ ခံစားရနိုင်ပါသည်။
နာတာရှည် အသည်းရောင်အသားဝါဘီရောဂါပိုးသည် အသည်းခြောက်ရောဂါ၊ အသည်းကင်ဆာရောဂါ၊ အသည်းပျက်စီးခြင်းနှင့် သေဆုံးခြင်းများ ဖြစ်စေနိုင်သည်။
အသည်းရောင် အသားဝါဘီရောဂါကို အသည်းရောင် အသားဝါဘီကာကွယ်ဆေးဖြင့် ကာကွယ်နိုင်ပါသည်။ ပထမဦးဆုံးသော ကင်ဆာ ကာကွယ်ဆေးဖြစ်ပါသည်။
ကလေးငယ်များအားလုံး မွေးကင်းစတွင် အသည်းရောင်အသားဝါ ဘီ ကာကွယ်ဆေး (တစ်မျိုးတည်း)ကို တစ်ကြိမ်ထိုးနှံပေးရမည်။
အသည်းရောင်အသားဝါဘီရောဂါကို ဆုံဆို့၊ ကြက်ညှာ၊ မေးခိုင်၊ အသည်းရောင်အသားဝါဘီ Hib ပါဝင်သော ငါးမျိုးစပ်ကာကွယ်ဆေး Pentavalent Vaccine ဖြင့် ကာကွယ်နိုင်ပါသည်။ ကလေး အသက် (၂)လ၊ (၄)လ နှင့် (၆)လ အရွယ်များတွင် ငါးမျိုးစပ်ကာကွယ်ဆေးကို ကလေး၏ ဘယ်ဘက်ပေါင် အလယ်ပိုင်းအရှေ့ဘက်ရှိ ကြွက်သားထဲသို့ (၃)ကြိမ် ထိုးနှံပေးပါသည်။`}
titleNumberOfLines={200}/>
      </List.Accordion>

      <List.Accordion
        title="၁-၃။ ဆုံဆို့နာရောဂါ" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`ဆုံဆို့နာရောဂါသည် လေတွင်သယ်ဆောင်သော ရောဂါပိုးပါဝင်သည့် အမှုန်အမွှားများ အသက်ရှူလမ်းကြောင်းအတွင်း ဝင်ရောက်ခြင်းမှ တစ်ဆင့် ကူးစက်သည်။
ရောဂါကူးစက်ခံရသူကလေးသည်
• လည်ချောင်းနာခြင်း
• စားသောက်ချင်စိတ်မရှိခြင်း
• အဖျားအနည်းငယ်ရှိခြင်း စသည့်ရောဂါလက္ခဏာများ ခံစားရပါမည်။
• အာခေါင်တွင် ဖြူပြာရောင် (သို့မဟုတ်) မီးခိုးရောင်အမြှေးပါး တွေ့ရှိရတတ်သည်။ အဆိုပါအမြှေးပါးသည် အသက်ရှူလမ်းကြောင်းကို ပိတ်ဆို့တတ်သည်။ အစာမမြိုနိုင်၊ အသက်မရှူနိုင်ဖြစ်တတ်သည်။ အသက်ရှူလမ်းကြောင်း ပိတ်ဆို့ပြီး အသက်ဆုံးရှုံးနိုင်ပါသည်။
• နှလုံးနှင့် အာရုံကြောသို့ ပျံ့နှံ့သွားပါက သေဆုံးနိုင်ပါသည်။
ဆုံဆို့နာရောဂါကို ဆုံဆို့၊ ကြက်ညှာ၊ မေးခိုင်၊ အသည်းရောင် အသားဝါဘီ၊ ံငဘ ပါဝင်သော ငါးမျိုးစပ်ကာကွယ်ဆေး (Pentavalent Vaccine) ဖြင့် ကာကွယ်နိုင်ပါသည်။
ငါးမျိုးစပ်ကာကွယ်ဆေးကို ကလေးအသက်(၂)လ၊ (၄)လ၊ (၆)လ အရွယ်တွင် ဘယ်ဘက်ပေါင် အလယ်ပိုင်း အရှေ့ဘက်ကြွက်သားထဲသို့ (၃)ကြိမ် ထိုးနှံပေးပါသည်။`}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="၁-၄။ ကြက်ညှာချောင်းဆိုးရောဂါ" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`ကြက်ညှာချောင်းဆိုးရောဂါသည် အသက်ရှူလမ်းကြောင်းဆိုင်ရာရောဂါတစ်မျိုးဖြစ်ပါသည်။
ဘက်တီးရီးယားရောဂါပိုးကြောင့် ဖြစ်ပွားပြီး နှာချေခြင်းနှင့် ချောင်းဆိုးခြင်းတို့မှတစ်ဆင့် လူတစ်ဦးမှတစ်ဦးသို့ ကူးစက်သည်။
တစ်နှစ်အောက် ကလေးငယ်များနှင့် ငယ်ရွယ်သော ကလေးငယ်များအနေဖြင့် ကူးစက်ခံရမှု အများဆုံးဖြစ်ပြီး ပြင်းထန်သော နောက်ဆက်တွဲ ပြဿနာများဖြစ်ပွားခြင်းနှင့် အသက်ဆုံးရှုံးခြင်းများ ဖြစ်နိုင်ပါသည်။
ကြက်ညှာချောင်းဆိုးရောဂါ ဖြစ်ပွားသောကလေးသည် ကနဦးရောဂါလက္ခဏာများအဖြစ်
• နှာရည်ယိုခြင်း၊ နှာချေခြင်း၊
• မျက်ရည်ယိုခြင်း
• အဖျားရှိခြင်း
• ချောင်းအနည်းငယ်ဆိုးခြင်း စသည်တို့ ဖြစ်ပွားနိုင်ပါသည်။
• ချောင်းဆိုးခြင်းသည် တဖြည်းဖြည်း ပိုမိုဆိုးရွားလာပြီး နောက်အကြိမ်များစွာ အဆက်မပြတ် ပြင်းထန်လာပါမည်။ နေ့ည ချောင်းဆိုးလွန်း၍ အအိပ်အနေခက်မည်။ အဆက်မပြတ် ပြင်းထန်စွာ ချောင်းဆိုးခြင်းရပ်နားချိန်တွင် စူးရှသောဆွဲငင်သံဖြင့် ကြက်တွန်သံသဖွယ် မြည်လျက ်အသက်ရှူသွင်းပါသည်။
• အဆက်မပြတ် ပြင်းထန်ကြာရှည်စွာ ချောင်းဆိုးခြင်းကြောင့် အောက်ဆီဂျင် လုံလောက်စွာ မရရှိသဖြင့် ကလေးငယ်သည် ပြာနှမ်းလာမည်။
မရပ်မနား ချောင်းရှည်ရှည်ဆိုးပြီးနောက် အော့အန်ပြီး ပင်ပန်းနွမ်းနယ်နေပါမည်။ အထူးသဖြင့် ညအချိန်တွင် မကြာခဏ ဖြစ်ပွားတတ်ပါသည်။
ကြက်ညှာချောင်းဆိုးရောဂါကို ဆုံဆို့၊ ကြက်ညှာ၊ မေးခိုင်၊ အသည်းရောင် အသားဝါဘီ၊ Hib ပါဝင်သော ငါးမျိုးစပ်ကာကွယ်ဆေး (Pentavalent Vaccine) ဖြင့် ကာကွယ်နိုင်ပါသည်။ ငါးမျိုးစပ်ကာကွယ်ဆေးကို ကလေးအသက်(၂)လ၊ (၄)လ၊ (၆)လ အရွယ်တွင် ဘယ်ဘက်ပေါင် အလယ်ပိုင်း အရှေ့ဘက်ကြွက်သားထဲသို့ (၃)ကြိမ် ထိုးနှံပေးပါသည်။`}
titleNumberOfLines={200}/>
        </List.Accordion>


        <List.Accordion
        title="၁-၅။ မွေးကင်းစ မေးခိုင်ရောဂါ" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`မေးခိုင်ရောဂါသည် မြေကြီးထဲရှိ မေးခိုင်ဘက်တီးရီးယားပိုးများ ကူးစက်ဝင်ရောက်ခြင်းကြောင့် ဖြစ်ပွားပါသည်။
မွေးကင်းစကလေးငယ်များတွင် မွေးဖွားစဉ် မသန့်ရှင်းသောနေရာများတွင် မွေးဖွားခြင်း၊ ချက်ကြိုးဖြတ်ရာတွင် မသန့်ရှင်းသောကိရိယာများ အသုံးပြုခြင်း၊ မသန့်ရှင်းသောပစ္စည်းများ အသုံးပြု၍ ချက်တိုင်ကို ဆေးထည့်ခြင်းနှင့် ကလေးမွေးဖွားစဉ် မွေးဖွားပေးသူ၏လက်များ သန့်ရှင်းမှုမရှိခြင်းများကြောင့် မေးခိုင်ရောဂါပိုး ကူးစက်ဝင်ရောက်ပြီး မွေးကင်းစမေးခိုင်ရောဂါ ဖြစ်ပွားနိုင်ပါသည်။
မွေးကင်းစမေးခိုင်ရောဂါ ကူးစက်ဖြစ်ပွားသူကလေးငယ်သည်
• မွေးစမှ (၂)ရက်သားအထိ ကျန်းမာစွာဖြင့် နို့ကောင်းစွာ စို့နိုင်ပါသည်။
• (၃)ရက်မှ (၂၈) ရက်အတွင်း နို့မစို့ နိုင်ခြင်း၊ တောင့်ခြင်း (သို့မဟုတ်) တက်ခြင်းဖြစ်နိုင်သည်။
• အသက်ဆုံးရှုံးနိုင်ပါသည်။
မွေးကင်းစမေးခိုင်ရောဂါကို ကိုယ်ဝန်ဆောင်မိခင်အား ကိုယ်ဝန်ဆောင်စဉ် မေးခိုင်ကာကွယ်ဆေး (သို့မဟုတ်) မေးခိုင်နှင့် ဆုံဆို့နာ နှစ်မျိုးစပ်ကာကွယ်ဆေးကို ၁ လခြား၍ (၂)ကြိမ် ထိုးပေးခြင်းဖြင့် ကာကွယ်နိုင်ပါသည်။ မေးခိုင်နှင့်ကြက်ညှာ နှစ်မျိုးစပ်ကာကွယ်ဆေး ဒုတိယအကြိမ်ကို မမွေးမီ ရက်သတ္တပတ်(၂)ပတ် မတိုင်မီ ထိုးနှံပေးပြီး ဖြစ်ရပါမည်။
၁-၆။ ပိုလီယိုအကြောသေရောဂါ
ပိုလီယိုအကြောသေရောဂါသည် အလွန်ကူးစက်မြန်သောရောဂါဖြစ်ပြီး၊ ပိုလီယိုဗိုင်းရပ်စ် အရိုင်းပိုးအမျိုးအစား(၁)၊ (၂)နှင့် (၃) တို့ကြောင့် ဖြစ်ပွားသည်။ ပိုလီယိုအကြောသေရောဂါပိုး ကူးစက်ခံနေရသူ အများစုသည် အကြောသေခြင်း မရှိကြပါ။ သို့သော် အခြားသူအား ကူးစက်စေနိုင်ပါသည်။
ရောဂါပိုးကူးစက်ခံရသူ၏ မစင်ဖြင့် ထိတွေ့သောအစားအစာများနှင့် ရေများကို စားသောက်မိခြင်းမှတဆင့် ကူးစက်ပြန့်ပွားနိုင်ပါသည်။
ပိုလီယိုအကြောသေရောဂါ၏ လက္ခဏာများမှာ
ရောဂါပိုးကူးစက်ခံရသူ ၂၅% သည် ဖျားခြင်း၊ ခေါင်းကိုက်ခြင်း၊ လည်ချောင်းနာခြင်းစသော သာမန်ဝေဒနာများ ဖြစ်ပွားခံစားတတ်ပါသည်။
ပိုလီယိုအကြောသေရောဂါပိုး ကူးစက်ခံရသူ ၁%သည်သာ အကြောသေရောဂါ ဖြစ်ပွားပါသည်။ ခြေတစ်ဘက်၊ လက်တစ်ဘက်မျှသာ တဖြည်းဖြည်း အကြောသေရာမှ (၁၀)ရက်အတွင်း သိသိသာသာ ခြေ၊ လက်နှင့် အသက်ရှူ<ကက်သားတို့ ထိခိုက်သေဆုံးနိုင်ပါသည်။ ကလေးသည် တစ်သက်လုံး မသန်စွမ်းသောဘဝသို့ ရောက်ရှိနိုင်ပါသည်။
အကြောသေရောဂါဖြစ်ပွားသူ (၅%) မှ (၁၀%) သေဆုံးနိုင်ပါသည်။
ပိုလီယိုအကြောသေရောဂါဖြစ်ပွားမှုကို ပိုလီယိုအစက်ချကာကွယ်ဆေးနှင့် ပိုလီယိုကာကွယ်ဆေးထိုးဆေးများ ထိုးနှံတိုက်ကျွေးခြင်းဖြင့် ကာကွယ်နိုင်ပါသည်။
ပိုလီယိုအစက်ချကာကွယ်ဆေးကို ကလေးအသက် (၂)လ၊ (၄)လ၊ (၆)လ အရွယ်များတွင်တိုက်ကျွေးပြီး ပိုလီယိုကာကွယ်ဆေး ထိုးဆေးကို ကလေးအသက်(၄) လအရွယ်တွင် ပိုလီယိုအစက်ချကာကွယ်ဆေးနှင့်အတူ ကြွက်သားထဲသို့ တစ်ကြိမ် ထိုးနှံပေးပါသည်။`}
titleNumberOfLines={200}/>
        </List.Accordion>


        <List.Accordion
        title="၁-၇။ Hib ပြင်းထန်အဆုတ်ရောင်ရောဂါနှင့် ဦးနှောက်အမြှေးရောင်ရောဂါ" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`Hib ဘက်တီးရီးယားပိုးသည် (၅)နှစ်အောက်ကလေးများ အထူးသဖြင့် အသက်(၂)နှစ်အောက်ကလေးများတွင် ဖြစ်ပွားသော ပြင်းထန် အဆုတ်ရောင်ရောဂါနှင့် ဦးနှောက်အမြှေးရောင်ရောဂါများကို ကူးစက်ဖြစ်ပွားစေပါသည်။ Hib ရောဂါပိုး သယ်ဆောင်ထားပြီး ရောဂါလက္ခဏာ မပြဘဲ ကျန်းမာနေသည့်ကလေးများနှင့် ရောဂါလက္ခဏာ ခံစားနေရသော ကလေးများမှတဆင့် ရောဂါကူးစက် ပြန့်ပွားစေပါသည်။
ရောဂါရှိသူက ချောင်းဆိုး၊ နှာချေသောအခါ ထွက်လာသော ရောဂါပိုးပါဝင်သည့် အမှုန်အမွှားများ အသက်ရှူ လမ်းကြောင်းအတွင်း ဝင်ရောက်ခြင်းမှတဆင့် လူတစ်ဦးမှတစ်ဦးသို့ ကူးစက်ပြန့်ပွားသည်။
အဆုတ်ရောင်ရောဂါဖြစ်ပွားသော ကလေးသည် ဖျားခြင်း၊ ချမ်းတုန်ခြင်း၊ ချောင်းဆိုးခြင်း၊ အသက်ရှူမြန်ခြင်းနှင့် ရင်ဘတ်ချိုင့်ဝင်ခြင်းများ ဖြစ်တတ်သည်။
ဦးနှောက်အမြှေးရောင်ရောဂါဖြစ်သော ကလေးများသည် ဖျားခြင်း၊ ခေါင်းကိုက်ခြင်း၊ အလင်းရောင်မကြည့်နိုင်ခြင်း၊ ဇက်တောင့်ခြင်း၊ စိတ်ရှုပ်ထွေးခြင်းနှင့် သတိလစ်ခြင်းများဖြစ်တတ်သည်။ ထိရောက်စွာ ကုသမှုမပြုပါက သေဆုံးနိုင်ပါသည်။
ဦးနှောက်အမြှေးရောင်ရောဂါဖြစ်ပွားပြီးနောက် အသက်ရှင်ကျန်ရစ်သော ကလေး ၄၀% ခန့်ထိ ဦးနှောက်ပျက်စီးခြင်း အပါအဝင် အမြဲတမ်း ဦးနှောက်နှင့်အာရုံကြောဆိုင်ရာ မသန်စွမ်းမှုများဖြစ်ခြင်း၊ ဉာဏ်ရည်မမီခြင်း၊ နားပင်းခြင်းများ ဖြစ်ပွားတတ်ပါသည်။ Hib ပြင်းထန်အဆုတ်ရောင်ရောဂါနှင့် ဦးနှောက်အမြှေးရောင်ရောဂါကို ဆုံဆို့၊ ကြက်ညှာ၊ မေးခိုင်၊ အသည်းရောင် အသားဝါဘီ၊ Hib ပါဝင်သော ငါးမျိုးစပ်ကာကွယ်ဆေး (Pentavalent Vaccine) ဖြင့် ကာကွယ်နိုင်ပါသည်။ Hib ပါဝင်သော ငါးမျိုးစပ်ကာကွယ်ဆေးကို ကလေးအသက်(၂)လ၊ (၄)လ၊ (၆)လ အရွယ်တွင် ဘယ်ဘက်ပေါင် အလယ်ပိုင်း အရှေ့ဘက် ကြွက်သားထဲသို့ (၃)ကြိမ် ထိုးနှံပေးပါသည်။`}
titleNumberOfLines={200}/>
        </List.Accordion>


        <List.Accordion
        title="၁-၈။ ဝက်သက်ရောဂါ" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`ဝက်သက်ရောဂါသည် ဝက်သက်ဗိုင်းရပ်စ်ပိုးကြောင့် ဖြစ်ပွားသည့် အလွန်ကူးစက်မြန်သောရောဂါဖြစ်ပြီး နှာချေခြင်း၊ ချောင်းဆိုးခြင်း၊ တစ်ဦးနှင့် တစ်ဦး နီးကပ်စွာထိတွေ့ခြင်းဖြင့် ကူးစက်နိုင်ပါသည်။
ရောဂါလက္ခဏာများ
• ပထမဆုံးသော ရောဂါလက္ခဏာမှာ အပြင်းဖျားခြင်းဖြစ်ပြီး (၁)ရက်မှ (၇)ရက် ကြာမြင့်သည်။ ၎င်းင်းကာလတွင် နှာရည်ယိုခြင်း၊ ချောင်းဆိုးခြင်း၊ မျက်မြှေးရောင်ခြင်းနှင့် ပါးစောင်တွင် သေးငယ်သော အဖြူစက်ပေါ်ခြင်းများ ဖြစ်ပွားသည်။
• ရောဂါပိုးဝင်ရောက်ပြီး နောက်(၇)ရက်မှ (၁၈)ရက်အတွင်းတွင် အနီအဖုအပိန့်များ မျက်နှာနှင့် လည်ပင်းမှစတင် ပေါ်လာပြီးနောက် တစ်ကိုယ်လုံးသို့ ပျံ့နှံ့သွားသည်။ (၅)ရက်မှ (၆)ရက်ကြာမြင့်ပြီးနောက် အရောင်ဖျော့ပြီး ပျောက်သွားသည်။
• နောက်ဆက်တွဲ ဆိုးကျိုးများမှာ အဆုတ်ရောင်ခြင်း၊ ပြင်းထန်ဝမ်းလျှောဝမ်းပျက်ရောဂါဖြစ်ပြီး အရည်ခမ်းခြောက်ခြင်း၊ နားအလယ်ခန်းရောင်ခြင်းနှင့် ဦးနှောက်ရောင်ခြင်း တို့ဖြစ်သည်။
• ဝက်သက်ရောဂါနှင့် အဆုတ်ရောင်ရောဂါယှဉ်တွဲဖြစ်ပွားခြင်းသည် ကလေးများသေဆုံးမှု မြင့်မားစေသော အကြောင်းတစ်ခုဖြစ်သည်။
• ဗီတာအေ ဖြည့်စွက်တိုက်ကျွေးခြင်း အပါအဝင်ထိရောက်စွာ ပြုစုကုသမှုပေးခြင်းဖြင့် ပြင်းထန်သော နောက်ဆက်တွဲဆိုးကျိုးများကို လျှော့ချနိုင်ပါသည်။
ဝက်သက်ရောဂါဖြစ်ပွားမှုကို ဝက်သက်ကာကွယ်ဆေး ပါဝင်သော ကာကွယ်ဆေး(၂)ကြိမ် ထိုးနှံပေးခြင်းဖြင့် ကာကွယ်နိုင်ပါသည်။
→ ဝက်သက်ကာကွယ်ဆေး ပထမအကြိမ်ကို ကလေးအသက်(၉)လ မှ (၁၂)လအရွယ်တွင် ထိုးနှံပေးရမည်။
→ ဒုတိယအကြိမ်ကို ကလေးအသက် (၁၈)လမှ (၂)နှစ်အတွင်း ထိုးနှံပေးသင့်ပါသည်။
ဝက်သက်ပါဝင်သောကာကွယ်ဆေးကို ကလေးငယ်၏ ဘက်ဘက်လက်မောင်းအပေါ်ပိုင်း၊ အရေပြားအောက်သို့ ထိုးနှံပေးပါသည်။`}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="၁-၉။ ဂျိုက်သိုးရောဂါနှင့် မွေးရာပါဂျိုက်သိုးရောဂါ" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`ဂျိုက်သိုးရောဂါနှင့် မွေးရာပါ ဂျိုက်သိုးရောဂါသည် ဗိုင်းရပ်စ်ပိုးကြောင့် ကူးစက်ဖြစ်ပွားသည်။ ဂျိုက်သိုးရောဂါသည် ကလေးအရွယ်တွင် ဖြစ်ပွားလေ့ရှိသော သာမန်ရောဂါမျှသာ ဖြစ်သော်လည်း အမျိုးသမီးတစ်ဦးသည် ကိုယ်ဝန်ဆောင်စဉ် အစောပိုင်းကာလတွင် ဂျိုက်သိုးရောဂါပိုး ကူးစက်ခံရလျှင် သန္ဓေသားသို့ ရောဂါပိုးကူးစက်စေပြီး ကလေးသေဆုံးခြင်းနှင့် မွေးရာပါဂျိုက်သိုးရောဂါများ ဖြစ်ပွားနိုင်ပါသည်။
ရောဂါလက္ခဏာများ
• ဖျားခြင်း၊ မျက်စိနီခြင်း၊ အရေပြားတွင် အဖုအပိမ့်များထွက်ခြင်းတို့ဖြစ်သည်။ ဂျိုက်သိုးရောဂါပိုး ကူးစက်ခံရသူ (၁၀)
ယောက်တွင်(၂) ယောက်မှ (၅) ယောက်သည် အနီအဖုအပိမ့် ထွက်ခြင်းမရှိပါ။
• မွေးရာပါဂျိုက်သိုးရောဂါဖြစ်ပွားပါက နားမကြားခြင်း၊ မျက်စိတိမ်စွဲခြင်းနှင့် ဉာဏ်ရည်နိမ့်ကျခြင်းစသည့် နောက်ဆက်တွဲ ပြဿနာများ ခံစားရနိုင်ပါသည်။
ဝက်သက်ဂျိုက်သိုးကာကွယ်ဆေးကို ကလေးအသက်(၉)လမှ (၁၂)လအရွယ်တွင် တစ်ကြိမ်၊ (၁၈)လအရွယ်တွင် တစ်ကြိမ်၊ ထိုးနှံပေး ရမည်။ ဝက်သက်ဂျိုက်သိုးကာကွယ်ဆေးကို ကလေးငယ်၏ ဘက်ဘက်လက်မောင်းအပေါ်ပိုင်း၊ အရေပြားအောက်သို့ ထိုးနှံပေးပါသည်။`}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="၁-၁၀။ ပြင်းထန်အဆုတ်ရောင်ရောဂါ" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`ပြင်းထန်အဆုတ်ရောင်ရောဂါသည် နျူမိုကော့ကပ်စ် ဘက်တီးရီးယားပိုး ကူးစက်ဝင်ရောက်ခြင်းကြောင့် ဖြစ်ပွားပြီး ဖွံ့ဖြိုးဆဲနိုင်ငံများတွင် ငါးနှစ်အောက်ကလေး သေဆုံးမှု၏ အဓိကအကြောင်းရင်းတစ်ခု ဖြစ်ပါသည်။ အဆိုပါ ဘက်တီးရီးယားပိုး ဝင်ရောက်မှုကြောင့် ပြင်းထန် အဆုတ်ရောင်ရောဂါနှင့် ဦးနှောက်အမြှေးရောင်ရောဂါ 
ဖြစ်ပွားမှု များပြားပါသည်။ ကျန်းမာလျက် ရောဂါပိုးသယ်ဆောင်သူများနှင့် လူနာများမှတဆင့် ရောဂါပိုး ကူးစက်ပျံ့နှံ့ စေပါ သည်။
ရောဂါလက္ခဏာများ
ပြင်းထန်အဆုတ်ရောင်ရောဂါ
• ဖျားခြင်း၊ ချမ်းတုန်ခြင်း
• ကလေးများတွင် ချောင်းဆိုးခြင်း၊ အသက်ရှူမြန်ခြင်း၊ ရင်ဘတ်အောက်ပိုင်း ချိုင့်ဝင်ခြင်း
• လူကြီးများတွင် မောခြင်း၊ အသက်ရှူခက်ခဲခြင်း၊ ချောင်းဆိုးလျှင် နာခြင်းများ ခံစားရခြင်း
ဦးနှောက်အမြှေးရောင်ရောဂါ
• ခေါင်းကိုက်ခြင်း၊ အလင်းရောင်မခံနိုင်ခြင်း၊ ဇက်တောင့်ခြင်း၊ တက်ခြင်းနှင့် တစ်ခါတစ်ရံ စိတ်ရှုပ်ထွေးခြင်း၊ သတိလစ်ခြင်းများဖြစ်တတ်သည်။
ပြင်းထန်အဆုတ်ရောင်ရောဂါပိုး ကာကွယ်ဆေး (ဏဃဠ) ထိုးနှံပေးခြင်းဖြင့် ပြင်းထန်အဆုတ်ရောင ်ရောဂါ ပိုး ကြောင့်ဖြစ်သော အဆုတ်ရောင်ရောဂါနှင့် ဦးနှောက်အမြှေးရောင်ရောဂါကို ကာကွယ်နိုင်ပါသည်။
ကလေးအသက် (၂)လ၊ (၄)လနှင့် (၆)လအရွယ်တွင် ပြင်းထန်အဆုတ်ရောင် ရောဂါပိုးကာကွယ်ဆေးကို ကလေး၏ညာဘက်ပေါင် အလယ်ပိုင်းအရှေ့ဘက် ကြွက်သားထဲသို့ (၃)ကြိမ် ထိုးနှံပေးပါသည်။
ပြင်းထန်အဆုတ်ရောင်ရောဂါပိုး ကာကွယ်ဆေးသည် နျူမိုကောကပ်စ် ဘက်တီးရီးယားကြောင့် ဖြစ်ပွားသော ရောဂါများကိုသာ ကာကွယ်ပေးပြီး အခြားဘက်တီးရီးယားပိုးကြောင့် ဖြစ်ပွားသော အလားတူရောဂါများကို မကာကွယ်နိုင်ပါ။`}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="၁-၁၁။ ဂျပန်ဦးနှောက်ရောင်ရောဂါ" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`ဂျပန်ဦးနှောက်ရောင်ရောဂါသည် ဗိုင်းရပ်စ်ပိုးကြောင့် ဖြစ်ပွားသောရောဂါ ဖြစ်ပါသည်။ ဦးနှောက်တစ်ရှူးများ ရောင်ရမ်းပျက်စီးခြင်းကို ဖြစ်စေပြီး ပြင်းထန်သောနောက်ဆက်တွဲ ဆိုးကျိုးများ ဖြစ်ပေါ်စေနိုင်ပြီး အသက်သေဆုံး သည်အထိ ဖြစ်စေနိုင်ပါသည်။
ရောဂါလက္ခဏာများ
ရောဂါကူးစက်ခံရသူ အများစုသည် ရောဂါလက္ခဏာများ မပြကြပါ။ ပျှမ်းမျှအားဖြင့် ရောဂါပိုးကူးစက်ခံရသူ (၂၅၀) တွင် (၁)ဦးသာ ရောဂါ လက္ခဏာများ ရှိကြပါသည်။
ကနဦးလက္ခဏာများ
• ရုတ်တရက်အဖျားကြီးခြင်း
• ခေါင်းကိုက်ခြင်း
• မောပန်းပြီးနုံးခြင်း
• ပျို့ခြင်း ၊ အန်ခြင်း
• ရောဂါဖြစ်ပွားစတွင် ကလေးများသည် ဗိုက်နာခြင်းကို ထင်ရှားစွာ ခံစားကြရပါသည်။
နောက်ဆက်တွဲလက္ခဏာများ
• လည်ပင်းတောင့်တင်းခြင်း
• စိတ်ရှုပ်ထွေးခြင်း
• သတိလစ်ခြင်း
• မူးဝေအိပ်ငိုက်ခြင်း
• လှုပ်ရှားမှုမမှန်ခြင်း
• တက်ခြင်း စသည်တို့ဖြစ်နိုင်ပြီး အသက်ဆုံးရှုံးသည်အထိ ဖြစ်နိုင်ပါသည်။
အသက် (၁၀)နှစ်အောက်ကလေးငယ်များတွင် ပြင်းထန်သောရောဂါဖြစ်ပွားမှု များပြားပြီး သေဆုံးမှုနှုန်းများပါသည်။
ဦးနှောက်ရောင်ရောဂါဖြစ်ပွားသူ (၁၀၀)ဦး တွင် (၂၀) ဦး မှ (၃၀)ဦး အထိ အသက်သေဆုံးနိုင်ပါသည်။ အသက်ရှင်ကျန်ရစ်သူများမှ ထက်ဝက်နီးပါးခန့်တွင် အကြောသေခြင်းနှင့် ဦးနှောက်ပျက်စီးခြင်းများ ဖြစ်စေနိုင်ပါသည်။
ရောဂါကူးစက်ပုံ
• ဂျပန်ဦးနှောက်ရောင်ရောဂါပိုးသည် ငှက်များနှင့် အိမ်မွေးတိရစ္ဆာန်များ၊ အထူးသဖြင့် ရေတိမ်တွင်ကျက်စားသော ခြေတံရှည်ငှက်များ၊ ဝက်များသည် ရောဂါပိုးသိုလှောင်ရာဌာန ဖြစ်သည်။
• ရောဂါပိုး သယ်ဆောင်သော ခြင်များမှတဆင့် ကူးစက်ပျံ့နှံ့သည်။
• ဆည်မြောင်းရေသွင်း စိုက်ပျိုးသောနေရာများတွင် ခြင်ပေါက်ပွားသောကြောင့် တစ်နှစ်ပတ်လုံး ကူးစက်ဖြစ်ပွားနိုင်သည်။ သို့သော် မိုးရာသီ ကာလတွင် အများဆုံး ဖြစ်ပွားတတ်သည်။
• ကျေးလက်နေလူထုများ အထူးသဖြင့် ဆန်စပါးစိုက်ပျိုးသူများတွင် ဖြစ်ပွားမှုများပြားသည်။
ကာကွယ်နိုင်မည့် နည်းလမ်းများ
• ကာကွယ်ဆေးထိုးခြင်းသည် တစ်ခုတည်းသော အရေးပါဆုံး ကာကွယ်ရေးနည်းလမ်း ဖြစ်ပါသည်။
• ဂျပန်ဦးနှောက်ရောင်ရောဂါပိုး သယ်ဆောင်သောခြင်များသည် ညနေစောင်း နေဝင်ရီတရောတွင် ကိုက်လေ့ရှိသောကြောင့် ကလေးများကို ခြင်ထောင်ဖြင့် အိပ်စေခြင်းဖြင့် ရောဂါဖြစ်ပွားမှုကို ကာကွယ်နိုင်ပါသည်။
ကာကွယ်ဆေးထိုးသင့်သူများ
• ရောဂါကူးစက်ဖြစ်ပွားလွယ်သည့်နေရာများသို့ ခရီးသွားမည့်သူများသည် ခရီးမထွက်မီ (၁)လအလို ကြိုတင်ကာကွယ်ဆေး ထိုးနှံသင့် ပါသည်။ ကာလရှည်ခရီးထွက်သူများ၊ မကြာခဏခရီးသွားသူများ၊ ဂျပန်ဦးနှောက်ရောင်ရောဂါ ကပ်အသွင်ဖြစ်ပွားနေသည့် နိုင်ငံများကို ခရီးသွားသူများနှင့် ကျေးရွာကို လည်ပတ်သူများမှာ အဓိက ထိုးနှံသင့်ပါသည်။
• အသက် (၉)လအရွယ်မှစ၍ လူကြီးများ၊ လူငယ်များအားလုံး ကြိုတင်ကာကွယ်ဆေး ထိုးနှံနိုင်ပါသည်။
၂၀၁၈ ခုနှစ်မှ စတင်၍ အသက် (၉) လအရွယ် ကလေးများအား ဂျပန်ဦးနှောက်ရောင်ရောဂါကာကွယ်ဆေး စတင်ထိုးနှံပေးသွားမည် ဖြစ်ပါသည်။ ဂျပန်ဦးနှောက်ရောင်ကာကွယ်ဆေးကို ကလေး၏ ဘယ်ဘက်လက်မောင်းအပေါ်ပိုင်း အရေပြားအောက်သို့ ထိုးနှံပေးပါသည်။`}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="၁-၁၂။ ပြင်းထန်ဝမ်းပျက်ဝမ်းလျှောရောဂါ" titleNumberOfLines={20} style={{backgroundColor:"#bcc3e5"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`ပြင်းထန်ဝမ်းပျက်ဝမ်းလျှောရောဂါပိုး (ရိုတာဗိုင်းရပ်)သည် တစ်နှစ်အောက်ကလေးများနှင့် ကလေးငယ်များတွင် ပြင်းထန်သော ဝမ်းပျက် ဝမ်းလျှောရောဂါ ဖြစ်စေသော အဓိကအကြောင်းရင်းတစ်ခုဖြစ်ပါသည်။
ရိုတာဗိုင်းရပ်ပိုးသည် မစင်မှတဆင့် ပါးစပ်သို့ ဝင်ရောက်သောနည်းလမ်းဖြင့် ကူးစက်ပျံ့နှံ့ပါသည်။ ပတ်ဝန်းကျင်တွင် ကာလကြာရှည် ရှင်သန်နိုင်ပါသည်။
ရောဂါပြင်းထန်သောအခါ ထိရောက်သောကုသမှုများ လျင်မြန်စွာ မပြုနိုင်ပါက၊ သွေးလန့်ခြင်းနှင့် သေဆုံးခြင်းဖြစ်နိုင်ပါသည်။ ရိုတာ ဗိုင်းရပ်ပိုး ကာကွယ်ဆေးတိုက်ခြင်းဖြင့် ရိုတာဗိုင်းရပ်ပိုးကြောင့်ဖြစ်သော ပြင်းထန်ဝမ်းပျက်ဝမ်းလျှောရောဂါကို ထိရောက်စွာ ကာကွယ်နိုင်ပါသည်။
၂၀၁၈ခုနှစ်နောက်ပိုင်းတွင် ရိုတာဗိုင်းရပ်စ်ပိုးကာကွယ်ဆေးအား ကလေးငယ်များကို အသက် (၂) လနှင့် (၄) လတွင် နှစ်ကြိမ် တိုက်ကျွေးခြင်းဖြင့် ပုံမှန်ကာကွယ်ဆေးထိုး၊ ဆေးတိုက်ခြင်းအစီအစဉ်တွင် စတင်ထည့်သွင်းသွားမည် ဖြစ်ပါသည်။`}
titleNumberOfLines={200}/>
        </List.Accordion>


         </View>
       </ScrollView>
     )
   }

   const styles = StyleSheet.create({
    body :{
      flex:1,
      backgroundColor:'#D1D9FF',
      marginBottom:10,
      marginBottom:20,
    },
  headtitle:{
    color:'#102027',
    fontSize:30,
  },
  subtitle:{
    color:'#260e04',
    fontSize:18,
    textDecorationLine: 'underline',
  },
  p:{
    margin:7,
    color:'#4e342e',
    fontSize:15,
    lineHeight: 26,
  },
  subp:{
    color:'#4e342e',
    fontSize:15,
    backgroundColor:'#bcc3e5',
    textDecorationLine: 'underline',
  },
  img :{
    backgroundColor:'#bcc3e5',
    width: Dimensions.get('screen').width/1,
    height: Dimensions.get('screen').height/2,
    resizeMode: 'contain'
  },
    })