import { Pressable, StyleSheet, Text, View } from 'react-native'
import React from 'react'
import { ScrollView } from 'react-native-gesture-handler'
import { List } from 'react-native-paper'


export default function YThree({navigation}) {
    const onPresshundler = () => {
    
    navigation.goBack()
    }
     return(
       <ScrollView  style={{backgroundColor:'#FFCCCB'}}>
         <View style={styles.body} >
         <Text style={styles.subtitle}>
         (ဂ) ကျား၊ မ အခြေပြု အကြမ်းဖက်မှုများ 
         </Text>
        <Text style={styles.p}>
        {"\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0"}
        ကျား၊ မရေးရာ (Gender) ဆိုသည်မှာ အမျိုးသမီးနှင့် အမျိုးသားများအကြား လိင်ကွဲပြားမှုအပေါ် အခြေခံ၍ လူမှုအသိုက်အဝန်းမှ လူမှုရေးအရ ခွဲခြားသတ်မှတ်ထားခြင်း ဖြစ်ပါသည်။ ယောကျ်ားလေး (သို့မဟုတ်) မိန်းကလေးအဖြစ် မွေးဖွားလာသည့်အချိန်မှ စတင်ကာ ကျား၊ မရေးရာ တရားသေအမြင်များ၊ စံနှုန်းများအရ မည်သို့နေထိုင်ပြုမူရမည်ကို သင်ကြားခြင်းခံရပါသည်။ အမျိုးသမီးနှင့် အမျိုးသားများအတွက် လူမှုရေးရာ သတ်မှတ်ချက်များမှာ ကမ္ဘာ့ဒေသ အသီးသီးတွင် များစွာကွဲပြားခြားနားပေသည်။ သတ်မှတ်ချက်အများအပြားမှာ ယေဘုယျအားဖြင့် အင်အားနည်းပါးပြီး ထိခိုက်ခံစားရလွယ်သော အမျိုးသမီးများအတွက် တန်းတူညီမျှမှု၊ တရားမျှတမှုတို့ မရရှိစေဘဲ ပိုမို၍ထိခိုက်လွယ်စေပါသည်။
        {"\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0"}
        ကျား၊ မအခြေပြုအကြမ်းဖက်မှုဆိုသည်မှာ အမျိုးသမီးနှင့် အမျိုးသားများအကြား လူမှုရေးအရ သတ်မှတ်ချက်များ ကွဲပြားနေခြင်းအပေါ် အခြေခံကာ တစ်ဦးတစ်ယောက်၏ဆန္ဒနှင့် ဆန့်ကျင်ပြီး ထိခိုက်နစ်နာစေရန် ကျူးလွန်သည့် အပြုအမူမှန်သမျှကို ခြုံငုံဖေါ်ပြသော အသုံးအနှုန်းတစ်ခုဖြစ်သည်။ ၎င်းမှာ ရုပ်ပိုင်းဆိုင်ရာ၊ လိင်ပိုင်းဆိုင်ရာ (သို့မဟုတ်) စိတ်ပိုင်းဆိုင်ရာ ထိခိုက်ခံစားရစေခြင်းများအပြင် အကြမ်းဖက်မည်ဟု ခြိမ်းခြောက်ခြင်း၊ အတင်းအကြပ် ဖိအားပေးလုပ်ဆောင်စေခြင်းနှင့် လွတ်လပ်မှုကို ထိပါးစေသည့် အခြားသော လုပ်ဆောင်ခြင်းများလည်း ပါဝင်ပါသည်။ (MOHS, 2018)
        </Text>
        <List.Section title="ကျား၊မအခြေပြုအကြမ်းဖက်မှုပုံစံအမျိုးမျိုး" style={styles.headtitle}>
      <List.Accordion
        title="ရုပ်ပိုင်းဆိုင်ရာ အကြမ်းဖက်မှု" titleNumberOfLines={20} style={{backgroundColor:"#e5b7b6"}} theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`• ရိုက်နှက်ခြင်း၊ ထိုးကြိတ်ခြင်း၊ ကန်ကျောက်ခြင်း၊ တွန်းချခြင်း၊ ပစ်ပေါက်ခြင်း၊ လိမ်ချိုးခြင်း၊
လည်ပင်းညှစ်ခြင်း
• လက်နက်သုံးခြင်း၊ ချုပ်နှောင်ခြင်း
• အန္တရာယ်ရှိသော အရာကို အတင်းအကျပ် စားသုံးစေခြင်း၊
• မီး/ငရဲမီးဖြင့် လောင်စေခြင်း
• ဆေးမကုသနိုင်စေရန်၊ အကူအညီမတောင်းနိုင်စေရန် ထိန်းချုပ်ထားခြင်း စသည်တို့မှတဆင့် နာကျင်ဒဏ်ရာရခြင်း၊ အရိုးကျိုးခြင်း၊ သေဆုံးခြင်းတို့ကို ဖြစ်စေနိုင်ပါသည်။`}
        titleNumberOfLines={200} />
      </List.Accordion>

      <List.Accordion
        title=" လိင်ပိုင်းဆိုင်ရာ အကြမ်းဖက်မှု (Sexual Assault)" titleNumberOfLines={20} style={{backgroundColor:"#e5b7b6" }}  theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`သိကျွမ်းသူ (ရင်းနှီးကျွမ်းဝင်သော လက်တွဲဖေါ်၊ အခြား မိသားစုဝင်၊ မိတ်ဆွေ (သို့မဟုတ်) အသိအကျွမ်း) (သို့မဟုတ်) သူစိမ်းက ကျူးလွန်ခြင်းဖြစ်နိုင်သည်။
• မုဒိမ်းကျင့်ခြင်း၊ မုဒိမ်းကျင့်ရန် အားထုတ်ခြင်း၊ ကာယကံရှင်ဆန္ဒမပါဘဲ အင်အားသုံး၍ လိင်ဆက်ဆံခြင်း
• လူကုန်ကူးခြင်း၊ လိင်ပိုင်းဆိုင်ရာ အမြတ်ထုတ်ခြင်း
• အလုပ်အကိုင်၊ အခွင့်အလမ်းအတွက် (သို့မဟုတ်) စားဝတ်နေရေး အခက်အခဲရှိသူကို လိင်ဆက်ဆံရန်
ဖိအားပေးခြင်း
• သွေးရင်းသားချင်းမှ လိင်ဆက်ဆံခြင်း
• နှုတ်ဖြင့်ဖြစ်စေ၊ ကိုယ်အမူအရာဖြင့်ဖြစ်စေ လိင်ပိုင်းဆိုင်ရာ ထိပါးနှောင့်ယှက်ခြင်း၊ ညစ်ညမ်းရုပ်ပုံများ
ပြသခြင်း
• လိမ်လည်လက်ထပ်ခြင်း
• အတင်းအကျပ် လက်ထပ်စေခြင်း၊ ကိုယ်ဝန်ဆောင်စေခြင်း၊ သားပျက်စေခြင်း၊ သားကြောဖြတ်စေခြင်း
• သဘောဆန္ဒမပါရှိဘဲ လိင်ဆက်ဆံရန်၊ လိင်ပိုင်းဆိုင်ရာ မဖွယ်မရာအပြုအမူများ ပြုလုပ်ရန်
အတင်းအကျပ် ပြုလုပ်ခြင်း
• လိင်ဆက်ဆံစဉ် ထိခိုက်နာကျင်စေအောင် အန္တရာယ်ပေးခြင်း
• ကိုယ်ဝန်မရအောင်၊ ရောဂါမကူးစက်အောင် ကာကွယ်ခွင့်မပေးဘဲ အတင်းအကျပ်လိင်ဆက်ဆံစေခြင်း`}
titleNumberOfLines={200}/>
      </List.Accordion>

      <List.Accordion
        title="စိတ်ပိုင်းဆိုင်ရာ အကြမ်းဖက်မှု" titleNumberOfLines={20} style={{backgroundColor:"#e5b7b6"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`• အကြမ်းဖက်ခံရသူ (သို့မဟုတ်) ၎င်း၏ ချစ်ခင်သူများ၊ ကလေးများအား နာကျင်အောင် လုပ်မည်ဟုခြိမ်းခြောက်ခြင်း၊ လက်နက်ပြ၍ ခြောက်လှန့်ခြင်း
• အကြမ်းဖက်ခံရသူ နှစ်သက်သော ပစ္စည်းများကို ဖျက်စီးခြင်း၊ ဖျက်စီးမည်ဟု ခြိမ်းခြောက်ခြင်း
• လျစ်လျူရှုထားခြင်း၊ စကားမပြောခြင်း၊ အလေးမထားခြင်း
• လူမှုရေးဖောက်ပြန်ခြင်း၊ ပွေရှုပ်ခြင်း၊ မူးယစ်ရမ်းကားခြင်း
• စွပ်စွဲခြင်း၊ မည်သည့်နေရာတွင် ရှိနေကြောင်း အချိန်ပြည့်မေးမြန်းခြင်း
• သစ္စာမရှိဟု မကြာခဏသံသယရှိနေခြင်း
• လုပ်ငန်းခွင်နှင့် လူမှုပတ်ဝန်းကျင်တွင် အရှက်ရစေရန် လိုက်လံနှောင့်ယှက်ခြင်း`}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="နှုတ်စကားဖြင့် အကြမ်းဖက်မှု" titleNumberOfLines={20} style={{backgroundColor:"#e5b7b6"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`• နှိမ်ချစော်ကားသော အသုံးအနှုန်းများဖြင့် အမည်တပ်၍ ခေါ်ဆိုဆက်ဆံခြင်း
• ရုပ်ဆိုးသည်၊ ဉာဏ်နည်းသည်စသည်ဖြင့် လူအများရှေ့တွင် နှိမ်ချအရှက်ခွဲခြင်း၊
ထပ်တလဲလဲအပြစ်တင်ခြင်း
• အော်ဟစ်ဆူပူခြင်း၊ ဆဲဆိုခြင်း၊ စော်ကားခြင်း၊ စွပ်စွဲခြင်း
• အကြမ်းဖက်ခံရသူနှင့်သက်ဆိုင်သူ(မိဘဆွေမျိုး၊ သားသမီး၊ မိတ်ဆွေ) များအား စွပ်စွဲနှိမ့်ချပြောဆိုခြင်း`}
titleNumberOfLines={2000}/>
        </List.Accordion>

        <List.Accordion
        title="စီးပွားရေးနှင့် ငွေကြေးဆိုင်ရာ အကြမ်းဖက်မှု" titleNumberOfLines={20} style={{backgroundColor:"#e5b7b6"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`• ဝင်ငွေရရန် အလုပ်လုပ်ခွင့်မပေးခြင်း
• အိမ်မှုကိစ္စများ အချိန်ပြည့်အလွန်အကျွံခိုင်းစေခြင်း
• အိမ်သုံးစရိတ်နှင့် ကလေးစရိတ်များ လုံလောက်စွာ မပေးခြင်း
• အစာအာဟာရ၊ အဝတ်အစား၊ အသုံးအဆောင်၊ ဆေးကုသခွင့်များ လုံလောက်စွာ မပေးခြင်း
• အကြမ်းဖက်ခံရသူ၏ ငွေကြေးဥစ္စာကို သဘောမတူဘဲ ရယူခြင်း၊ ခြိမ်းခြောက်ရယူခြင်း၊ ခေါင်းပုံဖြတ်ခြင်း
• ပူးတွဲပိုင်ဆိုင်ခွင့်ရှိသော ငွေကြေးဥစ္စာများကို အကြမ်းဖက်ခံရသူအား အသိမပေးခြင်း
• နှစ်ဦးပိုင်အိမ်ထောင်ပစ္စည်းများအား လုယူခြင်း၊ ဖျက်စီးခြင်း
• အကြမ်းဖက်သူမှ အခွင့်အလမ်းများကို မိမိအတွက်သာ အသုံးချခြင်း`}
titleNumberOfLines={200}/>
        </List.Accordion>
         {/* facebook */}
        <List.Accordion
        title="နည်းပညာသုံး အကြမ်းဖက်မှု" titleNumberOfLines={20} style={{backgroundColor:"#e5b7b6"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`ဖေ့စ်ဘုတ်စသော လူမှုမီဒီယာများ၊ အင်တာနက်၊ လျှို့ဝှက်ကင်မရာများ၊ ဆေးဝါးများ စသည်တို့ကို အသုံးပြု၍ -
• ညစ်ညမ်းပုံများ ပြခြင်း
• ချိန်းဆိုခြင်း၊ အတင်းအကျပ် လိင်ဆက်ဆံခြင်း
• ခိုးဝှက်၍ ဓါတ်ပုံ၊ ဗီဒီယိုများ ရိုက်ကူးခြင်း
• ခြိမ်းခြောက်ငွေညှစ်ခြင်း၊ အရှက်ခွဲခြင်း
• အကျပ်ကိုင်၍ ထိန်းချုပ်လွှမ်းမိုးခြင်း
• လိင်ပိုင်းဆိုင်ရာ အမြတ်ထုတ်ခြင်း၊ လူကုန်ကူးခြင်း
• လက်ကိုင်ဖုန်းနှင့် လူမှုကွန်ယက်များကို ခွင့်ပြုချက်မရှိဘဲ ခိုးယူအသုံးပြုနှောင့်ယှက်ခြင်း၊ စစ်ဆေးခြင်း`}
titleNumberOfLines={200}/>
        </List.Accordion>

         <List.Accordion
        title="ရင်းနှီးကျွမ်းဝင်သော လက်တွဲဖော်မှ အကြမ်းဖက်မှု (Intimate Partner Violence - IPV)" titleNumberOfLines={20} style={{backgroundColor:"#e5b7b6"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`• ယခင်ဖြစ်စေ၊ လက်ရှိဖြစ်စေ ခင်ပွန်းယောကျ်ား၊ ဇနီးမယား၊ သမီးရည်းစား၊ ချစ်သူစသည့်
ရင်းနှီးကျွမ်းဝင်သော လက်တွဲဖော်မှ ဆက်လက်လုပ်ဆောင်နေသော (သို့မဟုတ်) ယခင်က
ပြုလုပ်ခဲ့သော အကြမ်းဖက်မှုကို ဆိုလိုသည်။
• အမျိုးသမီးများသည် ရင်းနှီးကျွမ်းဝင်သော လက်တွဲဖော်ဖြစ်သည့် အမျိုးသားမှ ကျူးလွန်သည့်
အကြမ်းဖက်မှုပုံစံ အမျိုးမျိုးကို ခံစားရနိုင်သည်။
ထိန်းချုပ်သည့် အပြုအမူများ
• အိမ်မှ အပြင်မထွက်ရခြင်း၊ မိသားစု၊ မိတ်ဆွေများနှင့် တွေ့ခွင့်၊ ဆက်သွယ်ခွင့်မပေးခြင်း၊
• ခွင့်ပြုချက်မရဘဲ ဆေးကုသမှု မခံယူနိုင်ခြင်း
• အသုံးစရိတ်မပေးဘဲ လွှမ်းမိုးထိန်းချုပ်ထားခြင်း
• မိသားစုအတွက် ဆုံးဖြတ်ချက်ချရာတွင် ပါဝင်ခွင့်မပေးခြင်း`}
titleNumberOfLines={200}/>
        </List.Accordion>

         <List.Accordion
        title="ထိခိုက်နစ်နာစေသော လူမှုဓလေ့ထုံးတမ်းဆိုင်ရာ အကြမ်းဖက်မှု" titleNumberOfLines={20} style={{backgroundColor:"#e5b7b6"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`ထိခိုက်နစ်နာစေသော လူမှုဓလေ့ထုံးတမ်းဆိုင်ရာ အကြမ်းဖက်မှုများဆိုသည်မှာ မိရိုးဖလာအလေ့အထတိုင်းကို ဆိုလိုခြင်းမဟုတ်ဘဲ ကျား၊မရေးရာနှင့် နှီးနွယ်ကာ ထိခိုက်နိမ့်ကျစေနိုင်သော အန္တရာယ်ရှိသည့် လူမှုရေးဓလေ့ထုံးစံ၊ အလေ့အထများကိုသာ ဆိုလိုပါသည်။ အချို့သော ဓလေ့ထုံးစံများသည် မိသားစုအတွင်းနှင့် လူထုအတွင်း၌ အထူးသဖြင့် အမျိုးသမီးများ၊ အသက်မပြည့်သေးသူများ၊ လိင်စိတ်ခံယူမှုကွဲပြားသူများ စသူတို့အပေါ် ထိခိုက်နစ်နာစေပြီး ၎င်းတို့၏ အခွင့်အရေး၊ အခြေအနေနှင့် အဆင့်အတန်းတို့ကို ထိပါးနိမ့်ကျစေနိုင်ပါသည်။
အကြမ်းဖက်မှုမြောက်သည့် လူမှုဓလေ့ထုံးစံများမှာ -
• သက်ငယ်ထိမ်းမြားမှု/ အတင်းအကျပ်ထိမ်းမြားမှု
• လိင်ပိုင်းဆိုင်ရာအပါအဝင် ကျား၊မအခြေပြုအကြမ်းဖက်မှုများ ဖြစ်ပွားပါက ကျူးလွန်ခံရသူကို
(ဝတ်စားပုံကြောင့်၊ လုံခြုံဘေးကင်းအောင် မနေထိုင်တတ်သောကြောင့် စသည်ဖြင့်) အပြစ်တင်ခြင်း၊
ကျူးလွန်သူကို ဥပဒေအရ အရေးယူရန် အားမပေးဘဲ ဓလေ့ထုံးစံနည်းလမ်းများဖြင့်သာ ဖြေရှင်းရန်
ဖိအားပေးခြင်း
• မိန်းကလေးများ၊ အမျိုးသမီးများအား အိမ်မှုကိစ္စနှင့် အခြားလုပ်ငန်းများကို မမျှတစွာ လုပ်ဆောင်ရန်
ခိုင်းစေခြင်း
• ထိမ်းမြားလက်ထပ်ရာတွင် တစ်ဖက်မိသားစုမှ ငွေကြေးဥစ္စာများစွာ တောင်းဆိုခြင်း (အထူးသဖြင့်
သတို့သမီး၏ မိသားစုထံမှ)
• မုဆိုးမများ၊ အိမ်ထောင်ကွဲသူများအား ခွဲခြားဆက်ဆံခြင်း၊ နှိမ်ချခြင်း၊ ပစ္စည်းဥစ္စာပိုင်ဆိုင်ခွင့်မပေးခြင်း
• လင်မယားကွာရှင်းရာတွင် သားသမီးများကို မိခင်နှင့်အတူနေရန် ခွင့်မပြုခြင်း၊ တွေ့ခွင့်မပေးခြင်း
• မုဆိုးမဖြစ်သွားပါက လင်ယောကျ်ား၏ ညီ (သို့မဟုတ်) လင်ယောကျ်ားဖက်မှ
အမျိုးတော်သူအမျိုးသားနှင့် အတင်းအကျပ်လက်ထပ်စေခြင်း
• မိန်းကလေးများကို ကျောင်းနေခွင့်၊ ပညာသင်ကြားခွင့်မပြုခြင်း
• သမီးမိန်းကလေးများအား အမွေဥစ္စာမပေးခြင်း
• (မိန်းမလျာ၊ ယောကျ်ားလျာစသည့်) လိင်စိတ်ခံယူမှုကွဲပြားသူများအား ခွဲခြားနှိမ်ချခြင်း၊ စိတ်ရောဂါရှိသူ၊
အပြစ်ရှိသူများဟု သတ်မှတ်ခြင်း၊ အပြစ်ပေးခြင်း
• (ထိန်းချုပ်လိုသော အကြောင်းဖြင့်) အမျိုးသမီးလိင်အင်္ဂါကို ဖြတ်တောက်ခြင်း (အာဖရိကနိုင်ငံအချို့တွင်
ကျယ်ပြန့်စွာ ပြုလုပ်သည်) စသည်တို့ ပါဝင်သည်။`}
titleNumberOfLines={200}/>
        </List.Accordion>

         <List.Accordion
        title="ခံစားရရှိနိုင်သော ဆိုးကျိုးများ" titleNumberOfLines={20} style={{backgroundColor:"#e5b7b6"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`အသက်သေဆုံးမှု`}
titleNumberOfLines={200} style={styles.subp} />
<List.Item title={`ဒဏ်ရာများကြောင့်သေဆုံးခြင်း
သတ်ဖြတ်ခံရခြင်း
သတ်သေခြင်း `}
titleNumberOfLines={200} />
<List.Item title={`အသက်မသေဆုံးသော်လည်း ခံစားရရှိနိုင်သော ဆိုးကျိုးများ`}
titleNumberOfLines={200} style={styles.subp} />
<List.Item title={`• ရုပ်ပိုင်းဆိုင်ရာ - ဒဏ်ရာရခြင်း၊ ပုံမှန်လှုပ်ရှားသွားလာမှုများ မပြုလုပ်နိုင်ခြင်း၊
ရုပ်ဆင်းအင်္ဂါနှင့် ကိုယ်လက်အင်္ဂါများ ပျက်စီးခြင်း၊ မသန်စွမ်းခြင်း၊
• စိတ်ပိုင်းဆိုင်ရာ - စိတ်ဓါတ်ကျခြင်း၊ ကြောက်ရွံ့ခြင်း၊ အိပ်မပျော်ခြင်း၊ 
အစာမစားနိုင်ခြင်း၊ သတ်သေလိုခြင်း၊ မိမိကိုယ်ကို တန်ဖိုးမထားတော့ခြင်း၊
ထိခိုက်ခံစားရပြီးနောက် စိတ်ဖိစီးမှု ဝေဒနာ (Post-Traumatic Stress Disorder)
• နောက်ဆက်တွဲပြဿနာများ - နာတာရှည်နာကျင်ခြင်း၊ ဆီးလမ်းကြောင်း၊
အသက်ရှု လမ်းကြောင်းနှင့် အစာအိမ်အူလမ်းကြောင်းရောဂါများ
• မျိုးဆက်ပွားကျန်းမာရေး - မျိုးပွားအင်္ဂါများ ရောင်ရမ်းခြင်း၊ လိင်မှတစ်ဆင့်
ကူးစက်တတ်သော ရောဂါများ ရရှိခြင်း၊ မလိုလားအပ်သောကိုယ်ဝန်ရခြင်း၊ ကိုယ်ဝန်ပျက်ခြင်း၊ ကိုယ်ဝန်နှင့်ဆိုင်သော ပြဿနာများ၊ ကလေးကိုယ်အလေးချိန်မပြည့်ခြင်း
• အပြုအမူပိုင်းဆိုင်ရာ - အရက်၊ မူးယစ်ဆေး၊ ဆေးလိပ်သုံးစွဲခြင်း၊ လိင်ပိုင်းဆိုင်ရာ
အန္တရာယ် အပြုအမူများ၊ ကိုယ့်ကိုကိုယ် အန္တရာယ်ပေးခြင်း (MOHS, 2018)`}
titleNumberOfLines={200} />
        </List.Accordion>
     

    </List.Section>
         </View>
       </ScrollView>
     )
   }

   const styles = StyleSheet.create({
    body :{
      flex:1,
      backgroundColor:'#FFCCCB',
      marginBottom:10,
      marginBottom:20,
    },
  headtitle:{
    color:'#102027',
    fontSize:30,
    marginTop:10,
    
  },
  subtitle:{
    color:'#260e04',
    fontSize:18,
    textDecorationLine: 'underline',
    margin:10,
  },
  p:{
    margin:7,
    color:'#4e342e',
    fontSize:15,
    lineHeight: 26,
  },
  subp:{
    color:'#4e342e',
    fontSize:15,
    backgroundColor:'#e5b7b6',
    textDecorationLine: 'underline',
  }
    
    })