import { Pressable, StyleSheet, Text, View } from 'react-native'
import React from 'react'
import { ScrollView } from 'react-native-gesture-handler'
import { List } from 'react-native-paper'


export default function YTwo({navigation}) {
    const onPresshundler = () => {
    
    navigation.goBack()
    }
     return(
       <ScrollView  style={{backgroundColor:'#FFCCCB'}}>
         <View style={styles.body} >
         <Text style={styles.subtitle}>
         (ခ) ဆေးလိပ် ၊ အရက် ၊ မူးယစ်ဆေးဝါး ၊ ကွမ်းစားခြင်း အန္တရာယ်အကြောင်း သိကောင်းစရာများ 
         </Text>
         <Text style={styles.p}>
         {"\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0"}
         အရက်ကို လွန်ကျွံစွာနှင့် စွဲလန်းစွာသောက်သုံးခြင်းကြောင့် ဖြစ်ပွားတတ်သော ရောဂါများမှာ အသည်းရောင်ခြင်း၊ အသည်းခြောက်ခြင်း၊ သွေးအန်ခြင်း၊ အစာအိမ်ရောဂါဖြစ်ခြင်း၊ နှလုံးရောဂါဖြစ်ခြင်း၊ ဦးနှောက်နှင့် အာရုံကြောထိခိုက်ခြင်း၊ စိတ်ရောဂါများဖြစ်ခြင်း စသည်တို့ဖြစ်ပါသည်။
         </Text>
         <List.Section title="" style={styles.headtitle}>
      <List.Accordion
        title="အရက်ကြောင့်ဖြစ်သောရောဂါများ" titleNumberOfLines={20} style={{backgroundColor:"#e5b7b6"}} theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title="•	ကယောင်ကတမ်းဖြစ်ခြင်း၊ ကြောက်လန့်ခြင်း၊ အချိန်၊ နာရီ၊ နေရာ၊ လူ ခန့်မှန်းနိုင်စွမ်း မရှိခြင်း၊ ကြောက်လန့်စရာများ မြင်ရခြင်း၊ အသံဗလံများကြားရခြင်း၊ ပိုးမွှားများ ခန္ဓာကိုယ်အပေါ် ရွစိရွစိသွားသလို ခံစားရခြင်း၊ လက်တုန်ခြင်း။
•	အရက်အလွန်အကျွံ သောက်သည့်အခါတွင် လူမရှိဘဲ နားထဲတွင် ခေါ်သံများ၊ ခြိမ်းခြောက်သံများ၊ စော်ကားမော်ကားသံများ ကြားနေရတတ်ခြင်း။
•	အတတ်ရောဂါ ဖြစ်တတ်ခြင်း (ဝက်ရူးပြန်ရောဂါကဲ့သို့ တက်ခြင်း)
•	အရက်ကို ရုတ်တရက်ဖြတ်လိုက်ပါက အရက်ဖြတ် လက္ခဏာများဖြစ်ပေါ်လာခြင်း
•	စိတ်ဓာတ်ကျရောဂါ ဖြစ်တတ်ခြင်း
•	အရက်ငန်းဖမ်းခြင်း၊ အိပ်မပျော်ခြင်း
•	စိတ်ဖောက်ပြန်ခြင်း
•	ပန်းသေ/ပန်းညှိုးရောဂါဖြစ်ခြင်း
•	ဦးနှောက်ချို့ယွင်းခြင်း
•	သားသမီးမရခြင်း
•	အရက်နှင့်မတည့်သောသူများသည် အရက်အနည်းငယ်သောက်ရုံဖြင့် ရုတ်တရက် စိတ်ဖောက်ပြန်တတ်ခြင်း
•	မိမိ၏ဇနီးကို အထင်အမြင်လွဲမှားခြင်းများ ဖြစ်တတ်ခြင်း
•	အရက်ကြောင့် ရာဇဝတ်မှု ကျူးလွန်သည်အထိ ဖြစ်နိုင်ခြင်း
အထက်ပါဆိုးကျိုးများကို မခံစားရစေရန် အရက်သောက်သုံးခြင်း၊ အထူးသဖြင့် အလွန်အကျွံသောက်သုံးခြင်း၊ စွဲလမ်းစွာသောက်သုံးခြင်းတို့မှ ရှောင်ကြဉ်ရန် လိုအပ်ပါသည်။
အရက်ဖြတ်ထားသူတစ်ယောက်သည် အရက်ကိုပြန်လည်မသောက်မိစေရန် အောက်ပါတို့ကို သတိပြုဆင်ခြင် ရမည်။
•	အရက်သောက်သည့် အပေါင်းအသင်းများနှင့် မကြာခဏ တွေ့ဆုံစားသောက်ခြင်း
•	အရက်သောက်သည့် အသိုက်အဝန်းသို့ ပြန်လည်ရောက်ရှိသွားခြင်း
•	ဝေဖန်ကဲ့ရဲ့မှုကို မခံနိုင်ခြင်း
•	စိတ်ခံစားလွယ်ပြီး အတတ်အကျ မြန်လွန်းခြင်း
•	ဆုံးရှုံးခဲ့မှုများကို အမှတ်ရ ခံစားနေခြင်း
•	အိပ်ရေးပျက်ခြင်း
•	အားလပ်ချိန်၊ အချိန်ပိုများနေသော်လည်း အချိန်ကို အကျိုးရှိအောင် အသုံးမပြုတတ်ခြင်း။
အရက်စွဲရောဂါဖြစ်ပွားပါက စိတ်ကျန်းမာရေးဆေးရုံနှင့် ကုသရေးဌာနများတွင် စနစ်တကျ ကုသမှုခံယူရန် လိုအပ်ပါသည်။"
titleNumberOfLines={100} />
      </List.Accordion>

      <List.Accordion
        title="ဆေးလိပ်၊ ဆေးရွက်ကြီးအန္တရာယ်အကြောင်းသိကောင်းစရာ" titleNumberOfLines={20} style={{backgroundColor:"#e5b7b6" }}  theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`ဆေးလိပ်မီးခိုးငွေ့တွင် ပါဝင်သော ဓါတ်ပစ္စည်းများ
	ဆေးလိပ်မီးခိုးငွေ့တွင် ကင်ဆာရောဂါဖြစ်စေတတ်သော ဓါတ်ပစ္စည်း (၅၀) ကျော် အပါအဝင် ဓါတ်ပစ္စည်းပေါင်း (၄၀၀၀) ကျော် ပါဝင်သည်။

ဖြစ်ပွားစေသော ရောဂါများ \n
	ကိုယ်တိုင်ဆေးလိပ်သောက်ခြင်း၊ သူတစ်ပါး၏ ဆေးလိပ်ငွေ့ကို ရှူရှိုက်ရခြင်းနှင့် ဆေးပါသော ကွမ်းစားခြင်းတို့ကြောင့် အောက်ပါရောဂါများကို ဖြစ်ပွားစေပါသည်။
•	ခံတွင်းကင်ဆာ၊ လည်ချောင်းကင်ဆာ၊ အဆုတ်ကင်ဆာနှင့် ကင်ဆာရောဂါအမျိုးမျိုး
•	နှလုံးသွေးကြောကျဉ်း၊ သွေးကြောပိတ်ခြင်း၊ ရုတ်တရက် နှလုံးခုန်ရပ်ခြင်း
•	ဦးနှောက်သွေးကြောပိတ်၍ လေဖြတ်ခြင်း
•	အဆုတ်ပြွန်ရောင်ခြင်း (အဆုတ်ပွရောဂါ)
•	ပြင်းထန်သည့် သွေးတိုးရောဂါ
•	ခြေပုပ်လက်ပုပ်ရောဂါ (ခြေ၊ လက်ဖြတ်ပစ်ရသည်အထိ ဖြစ်တတ်ပါသည်)
•	ပန်းသေ/ပန်းညှိုးရောဂါ

	ကိုယ်ဝန်ဆောင်မိခင်များ၊ ကိုယ်တိုင်ဆေးလိပ်သောက်ခြင်း၊ သူတစ်ပါး၏ ဆေးလိပ်ငွေ့ကို ရှူရှိုက်ရခြင်းနှင့် ဆေးပါသောကွမ်းစားခြင်းတို့ကြောင့် အထက်ဖော်ပြပါရောဂါများအပြင် အောက်ပါတို့ကို ဖြစ်ပွားစေပါသည်။
•	သားပျက်သားလျှောခြင်း။ (ကိုယ်ဝန်ပျက်ခြင်း)
•	လမစေ့ ပေါင်မပြည့်သောကလေး မွေးဖွားခြင်း
ဆေးလိပ်သောက်သုံးသူ၏ ပတ်ဝန်းကျင်အတွက် အန္တရာယ်
•	ဆေးလိပ်ငွေ့ကို ရှူရှိုက်ရသော လသားကလေးများ ရုတ်တရက် သေဆုံးခြင်း၊ အဆုတ်ရောဂါဖြစ်ခြင်း။
•	ကလေးငယ်များ ရင်ကြပ်ပန်းနာဖြစ်ခြင်း၊ နားပြည်ယိုခြင်း
•	ဆေးလိပ်ငွေ့သည် သောက်သုံးသူကိုသာမက ရှူရှိုက်ရသည့် ပတ်ဝန်းကျင်ရှိ လူများကို ထိခိုက်စေပါသည်။ သို့ဖြစ်၍ အများပြည်သူနှင့် ဆိုင်သောနေရာများ၊ (ဥပမာ-ဆေးရုံ၊ ဆေးခန်း၊ စာသင်ကျောင်းများ၊ လေအေးပေးစက်တပ်ထားသော အလုံပိတ်အခန်းများ၊ ခရီးသည်တင်ယာဉ်များ စသည်) တွင် ဆေးလိပ်မသောက်သင့်ပါ။

ကျန်းမာရေးအသိရှိတိုင်း အောက်ပါတို့ကို သတိပြုလိုက်နာပါ။
•	ဆေးလိပ်၊ ဆေးရွက်ကြီးကို အစပြုလျှင် စွဲတတ်သောကြောင့် လုံးဝ အစမပြုပါနှင့်။
•	မိဘပြည်သူများက သားသမီးများနှင့် ကလေးသူငယ်များကို ဆေးလိပ်သောက်ခြင်း၊ ကွမ်းစားခြင်း၊ အစမပြုမိကြစေရန် ဝိုင်းဝန်းစောင့်ရှောက်ကြပါ။ သတိပေးကြပါ။ ကလေးငယ်များရှေ့တွင် ဆေးလိပ်သောက်ခြင်း၊ ကလေးငယ်များအား ဆေးလိပ်မီး ညှိခိုင်းခြင်း။ ဆေးလိပ်ဝယ်ခိုင်းခြင်းတို့ကို ရှောင်ကြဉ်ပါ။
•	မိမိကိုယ်တိုင်လည်း ဆေးလိပ်သောက်ခြင်း၊ ကွမ်းစားခြင်းကို ဖြတ်နိုင်ရန် ကြိုးစားပါ။
•	မိသားစုဝင်များနှင့် မိတ်ဆွေများ၊ ဆေးလိပ်သောက်ခြင်း၊ ကွမ်းစားခြင်းကို ဖြတ်နိုင်ရန်လည်း တိုက်တွန်းအားပေး ကူညီပါ။`}
titleNumberOfLines={200}/>
      </List.Accordion>

      <List.Accordion
        title="မူးယစ်ဆေးစွဲလက္ခဏာများ " titleNumberOfLines={20} style={{backgroundColor:"#e5b7b6"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`မူးယစ်ဆေးစွဲနေသူတစ်ဦးသည် မူးယစ်ဆေးဝါး မသုံးစွဲရပါက အောက်ပါလက္ခဏာများကို ခံစားရပါသည်။
\nစိတ်ပိုင်းဆိုင်ရာ လက္ခဏာများ
ဆေးသုံးလိုသည့် ဆန္ဒပြင်းထန်ခြင်း၊ စိုးရိမ်လွန်ကဲခြင်း၊ ဂနာမငြိမ်ခြင်း၊ စိတ်တိုခြင်း၊ ရန်ပြု ရန်လိုစိတ်ဖြစ်ပေါ်ခြင်းနှင့် စိတ်ဓာတ်ကျခြင်း
မူးယစ်ဆေးဝါးဆိုးကျိုးများ
စိတ်ပိုင်းဆိုင်ရာထိခိုက်မှု
•	စိတ်ကျရောဂါဖြစ်ခြင်း
•	မိမိကိုယ်ကို သေကြောင်းကြံခြင်း
•	မှတ်ဉာဏ်ချို့ယွင်းခြင်း
•	မိမိ မိသားစုနှင့် မိမိလုပ်ငန်းအပေါ်စိတ်ဝင်စားမှုနည်းလာခြင်း
•	အာရုံစူးစိုက်နိုင်မှု လျော့ပါးလာခြင်း
•	ပြင်းထန်စွာ စိုးရိမ်ကြောင့်ကြမှုဖြစ်ခြင်း
ခန္ဓာကိုယ်ပိုင်းဆိုင်ရာထိခိုက်မှု
•	AIDS ခေါ် ခုခံအားကျဆင်းမှုကူးစက်ရောဂါ ကူးစက်နိုင်ခြင်း
•	ဆေးလွန်သဖြင့် မိန်းမောစွာအိပ်ပျော်ခြင်း၊ သတိလစ်မေ့မျောသွားခြင်း၊ အခန့်မသင့်လျှင် အသက်ဆုံးရှုံးရခြင်း
•	ထုံနာကျဉ်နာ၊ အကြောသေရောဂါဖြစ်ခြင်း
•	ဝက်ရူးပြန်တတ်ခြင်း
•	နှလုံးရောဂါဖြစ်ခြင်း (ဉပမာ-နှလုံးအားနည်းရောဂါ)
•	အဆုတ်ရောင်ရောဂါဖြစ်ခြင်း (ဉပမာ-တီဘီရောဂါ)
•	ဆေးထိုးအပ်တစ်ခုတည်းကို ဝေမျှသုံးစွဲခြင်းကြောင့် အိပ်ချ်အိုင်ဗွီနှင့် အသည်းရောင် အသားဝါ (ဘီ)နှင့် (စီ) ရောဂါအပါအဝင် သွေးမှတစ်ဆင့် ကူးစက်သောရောဂါများ ဖြစ်ပေါ်ခြင်း။
•	သွေးကြောပိတ်ရောဂါဖြစ်ခြင်း
•	ခန္ဓာကိုယ်အနှံ့အပြားတွင် အနာစိမ်းများပေါက်၍ သွေးဆိပ်တက်ခြင်း
လူမှုရေးပိုင်းဆိုင်ရာထိခိုက်မှု
•	မူးယစ်ဉပဒေအရ အရေးယူခံရခြင်း
•	ပတ်ဝန်းကျင်၌ သိက္ခာကျဆင်းခြင်း
•	မိသားစုအတွင်း ဆက်ဆံရေးတွင် အဆင်မပြေခြင်း၊ မိသားစုများ စိတ်ဆင်းရဲရခြင်း
•	ရာဇဝတ်မှုမကင်းသည့် အပြုအမူများ ပြုလုပ်တတ်လာခြင်း
•	မူးယစ်ဆေးစွဲမှုသည် ပတ်ဝန်းကျင်လူမှုအသိုက်အဝန်းတွင် အလွယ်တကူ ပြန့်ပွားနိုင်သည့် အန္တရာယ်ရှိခြင်း`}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="စိတ်ကြွရူးသွပ်ဆေး (ATS)" titleNumberOfLines={20} style={{backgroundColor:"#e5b7b6"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`စိတ်ကြွရူးသွပ်ဆေးဆိုသည်မှာ အက်ဖီဒရင်း၊ ကာဖင်းစသော ဓာတုဗေဒပစ္စည်းများကို အခြေခံကာ လူတို့ဖန်တီးပြုလုပ်ထားသော ဆေးတစ်မျိုးဖြစ်ပြီး Amphetamine Type Stimulants (ATS) ခေါ် စိတ်ကြွရူးသွပ်ဆေးသည် ဗဟိုနာ့ဗ်ကြောအဖွဲ့ကို လှုံ့ဆော်သည်။ 

စိတ်ကြွရူးသွပ်ဆေး၏ အန္တရာယ်များ
လတ်တလောတွေ့ကြုံရမည့် ရုပ်ပိုင်းဆိုင်ရာ ထိခိုက်မှုများ
•	မျက်စိသူငယ်အိမ်ကျယ်ခြင်း
•	ချွေးထွက်များခြင်း
•	အစားအသောက်ပျက်ခြင်း
•	အသက်ရှုမြန်ခြင်း
•	သွေးတိုးခြင်း
•	မထင်မှတ်ဘဲ အမူအရာများ ကြမ်းတမ်းလာခြင်း
•	ကိုယ်ဝန်ဆောင်မိခင် စိတ်ကြွရူးသွပ်ဆေးသုံးစွဲပါက သန္ဓေသားအား ပျက်စီးစေခြင်း၊ အချိန်မတိုင်မီ မွေးဖွားခြင်း၊ ပေါင်မပြည့်သော ကလေးမွေးဖွားခြင်းနှင့် မွေးဖွားသောကလေးတွင် ယင်းထသော လက္ခဏာများ ဖြစ်ပေါ်စေခြင်း။

လတ်တလောကြုံတွေ့ရမည့် စိတ်ပိုင်းဆိုင်ရာထိခိုက်မှုများ
•	စကားများခြင်း
•	မိမိကိုယ်ကို အထင်ကြီးစိတ်ဝင်ခြင်း၊ ဘဝင်မြင့်ခြင်း 
•	ရုတ်တရက်ရူးသွပ်ခြင်း
•	ထင်ယောင်ထင်မှား အာရုံများဖြစ်ပေါ်လာခြင်း
•	ဂနာမငြိမ်ခြင်းနှင့် စိုးရိမ်ကြောက်လန့်စိတ်များခြင်း
•	ရန်လိုခြင်းနှင့် ဒေါသထွက်ခြင်း
ရေရှည်သုံးစွဲသူများတွင် တွေ့ရသည့် ရုပ်ပိုင်းဆိုင်ရာထိခိုက်မှုများ
•	ရှူခြင်း၊ ရှုံ့ခြင်းကြောင့် နှာခေါင်းကြွက်သားမျှင် ပျက်စီးခြင်း
•	ရှူရှိုက်ခြင်းကြောင့် အသက်ရှုလမ်းကြောင်းထိခိုက်ခြင်းနှင့် အဆုတ်ကင်ဆာ ပိုမိုဖြစ်ပွားခြင်း
•	ဆေးထိုးအပ်တစ်ခုတည်းကို ဝေမျှသုံးစွဲခြင်းကြောင့် အိပ်ချ်အိုင်ဗွီ၊ အသည်းရောင် အသားဝါ (ဘီ) နှင့် (စီ) အပါအဝင် သွေးမှတဆင့် ကူးစက်တတ်သော ဗိုင်းရပ်စ်ရောဂါပိုး အန္တရာယ် ပိုမိုများပြားစေခြင်း
•	ခံတွင်းပျက်သောကြောင့် အာဟာရချို့တဲ့ခြင်း၊ ကိုယ်ခန္ဓာပိန်းချုံးခြင်း၊ အရေပြားရောဂါဖြစ်ခြင်း
•	သွားများ ထိခိုက်ပျက်စီးခြင်း

စိတ်ကြွရူးသွပ်ဆေးကို ရေရှည်သုံးစွဲခြင်းဖြင့် အောက်ပါတို့ကို ခံစားရနိုင်ပါသည်။
•	မှတ်ဉာဏ်စွမ်းရည် ဆုံးရှုံးခြင်း
•	ရေရှည်အိပ်ရေးပျက်ခြင်းကြောင့် မှန်မှန်ကန်ကန်ဝေခွဲမဆုံးဖြတ်နိုင်ခြင်း
•	မသုံးစွဲရ မနေနိုင်အောင် အလွန်အမင်းစွဲလမ်းလာခြင်း
•	ပျော်ရွှင်မှုခံစားနိုင်စွမ်း လျော့ပါးလာခြင်း
•	စိတ်ပိုင်းဆိုင်ရာ ဝေဒနာအခံရှိသူများသုံးစွဲလျှင် စိတ်ရောဂါဝေဒနာ ပိုမိုဆိုးရွားသွားနိုင်ခြင်း
•	သံသယလွန် စိတ်ရောဂါခံစားရခြင်း
•	စိတ်ဓာတ်ကျ၍ သတ်သေချင်စိတ်ဖြစ်ခြင်း

လူမှုရေးထိခိုက်မှုများ
•	ရာဇဝတ်မှုများ ကျူးလွန်နိုင်ခြင်း

ဆေးလွန်ကဲမှုလက္ခဏာများမှာ
(၁)	သူငယ်အိမ်ကျဉ်းမြောင်းသွားခြင်း\n(၂)	စကားပြောရာတွင် မပီသတော့ခြင်း\n(၃)	လှုပ်ရှားမှုနှေးကွေးလာခြင်း\n(၄)	နှလုံးခုန်နှုန်းနှေးလာခြင်း\n(၅)	အသက်ရှုနှုန်းနှေးလာခြင်း\n(၆)	မေ့မြောခြင်း \n(၇)	အသက်ဆုံးရှုံးရခြင်း
မက်သာဒုံးအစားထိုးကုသခြင်း
	မက်သာဒုံးဆိုသည်မှာ လူတို့၏ ဓာတုဗေဒနည်းဖြင့် ဖော်စပ်ထားသော ဘိန်းအာနိသင်ရှိ ဆေးတစ်မျိုးဖြစ်ပါသည်။
  မက်သာဒုံးဆေးသည် ဆေးစွဲခြင်းကို ပျောက်ကင်းအောင်ကုသနိုင်သော ဆေးမဟုတ်ပါ။  မက်သာဒုံးဆေးသည် ဆေးစွဲမှု၏ နောက်ဆက်တွဲ အန္တရာယ်များလျော့ချရန် ရည်ရွယ်ပါသည်။ (MOHS, 2018)`}
titleNumberOfLines={200}/>
        </List.Accordion>


    </List.Section>
         </View>
       </ScrollView>
     )
   }

   const styles = StyleSheet.create({
    body :{
      flex:1,
      backgroundColor:'#FFCCCB',
      marginBottom:10,
      marginBottom:20,
    },
  headtitle:{
    color:'#102027',
    fontSize:30,
    marginTop:10,
    
  },
  subtitle:{
    color:'#260e04',
    fontSize:18,
    textDecorationLine: 'underline',
    margin:10,
  },
  p:{
    margin:7,
    color:'#4e342e',
    fontSize:15,
    lineHeight: 26,
  },
  subp:{
    color:'#4e342e',
    fontSize:15,
    backgroundColor:'#e5b7b6',
    textDecorationLine: 'underline',
  }
    
    })