import { Pressable, StyleSheet, Text, View,Dimensions,Image } from 'react-native'
import React from 'react'
import { ScrollView } from 'react-native-gesture-handler'
import { List } from 'react-native-paper'


export default function man({navigation}) {
    const onPresshundler = () => {
    
    navigation.goBack()
    }
     return(
       <ScrollView  style={{backgroundColor:'#FFDDC1'}}>
         <View style={styles.body} >
         <Text style={styles.headtitle}>
         ၁၀။ စိတ်ကျန်းမာရေး
         </Text>
         <Text style={styles.p}>
         စိတ်ကျန်းမာရေးနှင့်ပတ်သတ်သော ပြဿနာများစွာ မြန်မာနိုင်ငံတွင် အဖြစ်များပါသည်။ အဘယ်ကြောင့်ဆိုသော် မြန်မာနိုင်ငံသည် ဆယ်စုနှစ်ပေါင်းများစွာ ပြည်တွင်းစစ်ပွဲများ၊ နိုင်ငံရေးမတည်ငြိမ်မှုများကြောင့်ပင် ဖြစ်သည်။ ထိုအခြေအနေများကြောင့် စစ်ဘေးဒုက္ခသည်များ၊ ဒုက္ခသည်စခန်းများ၊ နိုင်ငံတွင်း ရွေ့ပြောင်းနေရသူများ၊ နိုင်ငံရေးအကျဥ်းသားများ၊ တရားမဝင်ရွေ့ပြောင်းလုပ်သားများ၊ နိမ့်ကျသော ကျန်းမာရေးအဆင့်အတန်းနှင့် စီးပွားရေးနိမ့်ကျမှုများ ဖြစ်ပေါ်လာတော့သည်။ 
ခန္ဓာကိုယ်ကျန်းမာရေးနှင့် မတူဘဲ စိတ်ဝေဒနာများသည် မမြင်နိုင်ဘဲ တဖြည်းဖြည်း ဖြစ်ပေါ်လာတော့သည်။ 
{"\n"}အဖြစ်များသော စိတ်ကျန်းမာရေး ပြဿနာများမှာ 
{"\n"}၁။ စိတ်ကျရောဂါ 
{"\n"}၂။ စိုးရိမ်စိတ်လွန်ရောဂါ 
{"\n"}၃။ စိတ်ဒဏ်ရာလွန် စိတ်ဖိစီးမှုရောဂါ (PTSD)
{"\n"}၄။ အရက်စွဲရောဂါ 
{"\n"}၅။ ဆေးလိပ်သောက်ခြင်း 
{"\n"}၆။ မူးယစ်ဆေးအန္တရာယ်
{"\n"}{"\n"}<Text style={styles.subp}>စိတ်ကျန်းမာခြင်း ဆိုသည်မှာ</Text>

{"\n"}ကမ္ဘာ့ကျန်းမာရေးအဖွဲ့၏ အဓိပ္ပါယ်ဖွင့်ဆိုချက်အရ လူတစ်ယောက်သည် -
{"\n"}•	စိတ်ရောဂါဝေဒနာ မခံစားရခြင်းသာမက
{"\n"}•	မိမိ၏ စွမ်းဆောင်နိုင်မှုနှင့် မိမိ၏ အားနည်းချက်များကို အမှန်အတိုင်းလက်ခံနိုင်ခြင်း။
{"\n"}•	သာမန်တွေ့ကြုံနေရသည့် စိတ်ဖိစီးမှုများကို ရင်ဆိုင်ဖြေရှင်းနိုင်ခြင်း။
{"\n"}•	မိမိနေထိုင်ရာ ပတ်ဝန်းကျင်တွင် လိုက်လျောညီထွေစွာ နေထိုင်ဆက်ဆံနိုင်ခြင်း။
{"\n"}•	မိမိတစ်ဦးတည်းအတွက်သာမက၊ မိမိနေထိုင်ရာဒေသ လူမှုအသိုင်းအဝန်းအတွက်ပါ အကျိုးဖြစ်ထွန်းစေရန် ဆောင်ရွက်နိုင်ခြင်းစသည့် အခြေအနေများနှင့် ပြည့်စုံနေပါမှ စိတ်ကျန်းမာရေးနှင့် ပြည့်စုံနေသည်ဟု ဆိုနိုင်သည်။

            
         {"\n"} {"\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0"}
         {"\n"}<Text style={styles.subp}>စိတ်ကျန်းမာရေး ချို့ယွင်းစေနိုင်သော အကြောင်းရင်းများ</Text>
         </Text>
         <Image source={require('../to/men.png')} style={styles.img}/>
         
        <Text style={styles.subtitle}>အဖြစ်များသော စိတ်ရောဂါများ</Text>
         
         <List.Accordion
        title="(က)	စိတ်ဖောက်ပြန်ရောဂါ" titleNumberOfLines={20} style={{backgroundColor:"#e5c6ad"}} theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`စိတ်ဖောက်ပြန်သည့် လက္ခဏာများ
•	ပြောဆိုသူမရှိဘဲ သူများမကြားရသောအသံများ ကြားရခြင်း၊ သူများမမြင်သောအရာများ မြင်ရခြင်း၊ အနံ့မရှိဘဲ ရတတ်ခြင်း၊ ပစ္စည်းမရှိဘဲ အတွေ့အထိခံစားရခြင်း
•	အပြုအမူများ မူမမှန်ခြင်း၊ ရုတ်တရက်ကြမ်းတမ်းခြင်း၊ ဒေါသဖြစ်ခြင်း၊ တစ်ခါတစ်ရံ  မလှုပ်မယှက်ဘဲ ကျောက်ရုပ်ကဲ့သို့ ဖြစ်နေတတ်ခြင်း
•	သာမန်အားဖြင့် နားမလည်နိုင်သော၊ လက်မခံနိုင်သော သံသယစိတ်များ လွန်ကဲနေခြင်း
•	တစ်ယောက်တည်း စကားပြောနေခြင်း၊ တစ်ယောက်တည်း ပြုံးခြင်း၊ တစ်ဦးတည်း အကြောင်းမဲ့ ခဏခဏရယ်ခြင်း
•	စကားပြောမမှန်ဘဲ အဆက်အစပ်မရှိသော စကားများပြောခြင်း။
•	တစ်ကိုယ်ရေသန့်ရှင်းမှုအားနည်းပြီး၊ ရေချိုးရန်၊ အဝတ်အစားလဲရန်၊ အလွန်ပြောဆိုရခြင်း၊ မိမိကိုယ်ကို ဂရုမစိုက်နိုင်ခြင်း
•	အတွေးအခေါ်များ၊ ချို့ယွင်းလာခြင်း၊ မဟုတ်မမှန်သော မှားယွင်းသော ယုံကြည်ချက်များရှိခြင်း၊ ရှင်းပြ၍မရခြင်း
•	နေ့စဉ် ပုံမှန်လုပ်ဆောင်နေကြအလုပ်များ မလုပ်ကိုင်နိုင်တော့ခြင်း၊ မည်သည့်အလုပ်မှမလုပ်ဘဲ အလကားနေခြင်း
•	လူ့အသိုင်းအဝန်းကို ရှောင်ကြဉ်လာခြင်း၊ လူများနှင့် မတွေ့လိုတော့ဘဲ တစ်ယောက်တည်းနေတတ်လာခြင်း`}
        titleNumberOfLines={200} />
      </List.Accordion>

      <List.Accordion
        title="(ခ)	စိတ်ကျရောဂါ" titleNumberOfLines={20} style={{backgroundColor:"#e5c6ad" }}  theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`စိတ်ကျရောဂါ လက္ခဏာများ
•	စိတ်ပျော်ရွှင်မှုမရှိခြင်း
•	စိတ်အားငယ်၍ ဝမ်းနည်းနေခြင်း၊ မျက်ရည်ကျခြင်း
•	စိတ်ရောကိုယ်ပါ ထိုင်းမှိုင်းနှေးကွေးနေခြင်း
•	ညစဉ်ရက်ဆက် အိပ်မပျော်ခြင်း၊ အထူးသဖြင့် သန်းခေါင်ကျော်လျှင် နိုးနေပြီး ပြန်အိပ်မပျော်ခြင်း
•	အစားအသောက်ပျက်ပြီး ခန္ဓာကိုယ်အလေးချိန်ကျဆင်းခြင်း
•	ဝမ်းသာစရာရှိသော်လည်း မပျော်နိုင်ခြင်း
•	အရာရာကို စိတ်ပါဝင်စားမှုမရှိခြင်း၊ အာရုံမစူးစိုက်နိုင်ခြင်း
•	ပင်ပန်းနွမ်းနယ်နေပြီး အားမရှိသကဲ့သို့ ခံစားရခြင်း
•	မိမိကိုယ်ကိုယ် အပြစ်ရှိသည်၊ ကြီးမားသောအမှားများ လုပ်ခဲ့မိသည်ဟု မှားယွင်းစွာ ယုံကြည်နေခြင်း၊ သေကြောင်းကြံစည်ရန် စိတ်ကူးများရှိနေခြင်း၊ အားထုတ်ခြင်း`}
titleNumberOfLines={200}/>
      </List.Accordion>

      <List.Accordion
        title="(ဂ)	စိတ်ကြွရောဂါ" titleNumberOfLines={20} style={{backgroundColor:"#e5c6ad"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`စိတ်ကြွရောဂါ လက္ခဏာများ
•	စိတ်ရောကိုယ်ပါ အထူးတက်ကြွနေခြင်း
•	ကရားရေလွှတ် အဆက်မပြတ်စကားပြောခြင်း
•	ဘဝင်မြင့်ခြင်း
•	အလွန်အမင်ပျော်ရွှင်နေခြင်း
•	အသုံးအဖြုန်းများခြင်း
•	အလှအပပြင်ဆင်မှုလွန်ကဲခြင်း
•	ကြမ်းတမ်းစွာပြုမူတတ်ခြင်း
•	အအိပ်နည်းခြင်း
•	အဆင်အခြင်ကင်းမဲ့ခြင်း
•	ကာမရာဂစိတ်များခြင်း`}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title=" (ဃ)	စိုးရိမ်စိတ်လွန်ရောဂါ" titleNumberOfLines={20} style={{backgroundColor:"#e5c6ad"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`	စိုးရိမ်စိတ်လွန်ရောဂါ လက္ခဏာများ
•	ခြေဖျား၊ လက်ဖျားအေးခြင်း၊ ရင်တုန်ခြင်း၊ ဇက်ထိုးခေါင်းကိုက်ဖြစ်ခြင်း၊ အကြောတတ်ခြင်း
•	စိုးရိမ်စိတ်လွန်ကဲခြင်း၊ စိတ်ပူပန်မှုများခြင်း
•	အတွေးများပြီး ညဉ့်ဦးပိုင်း အိပ်မပျော်ခြင်း
•	ပင်ပန်းနွမ်းနယ်ခြင်း
•	ဆူညံသံ မခံနိုင်ခြင်း၊ နားပူ မျက်စိရှုပ် မခံနိုင်ခြင်း
•	အာရုံစူးစိုက်မှုအားနည်းခြင်း၊ ကြာကြာအာရုံမစိုက်နိုင်ခြင်း
•	မဖြစ်သေးသောကိစ္စများကို ကြိုတင်တွေးပြီးပူပန်ခြင်း၊ စိုးရိမ်ကြောက်ရွံ့ခြင်း
•	မိမိကိုယ်ကို ရောဂါတစ်ခုခု ခံစားနေရသည်ဟု ယူဆပြီး ဆေးရုံ၊ ဆေးခန်း၊ ဆရာဝန်များထံသို့ မကြာခဏ ပြသရခြင်း`}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="စိုးရိမ်စိတ်လွန်ရောဂါလက္ခဏာများတွေ့ရှိပါက" titleNumberOfLines={20} style={{backgroundColor:"#e5c6ad"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`•	လူနာ၏အခက်အခဲများကို စိတ်ရှည်စွာ နားထောင်ပေးခြင်းဖြင့် သက်သာစေနိုင်ပါသည်။
•	ဤကဲ့သို့ လက္ခဏာများ ခံစားနေရခြင်းသည် စိုးရိမ်စိတ်များမှုကြောင့်ဖြစ်ကြောင်း စိတ်ရှည်စွာရှင်းပြပေးပါ။
•	လူနာအနေဖြင့် စိတ်ကိုဖြေလျော့ထားပါက ကိုယ်ရောစိတ်ပါ တောင့်တင်းနေမှုများ လျော့နည်းသွားနိုင်ကြောင်း ရှင်းပြပေးပါ။
•	လူနာကို ပုံမှန်လုပ်ငန်းများလုပ်ခိုင်းပါ။ မလိုအပ်ပဲ အနားမယူပါစေနှင့်။
•	ယုံကြည်ရာ ဘာသာရေးနည်းလမ်းများဖြင့်လည်း သက်သာစေနိုင်ပါသည်။`}
titleNumberOfLines={200}/>
        </List.Accordion> 

         </View>
       </ScrollView>
     )
   }

   const styles = StyleSheet.create({
    body :{
        flex:1,
        backgroundColor:'#FFDDC1',
      },
    headtitle:{
      color:'#102027',
      justifyContent:'center',
      alignItems:'center',
      alignSelf:'center',
      fontSize:20,
      marginTop:10,
      
    },
    subtitle:{
      color:'#260e04',
      fontSize:18,
      textDecorationLine: 'underline',
      margin:10,
    },
    p:{
      margin:7,
      color:'#4e342e',
      fontSize:15,
      lineHeight: 26,
    },
    subp:{
      marginTop:10,
      color:'#4e342e',
      fontSize:15,
      backgroundColor:'#e5c6ad',
      textDecorationLine: 'underline',
    },img :{
      backgroundColor:'#e5c6ad',
      width: Dimensions.get('screen').width/1,
      height: Dimensions.get('screen').height/2,
      resizeMode: 'contain'
    },
    
    })