import { Pressable, StyleSheet, Text, View } from 'react-native'
import React from 'react'
import { ScrollView } from 'react-native-gesture-handler'
import { List } from 'react-native-paper'


export default function mena({navigation}) {
    const onPresshundler = () => {
    
    navigation.goBack()
    }
     return(
       <ScrollView style={{backgroundColor:'#FFDDC1'}}>
         <View style={styles.body} >
         <Text style={styles.subtitle}>
         စိတ်ဒဏ်ရာလွန် စိတ်ဖိစီးမှုရောဂါ (PTSD)
         </Text>
         <Text style={styles.p}>
         <Text style={styles.subp}>အကျဥ်းချုပ် </Text>
         {"\n"}{"\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0"}
PTSD သည် စိတ်ပိုင်းဆိုင်ရာကျန်းမာရေးအခြေအနေဖြစ်ပြီး ကြောက်စရာကောင်းသည့် အဖြစ်အပျက်တစ်ခုကို ကိုယ်တိုင်ကြုံတွေ့ခြင်း သို့မဟုတ် မြင်တွေ့ခြင်း မျိုးမှ အစပြုခြင်းဖြစ်သည်။ ရောဂါလက္ခဏာများမှာ အမှတ်တရများ ၊ အိပ်မက်ဆိုးများ နှင့် ပြင်းထန်သော စိုးရိမ်ပူပန်မှုများ အပြင် အဖြစ်အပျက်နှင့်ပတ်သတ်၍ တွေးတောနေခြင်းကို ထိန်းချုပ်၍ မရနိုင်ခြင်းများ ပါဝင်သည်။ 
{"\n"}{"\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0"}
စိတ်ထိခိုက်ဖွယ်ရာ အဖြစ်အပျက်များကို ကြုံတွေ့ရသော လူအများစုတို့သည် ရှေးဦးစွာ ကိုယ်တွယ်ဖြေရှင်းရန် ပြင်ဆင်ရန် ခက်ခဲတတ်သော်လည်း အချိန်ကြာလာနှင့်အမျှ မိမိကိုယ်ကိုယ်ဂရုစိုက်ခြင်းဖြင့် သူတို့သည် များသောအားဖြင့် ပြန်လည် ကောင်းမွန်လာတတ်ကြသည်။ အကယ်၍ ရောဂါလက္ခဏာများပိုမိုဆိုးရွားလာပြီး လပေါင်းများစွာ သို့မဟုတ် နှစ်ပေါင်းများစွာ ကြာမြင့်လာပြီး သင်၏ နေ့စဥ်လုပ်ငန်းဆောင်တာများကို ထိခိုက်လာပါကဘသင့်တွင် PTSD ဖြစ်နိုင်ပါသည်။ 
{"\n"}{"\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0"}
PTSD သည် မြန်မာနိုင်ငံအခြေအနေတွင် တွေ့ရလေ့ရှိသည် ။ အကြောင်းမှာ မြန်မာနိုင်ငံသည် ဆယ်စုနှစ်များစွာအတွင်း ပြည်တွင်းစစ် နှင့် နိုင်ငံရေးမတည်ငြိမ်မှုများကြောင့် ပင်ဖြစ်သည်။ 
{"\n"}{"\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0"}
ထိုအခြေအနေများကြောင့် စစ်ဘေးဒုက္ခသည်များ ၊ ဒုက္ခသည်စခန်းများ ၊ ပြည်တွင်း ရွေ့ပြောင်းဒုက္ခသည်များ ၊ နိုင်ငံရေး အကျဥ်းသားများ ( အကျဥ်းထောင်များ နှင့် နေရာပေါင်းစုံတွင် လူမဆန်စွာ နှိပ်စက်ညှင်းပန်းခြင်း ) ၊ တရားမဝင် ရွေ့ပြောင်းလုပ်သားများ ဖြစ်ပေါ်လာတော့သည်။ 
{"\n"}{"\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0"}
အကယ်၍ သင့်တွင် PTSD လက္ခဏာများ သံသယဖြစ်ပါက ကျန်းမာရေးစောင့်ရှောက်သူများနှင့် တိုင်ပင်ပါ။ 
{"\n"}{"\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0"}
PTSD လက္ခဏာများသည် စိတ်ထိခိုက်ဖွယ် အဖြစ်အပျက်တစ်ခုကြုံတွေ့ပြီး တစ်လအတွင်း စတင်သည်။တစ်ခါတစ်ရံ နှစ်ပေါင်းများစွာအထိ မပေါ်ပေါက်လာတာလည်း ဖြစ်နိုင်ပါသည်။ဤလက္ခဏာများသည် သင်၏ လူမှုပတ်ဝန်းကျင် ၊ အလုပ် နှင့် ဆက်ဆံရေး တွင် သိသာထင်ရှားသော ပြဿနာများဖြစ်ပေါ်စေပါသည်။ ထို့အပြင်သင်၏ နေ့စဥ်လုပ်ငန်းဆောင်တာများကို အနှောင့်အယှက်ပေးသည်။ (Black Water Law, 2020)</Text>
         <List.Accordion
        title="PTSD လက္ခဏာများကို ယေဘုယျအားဖြင့် အမျိုးအစား လေးမျိုး ခွဲခြားသည်။ " titleNumberOfLines={20} style={{backgroundColor:"#e5c6ad"}} theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`1.မဖိတ်ခေါ်ဘဲ ရောက်လာသော အမှတ်တရများ ၊\n2.ရှောင်ရှားခြင်း ၊\n3.အတွေးများ နှင့် စိတ်နေသဘောထား ပြောင်းလဲခြင်း ၊\n4.ရုပ်ပိုင်းဆိုင်ရာ နှင့် စိတ်ပိုင်းဆိုင်ရာ တုံ့ပြန်မှုများ ပြောင်းလဲခြင်း ။\nရောဂါလက္ခဏာများသည် အချိန်နှင့်အမျှ ပြောင်းလဲနိုင်ပြီး လူတစ်ဦးနှင့်တစ်ဦးပေါ်မူတည်ပြီးလည်း မတူကွဲပြားနိုင်ပါသည်။`}
        titleNumberOfLines={200} />
      </List.Accordion>

      <List.Accordion
        title=" မဖိတ်ခေါ်ဘဲ ရောက်လာသော အမှတ်တရများ " titleNumberOfLines={20} style={{backgroundColor:"#e5c6ad" }}  theme={{colors:{primary:'#8e61ff'}}}
        >
          <List.Item title="ရောဂါလက္ခဏာများမှာ"
titleNumberOfLines={500} style={styles.subp}/>
        <List.Item title={`- စိတ်ထိခိုက်စရာအဖြစ်အပျက်များ၏ ထပ်တလဲလဲ မလိုလားသော စိတ်ပျက်စရာအမှတ်တရများ 
- စိတ်ထိခိုက်ဖွယ် အဖြစ်အပျက်ကြီး နောက်တစ်ကြိမ်ထပ်မံဖြစ်သကဲ့သို့ 
- စိတ်ထိခိုက်ဖွယ်အဖြစ်အပျက်ကြီးအကြောင်းကို စိတ်ပျက်စရာ အိပ်မက်များ သို့မဟုတ် အိပ်မက်ဆိုးများ မြင်မက်ခြင်း 
- စိတ်ထိခိုက်ဖွယ်အဖြစ်အပျက်ကြီးအကြောင်းကို ထင်ဟပ်စေမည့် ပြင်းထန်သော စိတ်ဆင်းရဲခြင်း သို့မဟုတ် ရုပ်ပိုင်းဆိုင်ရာ တုံ့ပြန်မှုများ `}
titleNumberOfLines={200}/>
      </List.Accordion>

      <List.Accordion
        title="ရှောင်ရှားခြင်း" titleNumberOfLines={20} style={{backgroundColor:"#e5c6ad"}} theme={{colors:{primary:'#8e61ff'}}} >
          <List.Item title="ရောဂါ လက္ခဏာများမှာ "
titleNumberOfLines={500} style={styles.subp}/>
        <List.Item title={`- စိတ်ထိခိုက်စရာ အဖြစ်အပျက်ကို စဥ်းစားမိခြင်း သို့မဟုတ် ပြောဆိုမိခြင်းကို ရှောင်ရှားရန် ကြိုးစားခြင်း 
- စိတ်ထိခိုက်စရာ အဖြစ်အပျက်ကို သင့်အားသတိပေးသည့် နေရာများ ၊ လှုပ်ရှားမှုများ သို့မဟုတ် လူများကို ရှောင်ရှားခြင်း `}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="အတွေးများ နှင့် စိတ်နေသဘောထား ပြောင်းလဲခြင်း " titleNumberOfLines={20} style={{backgroundColor:"#e5c6ad"}} theme={{colors:{primary:'#8e61ff'}}} >
          <List.Item title="ရောဂါလက္ခဏာများမှာ "
titleNumberOfLines={500} style={styles.subp}/>
        <List.Item title={`ရောဂါလက္ခဏာများမှာ 
- မိမိကိုယ်တိုင် ၊ အခြားသူများ နှင့် ကမ္ဘာကြီးအကြောင်း အပျက်သဘော တွေးခြင်းများ 
- အနာဂါတ်အတွက် မျှော်လင့်ချက်ကင်းမဲ့ခြင်း 
- စိတ်ထိခိုက်စရာအဖြစ်အပျက်များ၏ အရေးကြီးသော ကဏ္ဍများကို မမှတ်မိခြင်း အပါအဝင် မှတ်ဉာဏ်ပြဿနာများ 
- ရင်းနှီးသော ဆက်ဆံရေးကို ထိန်းသိမ်းထားရန် ခက်ခဲခြင်း 
- မိသားစု နှင့် သူငယ်ချင်းများနှင့် ဝေးနေသည်ဟု ခံစားမိခြင်း 
- တစ်ချိန်က သင်ပျော်မွေ့ခဲ့သော လှုပ်ရှားမှုများအပေါ် စိတ်ဝင်စားမှု မရှိတော့ခြင်း 
- အပြုသဘောဆောင်သော စိတ်ခံစားမှုမျိုး ခံစားရန် ခက်ခဲခြင်း 
- စိတ်ခံစားမှု အားနည်းခြင်း `}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="ရုပ်ပိုင်းဆိုင်ရာ နှင့် စိတ်ပိုင်းဆိုင်ရာ တုံ့ပြန်မှုများ ပြောင်းလဲခြင်း " titleNumberOfLines={20} style={{backgroundColor:"#e5c6ad"}} theme={{colors:{primary:'#8e61ff'}}} >
          <List.Item title="ရောဂါလက္ခဏာများမှာ"
titleNumberOfLines={500} style={styles.subp}/>
        <List.Item title={`- အလွယ်တကူ ကြောက်လန့်ခြင်း 
- အန္တရာယ်အတွက် အမြဲတစေ သတိထားနေခြင်း 
- မိမိကိုယ်ကိုယ်ပျက်စီးစေသော အပြုအမူများ ဖြစ်သော အရက်အလွန်အကျွံသောက်ခြင်း သို့မဟုတ် ကားမြန်မြန်မောင်းခြင်း 
- အိပ်မပျော်ခြင်း 
- အာရုံစိုက်မှု အားနည်းခြင်း 
- စိတ်တိုလွယ်ခြင်း ၊ ဒေါသပေါက်ကွဲခြင်း သို့မဟုတ် ရန်လိုနေခြင်း 
- ကြီးလေးသော အပြစ်ကျူးလွန်ခြင်း သို့မဟုတ် အရှက်ရခြင်း `}
titleNumberOfLines={200}/>
<List.Item title="အသက် ၆နှစ် နှင့် ၆နှစ်အောက်ကလေးများတွင်တွေ့ရသော ရောဂါလက္ခဏာများမှာ"
titleNumberOfLines={500} style={styles.subp}/>
        <List.Item title={`- စိတ်ထိခိုက်ဖွယ်ရာ အဖြစ်အပျက် မကြာခဏ ထပ်တလဲလဲ ခံစားမိခြင်း 
- စိတ်ထိခိုက်ဖွယ်ရာ အဖြစ်အပျက်များ၏ ကဏ္ဍများ ပါဝင် (သို့မဟုတ်) မပါဝင်ဘဲ
 ကြောက်မက်ဖွယ်ကောင်းသော အိပ်မက်များ မြင်မက်ခြင်း 
`}
titleNumberOfLines={200}/>
        </List.Accordion>
<Text style={styles.subtitle}></Text>

<List.Accordion
        title="ရောဂါလက္ခဏာများ၏ ပြင်းထန်မှု " titleNumberOfLines={20} style={{backgroundColor:"#e5c6ad"}} theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`PTSD လက္ခဏာများသည် အချိန်ပေါ်မူတည်၍ ပြင်းထန်မှုသည် ပြောင်းလဲနိုင်ပါသည်။ ယေဘုယျအားဖြင့် စိတ်ဖိစီးမှုများနေသောအခါ သို့မဟုတ် ဖြတ်သန်းသွားရင်း သတိပေးမှုများ ကြုံတွေ့ရသောအခါ PTSD လက္ခဏာများ ပိုများနိုင်ပါသည်။ `}
        titleNumberOfLines={200} />
      </List.Accordion>

      <List.Accordion
        title="ကျန်းမာရေးစောင့်ရှောက်မှုပေးသူ ၊ လူမှု ဝန်ထမ်း ၊ စိတ်ကျန်းမာရေး ဝန်ထမ်းများကို မည်သည့်အချိန်တွင် သွားရောက်တွေ့ဆုံသင့်သနည်း။ " titleNumberOfLines={20} style={{backgroundColor:"#e5c6ad" }}  theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`အကယ်၍ သင့်တွင် စိတ်ထိခိုက်ဖွယ်ရာ အဖြစ်အပျက် နှင့် ပတ်သတ်၍ တစ်လကျော်အထိ စိတ်ပျက်ဖွယ်ကောင်းသော အတွေးများ နှင့် ခံစားချက်များ ရှိနေပြီး ပိုဆိုးလာပါက သို့မဟုတ် သင်၏ဘဝကို သင်၏ထိန်းချုပ်မှုအောက် ပြန်လည်ရယူရန် ခက်ခဲနေသည်ဟု ခံစားနေရလျှင် ကျန်းမာရေးစောင့်ရှောက်မှုပေးသူ သို့မဟုတ် စိတ်ကျန်းမာရေးဝန်ထမ်း နှင့် တိုင်ပင်ပြောဆိုပါ။ 
ဖြစ်နိုင်ပါက အမြန်ဆုံးကုသမှု ခံယူခြင်းဖြင့် PTSD လက္ခဏာများ ပိုဆိုးလာခြင်းမှ ကာကွယ်နိုင်ပါသည်။ `}
titleNumberOfLines={200}/>
      </List.Accordion>

      <List.Accordion
        title="မိမိကိုယ်ကိုယ် သတ်သေချင်သော အတွေးများ ရှိပါက " titleNumberOfLines={20} style={{backgroundColor:"#e5c6ad"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`သင် သို့မဟုတ် သင်သိသော သူတစ်ဦးဦး၌ မိမိကိုယ်ကိုယ် သတ်သေရန် ကြံစည်မှုများ ရှိပါက အောက်ဖော်ပြပါ အရင်းအမြစ်များအနက်မှ တစ်ခု သို့မဟုတ် တစ်ခုထက်မက အကူအညီ ရယူပါ။ 
	အရင်းနှီးဆုံး မိတ်ဆွေ သို့မဟုတ် ချစ်ရသူ နှင့် ဆက်သွယ်ပါ။ 
	ယုံကြည်ရသော အသိုင်းအဝိုင်း မှ ဝန်ကြီးတစ်ဦး ၊ ဘာသာရေးခေါင်းဆောင် တစ်ဦး ကို ဆက်သွယ်ပါ ။ 
	ကျန်းမာရေးစောင့်ရှောက်မှုပေးသူ သို့မဟုတ် စိတ်ကျန်းမာရေး ဝန်ထမ်း သို့မဟုတ် လူမှုဝန်ထမ်း နှင့် အရေးပေါ် တိုင်ပင်ဆွေးနွေးပါ။ (Mayo Clinic, n.d.)`}
titleNumberOfLines={200}/>
        </List.Accordion>


         </View>
       </ScrollView>
     )
   }

   const styles = StyleSheet.create({
    body :{
      flex:1,
      backgroundColor:'#FFDDC1',
      marginBottom:10,
      marginBottom:20,
    },
  headtitle:{
    color:'#102027',
    fontSize:30,
    marginTop:10,
    
  },
  subtitle:{
    color:'#260e04',
    fontSize:15,
    textDecorationLine: 'underline',

  },
  p:{
    margin:7,
    color:'#4e342e',
    fontSize:15,
    lineHeight: 26,
  },
  subp:{
    color:'#4e342e',
    fontSize:15,
    backgroundColor:'#e5c6ad',
    textDecorationLine: 'underline',
  }

    
    })