import { Pressable, StyleSheet, Text, View } from 'react-native'
import React from 'react'
import { ScrollView } from 'react-native-gesture-handler'
import { List } from 'react-native-paper'


export default function menb({navigation}) {
    const onPresshundler = () => {
    
    navigation.goBack()
    }
     return(
       <ScrollView style={{backgroundColor:'#FFDDC1'}}>
         <View style={styles.body} >
         <Text style={styles.headtitle}>
         အရက်စွဲအန္တရာယ်
         </Text>
         <Text style={styles.p}>{"\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0"}
         အရက်ကို လွန်ကျွံစွာနှင့် စွဲလန်းစွာသောက်သုံးခြင်းကြောင့် ဖြစ်ပွားတတ်သော ရောဂါများမှာ အသည်းရောင်ခြင်း၊ အသည်းခြောက်ခြင်း၊ သွေးအန်ခြင်း၊ အစာအိမ်ရောဂါ ဖြစ်ခြင်း၊ နှလုံးရောဂါဖြစ်ခြင်း၊ ဦးနှောက်နှင့် အာရုံကြောထိခိုက်ခြင်း၊ စိတ်ရောဂါများဖြစ်ခြင်း စသည်တို့ဖြစ်ပါသည်။
        </Text>

        <List.Accordion
        title="အရက်စွဲခြင်း၏ လက္ခဏာများ" titleNumberOfLines={20} style={{backgroundColor:"#e5c6ad"}} theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`•	အရက်အလွန်အကျွံသောက်ခြင်း
•	အရက်မသောက်ရလျှင် ခြေလက်တုန်ခြင်း၊ ကတုန်ကယင်ဖြစ်ခြင်း
•	နံနက်ပိုင်းတွင် အရက်သောက်တတ်ခြင်း
•	အရက်မူးခဲ့ပြီး ညကအဖြစ်အပျက်များကို နောက်တစ်နေ့နံနက်တွင် လုံးဝမမှတ်မိ ခြင်း
•	သတိလစ်ခြင်း၊ တက်ခြင်း
•	အရက်ကြောင့် စိတ်ဖောက်ပြန်တတ်ခြင်း
•	အရက်ကြောင့် လှုမှုရေး၊ စီးပွားရေး၊ ကျန်းမာရေး၊ ပြဿနာများဖြစ်ပေါ်တတ်ခြင်း`}
        titleNumberOfLines={200} />
      </List.Accordion>

      <List.Accordion
        title=" အရက်ကြောင့်ဖြစ်သောရောဂါများ" titleNumberOfLines={20} style={{backgroundColor:"#e5c6ad" }}  theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`•	ကယောင်ကတမ်းဖြစ်ခြင်း၊ ကြောက်လန့်ခြင်း၊ အချိန်၊ နာရီ၊ နေရာ၊ လူ ခန့်မှန်းနိုင် စွမ်း မရှိခြင်း၊ ကြောက်လန့်စရာများ မြင်ရခြင်း၊ အသံဗလံများ၊ ကြားရခြင်း၊ ပိုးမွှား များ ခန္ဓာကိုယ် အပေါ် ရွစိရွစိသွားသလို ခံစားရခြင်း လက်တုန်ခြင်း။
•	အရက်အလွန်အကျွံ သောက်သည့်အခါတွင် လူမရှိဘဲ နားထဲတွင် ခေါ်သံများ၊ ခြိမ်းခြောက်သံများ၊ စော်ကားမော်ကားသံများ ကြားနေရတတ်ခြင်း။
•	အတတ်ရောဂါ ဖြစ်တတ်ခြင်း (ဝက်ရူးပြန်ရောဂါကဲ့သို့ တက်ခြင်း)
•	အရက်ကို ရုတ်တရက်ဖြတ်လိုက်ပါက အရက်ဖြတ် လက္ခဏာများဖြစ်ပေါ်လာခြင်း
•	စိတ်ဓာတ်ကျရောဂါ ဖြစ်တတ်ခြင်း
•	အရက်ငန်းဖမ်းခြင်း၊ အိပ်မပျော်ခြင်း
•	စိတ်ဖောက်ပြန်ခြင်း
•	ပန်းသေ/ပန်းညှိုးရောဂါဖြစ်ခြင်း
•	ဦးနှောက်ချို့ယွင်းခြင်း
•	သားသမီးမရခြင်း
•	အရက်နှင့်မတည့်သောသူများသည် အရက်အနည်းငယ်သောက်ရုံဖြင့် ရုတ်တရက် စိတ်ဖောက်ပြန်တတ်ခြင်း
•	မိမိ၏ဇနီးကို အထင်အမြင်လွဲမှားခြင်းများ ဖြစ်တတ်ခြင်း
•	အရက်ကြောင့် ရာဇဝတ်မှု ကျူးလွန်သည်အထိ ဖြစ်နိုင်ခြင်း
အထက်ပါဆိုးကျိုးများကို မခံစားရစေရန် အရက်သောက်သုံးခြင်း၊ အထူးသဖြင့် အလွန်အကျွံသောက်သုံးခြင်းစွဲလမ်းစွာသောက်သုံးခြင်းတို့မှ ရှောင်ကြဉ်ရန် လိုအပ် ပါသည်။`}
titleNumberOfLines={200}/>
      </List.Accordion>

      <List.Accordion
        title="အရက်စွဲနေသူကို ကူညီကုသခြင်း" titleNumberOfLines={20} style={{backgroundColor:"#e5c6ad"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`•	အရက်ကြောင့် ကျန်းမာရေး၊ လှုမှုရေး၊ စီးပွားရေး ထိခိုက်နိုင်ကြောင်းကို ဆွေးနွေး ပေးပါ။
•	နီးစပ်ရာ ဆေးရုံ၊ ဆေးခန်းတွင် စနစ်တကျ စစ်ဆေးကုသမှုခံယူရန် တိုက်တွန်းပါ။ ကူညီပါ။
•	အရက်သောက်ထားစဉ် အန္တရာယ်ရှိသော စက်ယန္တရားနှင့် ယာဉ်များ မမောင်းရန် အကြံပေးပါ။
•	မသောက်ရမနေနိုင် စွဲလမ်းနေသူများ၊ အရက်ကို နှစ်ရှည်လများ ဆက်တိုက်သောက် နေသူများသည် မိမိဘာသာ မည်သည့်ဆေးမျှမပါဘဲ ဖြတ်ပါက အန္တရာယ်ဖြစ်နိုင် သဖြင့် နားလည်တတ်ကျွမ်းသော ဆေးရုံ၊ ဆေးခန်းတို့တွင် ဖြတ်သင့်ပါသည်။ အရက် ဖြတ်ဆေးအား ဆရာဝန်ညွှန်ကြားမှသာ တိုက်ပါ။
အရက်ဖြတ်ထားသူတစ်ယောက်သည် အရက်ကိုပြန်လည်မသောက်မိစေရန် အောက်ပါတို့ ကို သတိပြုဆင်ခြင်ရမည်။
•	အရက်သောက်သည် အပေါင်းအသင်းများနှင့် မကြာခဏ တွေ့ဆုံစားသောက်ခြင်း
•	အရက်သောက်သည့် အသိုက်အဝန်းသို့ ပြန်လည်ရောက်ရှိသွားခြင်း
•	ဝေဖန်ကဲ့ရဲ့မှုကို မခံနိုင်ခြင်း
•	စိတ်ခံစားလွယ်ပြီး အတတ်အကျ မြန်လွန်းခြင်း
•	ဆုံးရှုံးခဲ့မှုများကို အမှတ်ရ ခံစားနေခြင်း
•	အိပ်ရေးပျက်ခြင်း
•	အားလပ်ချိန်၊ အချိန်ပိုများနေသော်လည်း အချိန်ကို အကျိုးရှိအောင် အသုံးမပြုတတ် ခြင်း။`}
titleNumberOfLines={200}/><Text style={styles.subtitle}>{"\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0"}အရက်စွဲရောဂါဖြစ်ပွားပါက စိတ်ကျန်းမာရေးဆေးရုံနှင့် ကုသရေးဌာနများတွင် စနစ်တကျ ကုသမှုခံယူရန် လိုအပ်ပါသည်။</Text>

        </List.Accordion>
         
         </View>
       </ScrollView>
     )
   }

   const styles = StyleSheet.create({
    body :{
      flex:1,
      backgroundColor:'#FFDDC1',
      marginBottom:10,
      marginBottom:20,
    },
  headtitle:{
    color:'#102027',
    fontSize:30,
    marginTop:10,
    
  },
  subtitle:{
    color:'#260e04',
    fontSize:15,
    textDecorationLine: 'underline',

  },
  p:{
    margin:7,
    color:'#4e342e',
    fontSize:15,
    lineHeight: 26,
  },
  subp:{
    color:'#4e342e',
    fontSize:15,
    backgroundColor:'#e5c6ad',
    textDecorationLine: 'underline',
  }
    
    })