import { Pressable, StyleSheet, Text, View } from 'react-native'
import React from 'react'
import { ScrollView } from 'react-native-gesture-handler'
import { List } from 'react-native-paper'


export default function menc({navigation}) {
    const onPresshundler = () => {
    
    navigation.goBack()
    }
     return(
       <ScrollView style={{backgroundColor:'#FFDDC1'}}>
         <View style={styles.body} >
         <List.Section title="ဆေးလိပ်၊ ဆေးရွက်ကြီးအန္တရာယ်အကြောင်းသိကောင်းစရာ" style={styles.headtitle}>
    
  <List.Accordion
        title="ဆေးရွက်ကြီးထွက်ပစ္စည်း အမျိုးအစား" titleNumberOfLines={20} style={{backgroundColor:"#e5c6ad"}} theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`ဆေးရွက်ကြီးထွက်ပစ္စည်းကို (၂) မျိုး ခွဲခြားနိုင်သည်။
	(က)	အငွေ့ထွက်သော ဆေးရွက်ကြီးထွက်ပစ္စည်း (စီးကရက်၊ ဆေးပြင်းလိပ်၊ ဆေးပေါ့လိပ်၊ ဆေးတံ၊ ပြောင်းဖူးဖက်လိပ်၊ ကွမ်းဖက်လိပ်၊ ရေပြောင်း၊ ပွတ် ချွန်း၊ ဘီဒီ စသည်တို့ ပါဝင်သည်။)
	(ခ)	အငွေ့မထွက်သော ဆေးရွက်ကြီးထွက်ပစ္စည်းများ (ကွမ်းထဲတွင် ဗမာဆေး၊ နှပ်ဆေး၊ ဆေးပေါင်းစသည့် ဆေးထည့်စားခြင်း၊ ဆေးရွက်ကြီးငုံ့ခြင်း စသည်တို့ ပါဝင်သည်။)`}
        titleNumberOfLines={200} />
      </List.Accordion>

      <List.Accordion
        title="ဆေးလိပ်မီးခိုးငွေ့တွင် ပါဝင်သော ဓါတ်ပစ္စည်းများ" titleNumberOfLines={20} style={{backgroundColor:"#e5c6ad" }}  theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={` 	ဆေးလိပ်မီးခိုးငွေ့တွင် ကင်ဆာရောဂါဖြစ်စေတတ်သော ဓါတ်ပစ္စည်း (၅၀) ကျော် အပါအဝင် ဓါတ်ပစ္စည်းပေါင်း (၄၀၀၀) ကျော် ပါဝင်သည်။`}
titleNumberOfLines={200}/>
      </List.Accordion>

      <List.Accordion
        title="ဆေးလိပ်ဆေးရွက်ကြီးကို အဘယ့်ကြောင့် စွဲလမ်းကြသနည်း။" titleNumberOfLines={20} style={{backgroundColor:"#e5c6ad"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`ဆေးရွက်ကြီးတွင် ပါဝင်သော နီကိုတင်းဓါတ်ကို စွဲလမ်းကြခြင်းဖြစ်ပါသည်။ နီကိုတင်း၏ စွဲလမ်းစေသော အာနိသင်ကြောင့် ဆေးပေါ့လိပ်၊ ဆေးပြင်းလိပ်၊ စီးကရက်၊ ဆေးရွက်ကြီးတို့ကို စတင်စမ်းသပ် သောက်သုံးကြည့်ရာမှ တဖြည်းဖြည်း ပို၍စွဲလမ်းလာပြီး ဆေးလိပ်မသောက်ရမနေနိုင်အောင် ကွမ်းမစား/ဆေးမငုံရမနေနိုင်အောင် ဖြစ်လာကြသည်။`}
titleNumberOfLines={200}/>
        </List.Accordion>

<List.Accordion
        title="ဖြစ်ပွားစေသော ရောဂါများ" titleNumberOfLines={20} style={{backgroundColor:"#e5c6ad" }}  theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`  	ကိုယ်တိုင်ဆေးလိပ်သောက်ခြင်း၊ သူတစ်ပါး၏ ဆေးလိပ်ငွေ့ကို ရူရှိုက်ရခြင်းနှင့် ဆေးပါသော ကွမ်းစားခြင်းတို့ကြောင့် အောက်ပါရောဂါများကို ဖြစ်ပွားစေပါသည်။
•	ခံတွင်းကင်ဆာ၊ လည်ချောင်းကင်ဆာ၊ အဆုတ်ကင်ဆာနှင့် ကင်ဆာရောဂါအမျိုးမျိုး
•	နှလုံးသွေးကြောကျဉ်း၊ သွေးကြောပိတ်ခြင်း၊ ရုတ်တရက် နှလုံးခုန်ရပ်ခြင်း
•	ဦးနှောက်သွေးကြောပိတ်၍ လေဖြတ်ခြင်း
•	အဆုတ်ပြွန်ရောင်ခြင်း (အဆုတ်ပွရောဂါ)
•	ပြင်းထန်သည့် သွေးတိုးရောဂါ
•	ခြေပုပ်လက်ပုပ်ရောဂါ (ခြေ၊ လက်ဖြတ်ပစ်ရသည်အထိ ဖြစ်တတ်ပါသည်)
•	ပန်းသေ/ပန်းညှိုးရောဂါ

	ကိုယ်ဝန်ဆောင်မိခင်များ၊ ကိုယ်တိုင်ဆေးလိပ်သောက်ခြင်း၊ သူတစ်ပါး၏ ဆေးလိပ် ငွေ့ကို ရှူရှိုက်ရခြင်းနှင့် ဆေးပါးသောကွမ်းစားခြင်းတို့ကြောင့် အထက်ဖော်ပြပါရောဂါများ အပြင် အောက်ပါတို့ကို ဖြစ်ပွားစေပါသည်။
•	သားပျက်သားလျှောခြင်း။ (ကိုယ်ဝန်ပျက်ခြင်း)
•	လမစေ့ ပေါင်မပြည့်သောကလေး မွေးဖွားခြင်း
•	မွေးရာပါ ကိုယ်အင်္ဂါချို့ယွင်းချက် ပါလာခြင်း
•	မွေးကင်းစကလေး ရုတ်တရက် သေဆုံးခြင်း
•	ကလေးအသေ မွေးဖွားခြင်း`}
titleNumberOfLines={200}/>
      </List.Accordion>

      <List.Accordion
        title="ဆေးလိပ်သောက်သုံးသူ၏ ပတ်ဝန်းကျင်အတွက် အန္တရာယ်" titleNumberOfLines={20} style={{backgroundColor:"#e5c6ad"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`•	ဆေးလိပ်ငွေ့ကို ရူရှိုက်ရသော လသာကလေးများ ရုတ်တရက် သေဆုံးခြင်း အဆုတ် ရောဂါဖြစ်ခြင်း။
•	ကလေးငယ်များ ရင်ကြပ်ပန်းနာဖြစ်ခြင်း၊ နားပြည်ယိုခြင်း
•	ဆေးလိပ်ငွေ့သည် သောက်သုံးသူကိုသာမက ရှုရှိုက်ရသည့် ပတ်ဝန်းကျင်ရှိ လူများကို ထိခိုက်စေပါသည်။ သို့ဖြစ်၍ အများပြည်သူနှင့် ဆိုင်သောနေရာများ၊ (ဉပမာ-ဆေးရုံ၊ ဆေးခန်း၊ စာသင်ကျောင်းများ၊ လေအေးပေးစက်တပ်ထားသော အလုံပိတ်အခန်းများ ခရီးသည်တင်ယာဉ်များ စသည်) တွင် ဆေးလိပ်မသောက်သင့်ပါ။`}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="ကျန်းမာရေးအသိရှိတိုင်း အောက်ပါတို့ကို သတိပြုလိုက်နာပါ။" titleNumberOfLines={20} style={{backgroundColor:"#e5c6ad"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`•	ဆေးလိပ်၊ ဆေးရွက်ကြီးကို အစပြုလျှင် စွဲတတ်သောကြောင့် လုံးဝ အစမပြုပါနှင့်။
•	မိဘပြည်သူများက သားသမီးများနှင့် ကလေးသူငယ်များကို ဆေးလိပ်သောက်ခြင်း၊ ကွမ်းစားခြင်း၊ အစမပြုမိကြစေရန် ဝိုင်းဝန်းစောင့်ရှောက်ကြပါ။ သတိပေးကြပါ။ ကလေးငယ်များရှေ့တွင် ဆေးလိပ်သောက်ခြင်း၊ ကလေးငယ်များအား ဆေးလိပ်မီး ညှိခိုင်းခြင်း။ ဆေးလိပ်ဝယ်ခိုင်းခြင်းတို့ကို ရှောင်ကြဉ်ပါ။
•	မိမိကိုယ်တိုင်လည်း ဆေးလိပ်သောက်ခြင်း၊ ကွမ်းစားခြင်းကို ဖြတ်နိုင်ရန် ကြိုးစားပါ။
•	မိမိကိုယ်တိုင်လည်း ဆေးလိပ်သောက်ခြင်း၊ ကွမ်းစားခြင်းကို ဖြတ်နိုင်ရန် ကြိုးစားပါ။
•	မိသားစုဝင်များနှင့် မိတ်ဆွေများ၊ ဆေးလိပ်သောက်ခြင်း၊ ကွမ်းစားခြင်းကို ဖြတ်နိုင် ရန်လည်း တိုက်တွန်းအားပေး ကူညီပါ။`}
titleNumberOfLines={200}/><Text style={styles.subtitle}>လိုအပ်ပါက နီးစပ်ရာ ကျန်းမာရေးဝန်ထမ်းနှင့် ဆွေးနွေး တိုင်ပင်ပါ။</Text>
        </List.Accordion>



</List.Section>

         </View>
       </ScrollView>
     )
   }

   const styles = StyleSheet.create({
    body :{
      flex:1,
      backgroundColor:'#FFDDC1',
      marginBottom:10,
      marginBottom:20,
    },
  headtitle:{
    color:'#102027',
    fontSize:30,
    marginTop:10,
    
  },
  subtitle:{
    color:'#260e04',
    fontSize:15,
    textDecorationLine: 'underline',

  },
  p:{
    margin:7,
    color:'#4e342e',
    fontSize:15,
    lineHeight: 26,
  },
  subp:{
    color:'#4e342e',
    fontSize:15,
    backgroundColor:'#e5c6ad',
    textDecorationLine: 'underline',
  }
    
    })