import { Pressable, StyleSheet, Text, View } from 'react-native'
import React from 'react'
import { ScrollView } from 'react-native-gesture-handler'
import { List } from 'react-native-paper'


export default function mend({navigation}) {
    const onPresshundler = () => {
    
    navigation.goBack()
    }
     return(
       <ScrollView style={{backgroundColor:'#FFDDC1'}}>
         <View style={styles.body} >
         <Text style={styles.subtitle}>
         မူးယစ်ဆေးစွဲလက္ခဏာများ
         </Text>
         <Text style={styles.p}>{"\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0"}
         မူးယစ်ဆေးစွဲနေသူတစ်ဦးသည် မူးယစ်ဆေးဝါး မသုံးစွဲရပါက အောက်ပါလက္ခဏာများကို ခံစားရပါသည်။
         </Text>
         
         <List.Accordion
        title="စိတ်ပိုင်းဆိုင်ရာ လက္ခဏာများ" titleNumberOfLines={20} style={{backgroundColor:"#e5c6ad"}} theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`ဆေးသုံးလိုသည့် ဆန္ဒပြင်းထန်ခြင်း၊ \nစိုးရိမ်လွန်ကဲခြင်း၊ \nဂနာမငြိမ်ခြင်း၊ \nစိတ်တိုခြင်း၊ \nရန်ပြုရန်လိုစိတ်ဖြစ်ပေါ်ခြင်းနှင့် စိတ်ဓာတ်ကျခြင်း`}
        titleNumberOfLines={200} />
      </List.Accordion>

      <List.Accordion
        title="ခန္ဓာကိုယ်ဆိုင်ရာလက္ခဏာများ" titleNumberOfLines={20} style={{backgroundColor:"#e5c6ad" }}  theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`သမ်းဝေခြင်း၊ \nနှာရည်ယိုခြင်း၊ \nကြက်သီးထခြင်း၊ \nချွေးသီးချွေးပေါက်များထွက်ခြင်း၊ \nကိုက်ခဲခြင်း၊ \nပျို့အန်/ဝမ်းလျှောခြင်း၊ \nဗိုက်အောင့်ခြင်း`}
titleNumberOfLines={200}/>
      </List.Accordion>
      <Text style={styles.subtitle}></Text>
    <List.Accordion
          title="မူးယစ်ဆေးစွဲခြင်း" titleNumberOfLines={20} style={{backgroundColor:"#e5c6ad"}} theme={{colors:{primary:'#8e61ff'}}}
          >
            <List.Item title="မူးယစ်ဆေးစွဲခြင်း၏ လက္ခဏာများ"
titleNumberOfLines={500} style={styles.subp}/> 
          <List.Item title={`•	ပတ်ဝန်းကျင်အပေါ် စိတ်ဝင်စားမှုနည်းပါးလာခြင်း
•	စိတ်လက်မအီမသာခံစားရခြင်း
•	လှုပ်ရှားသွားလာမှုများ နှေးကွေးလေးလံလာခြင်း
•	အာရုံစူးစိုက်နိုင်စွမ်း နည်းပါးလာခြင်း
•	ဆင်ခြင်တုံတရားများ လျော့ပါးလာခြင်း
•	ပေါင်းသင်းဆက်ဆံရေး၊ မိသားစုတာဝန်နှင့် အလုပ်တာဝန်များ လစ်ဟင်းလာခြင်း
•	ဆေးသုံးစွဲမှုလွန်ကဲသွားပါက သူငယ်အိမ်ကျဉ်းမြောင်းနေခြင်း၊ အသက်ရှူရခက်ခဲလာခြင်းနှင့် သတိလစ်ခြင်းဆိုသည့် လက္ခဏာစု (၃)ခု တွေ့နိုင်ပါသည်။`}
          titleNumberOfLines={200} />
          
          <List.Item title="မူးယစ်ဆေးပြတ်ခြင်း၏ လက္ခဏာများ"
titleNumberOfLines={500} style={styles.subp}/> 
          <List.Item title={`•	ပျို့အန်ခြင်း၊ ရင်တုန်ခြင်း
•	ဂနာမငြိမ်ဖြစ်ခြင်း
•	ကိုယ်၊ လက်၊ အဆစ်အမြစ်များ ကိုက်ခဲခြင်း
•	မျက်ရည်ယိုခြင်း၊ နှာရည်ယိုခြင်း၊ သမ်းခြင်း
•	ချွေးထွက်လွန်ခြင်း
•	ကြက်သီးထခြင်း
•	သူငယ်အိမ်ကျယ်နေခြင်း
•	ဝမ်းပျက်ခြင်း
•	ကိုယ်အပူချိန် တက်လိုက် ကျလိုက်ဖြစ်ခြင်း
•	ဝမ်းဗိုက်အောင့်ခြင်း`}
          titleNumberOfLines={200} />

<List.Item title="သုံးစွဲခြင်းအကြောင်းရင်းများ"
titleNumberOfLines={500} style={styles.subp}/> 
          <List.Item title={`•	စူးစမ်းလိုခြင်း၊ စမ်းသပ်လိုခြင်း
•	အပေါင်းအသင်း ဆွဲဆောင်မှုကြောင့် သုံးခြင်း
•	မူးယစ်ဆေးစွဲသူ အပေါင်းအသင်းဆန္ဒကို မလွန်ဆန်နိုင်ခြင်း၊ အထင်ကြီးအားကျမိခြင်း။
•	အသိုင်းအဝိုင်းမှ ခွဲထုတ်ရန် ခက်ခဲခြင်း
•	မူးယစ်ဆေးဝါးအကြောင်း ဗဟုသုတနည်းပါးခြင်း
•	စိတ်ပိုင်းဆိုင်ရာ၊ ရုပ်ပိုင်းဆိုင်ရာ ရောဂါတစ်ခုခုကြောင့် ဆေးဝါးအဖြစ် သုံးစွဲရာမှ ဆက်လက်သုံးစွဲမိခြင်း
•	ပင်ကိုယ်ဗီဇနှင့် ကိုယ်ရည်ကိုယ်သွေး ညံ့ဖျင်းခြင်းကြောင့် သုံးစွဲခြင်း
•	လူမှုရေးပြဿနာတစ်ခုခုကြောင့် သုံးစွဲခြင်း
•	မိသားစုအတွင်း ဆက်ဆံရေးမပြေလည်ခြင်း`}
          titleNumberOfLines={200} />
        </List.Accordion>
  
        <List.Accordion
          title="မူးယစ်ဆေးဝါးဆိုးကျိုးများ" titleNumberOfLines={20} style={{backgroundColor:"#e5c6ad" }}  theme={{colors:{primary:'#8e61ff'}}}
          >
            <List.Item title="စိတ်ပိုင်းဆိုင်ရာထိခိုက်မှု"
titleNumberOfLines={500} style={styles.subp}/> 
          <List.Item title={`•	စိတ်ကျရောဂါဖြစ်ခြင်း
•	မိမိကိုယ်ကို သေကြောင်းကြံခြင်း
•	မှတ်ဉာဏ်ချို့ယွင်းခြင်း
•	မိမိ မိသားစုနှင့် မိမိလုပ်ငန်းအပေါ်စိတ်ဝင်စားမှုနည်းလာခြင်း
•	အာရုံစူးစိုက်နိုင်မှု လျော့ပါးလာခြင်း
•	ပြင်းထန်စွာ စိုးရိမ်ကြောင့်ကြမှုဖြစ်ခြင်း`}
  titleNumberOfLines={200}/>

<List.Item title="ခန္ဓာကိုယ်ပိုင်းဆိုင်ရာထိခိုက်မှု"
titleNumberOfLines={500} style={styles.subp}/> 
          <List.Item title={`•	AIDS ခေါ် ခုခံအားကျဆင်းမှုကူးစက်ရောဂါဖြစ်ပွားနိုင်ခြင်း
•	ဆေးလွန်သဖြင့် မိန်းမောစွာအိပ်ပျော်ခြင်း၊ သတိလစ်မေ့မျောသွားခြင်း၊ အခန့်မသင့်လျှင် အသက်ဆုံးရှုံးရခြင်း
•	ထုံနာ၊ ကျဉ်နာ၊ အကြောသေရောဂါဖြစ်ခြင်း
•	ဝက်ရူးပြန်တတ်ခြင်း
•	နှလုံးရောဂါဖြစ်ခြင်း (ဉပမာ-နှလုံးအားနည်းရောဂါ)
•	အဆုတ်ရောင်ရောဂါဖြစ်ခြင်း (ဉပမာ-တီဘီရောဂါ)
•	ဆေးထိုးအပ်တစ်ခုတည်းကို ဝေမျှသုံးစွဲခြင်းကြောင့် အိပ်ချ်အိုင်ဗွီနှင့် အသည်းရောင် အသားဝါ (ဘီ)နှင့် (စီ) ရောဂါအပါအဝင် သွေးမှတဆင့် ကူးစက်သောရောဂါများ ဖြစ်ပေါ်ခြင်း။
•	သွေးကြောပိတ်ရောဂါဖြစ်ခြင်း
•	ခန္ဓာကိုယ်အနှံ့အပြားတွင် အနာစိမ်းများပေါက်၍ သွေးဆိပ်တက်ခြင်း`}
          titleNumberOfLines={200} />

<List.Item title="လူမှုရေးပိုင်းဆိုင်ရာထိခိုက်မှု"
titleNumberOfLines={500} style={styles.subp}/> 
          <List.Item title={`•	မူးယစ်ဉပဒေအရ အရေးယူခံရခြင်း
•	ပတ်ဝန်းကျင်၌ သိက္ခာကျဆင်းခြင်း
•	မိသားစုအတွင်း ဆက်ဆံရေးတွင် အဆင်မပြေခြင်း၊ မိသားစုများ စိတ်ဆင်းရဲရခြင်း
•	ရာဇဝတ်မှုမကင်းသည့် အပြုအမူများ ပြုလုပ်တတ်လာခြင်း
•	မူးယစ်ဆေးစွဲမှုသည် ပတ်ဝန်းကျင်လူမှုအသိုက်အဝန်းတွင် အလွယ်တကူ ပြန့်ပွားနိုင်သည့် အန္တရာယ်ရှိခြင်း`}
          titleNumberOfLines={200} />

<List.Item title="စိတ်ကြွရူးသွပ်ဆေး (ATS)"
titleNumberOfLines={500} style={styles.subp}/> 
          <List.Item title={`      စိတ်ကြွရူးသွပ်ဆေးဆိုသည်မှာ အက်ဖီဒရင်း၊ ကာဖင်းစသော ဓာတုဗေဒပစ္စည်းများကို အခြေခံကာ လူတို့ဖန်တီးပြုလုပ်ထားသော ဆေးတစ်မျိုးဖြစ်ပြီး Amphetamine Type Stimulants (ATS) ခေါ် စိတ်ကြွရူးသွပ်ဆေးသည် ဗဟိုနာ့ဗ်ကြောအဖွဲ့ကို လှုံ့ဆော်ခြင်းဖြစ်သည်။`}
          titleNumberOfLines={200} />

<List.Item title="ဆေးအမျိုးအမည်များ"
titleNumberOfLines={500} style={styles.subp}/> 
          <List.Item title={`အက်ဖီတမင်း (Amphetamine)
မက်အမ်ဖီတမင်း (Methamphetamine)
မီသိုင်းလ်ဖင်နီဒိတ် (Mythyiphenidate)
ဖင်မိထရာဇင်း (Phemetrazine)
အက်စ်တာစီ (Ecstasy)`}
          titleNumberOfLines={200} />
          
  <List.Item title="ယေဘုယျအခေါ်အဝေါ်များ (မက်အမ်ဖီတမင်း)"
titleNumberOfLines={500} style={styles.subp}/> 
 <List.Item title={`•	အိုက်စ် (Ice)
•	ရှဘူး (Shablu)
•	ရာဘာ (Yaba)
•	ရာမ (Yama)
•	စပိဒ် (Speed)`}
          titleNumberOfLines={200} />

<List.Item title="စိတ်ကြွရူးသွပ်ဆေးသုံးစွဲသည့် လက္ခဏာများ"
titleNumberOfLines={500} style={styles.subp}/> 
          <List.Item title={`•	မအိပ်ခြင်း၊
•	သွက်လက်နေခြင်း၊ စကားများခြင်း
•	ဂနာမငြိမ်ဖြစ်ခြင်း
•	စိုးရိမ်စိတ်များလာခြင်း။
•	စိတ်တိုခြင်း၊ ဒေါသကြီးခြင်း၊ ကြမ်းတမ်းခြင်း
•	စိတ်ဖောက်ပြန်ခြင်း`}
          titleNumberOfLines={200} />

<List.Item title="စိတ်ကြွရူးသွပ်ဆေးပြတ်သည့် လက္ခဏာများ"
titleNumberOfLines={500} style={styles.subp}/> 
          <List.Item title={`•	ခြေကုန်လက်ပန်းကျခြင်း။
•	အအိပ်အနေ အစားအသောက်မမှန်ခြင်း။
•	စိတ်ကျခြင်း။
•	မိမိကိုယ်ကို သေကြောင်းကြံစည်ခြင်း။`}
          titleNumberOfLines={200} />

        </List.Accordion>
  
        <List.Accordion
          title="စိတ်ကြွရူးသွပ်ဆေး၏ အန္တရာယ်များ" titleNumberOfLines={20} style={{backgroundColor:"#e5c6ad"}} theme={{colors:{primary:'#8e61ff'}}} >
          <List.Item title="လတ်တလောတွေ့ကြုံရမည့် ရုပ်ပိုင်းဆိုင်ရာ ထိခိုက်မှုများ"
titleNumberOfLines={500} style={styles.subp}/> 
          <List.Item title={`•	မျက်စိသူငယ်အိမ်ကျယ်ခြင်း
•	ချွေးထွက်များခြင်း
•	အစားအသောက်ပျက်ခြင်း
•	အသက်ရှုမြန်ခြင်း
•	သွေးတိုးခြင်း
•	မထင်မှတ်ဘဲ အမူအရာများ ကြမ်းတမ်းလာခြင်း
•	ကိုယ်ဝန်ဆောင်မိခင် စိတ်ကြွရူးသွပ်ဆေးသုံးစွဲပါက သန္ဓေသားအား ပျက်စီးစေခြင်း၊ အချိန်မတိုင်မီ မွေးဖွားခြင်း၊ ပေါင်မပြည့်သော ကလေးမွေးဖွားခြင်းနှင့် မွေးဖွားသောကလေးတွင် ယင်းထသော လက္ခဏာများ ဖြစ်ပေါ်စေခြင်း။`}
          titleNumberOfLines={200} />

<List.Item title="လတ်တလောကြုံတွေ့ရမည့် စိတ်ပိုင်းဆိုင်ရာ ထိခိုက်မှုများ"
titleNumberOfLines={500} style={styles.subp}/> 
          <List.Item title={`•	စကားများခြင်း
•	မိမိကိုယ်ကို အထင်ကြီးစိတ်ဝင်ခြင်း၊ ဘဝင်မြင့်ခြင်း 
•	ရုတ်တရက်ရူးသွပ်ခြင်း
•	ထင်ယောင်ထင်မှား အာရုံများဖြစ်ပေါ်လာခြင်း
•	ဂနာမငြိမ်ခြင်းနှင့် စိုးရိမ်ကြောက်လန့်စိတ်များခြင်း
•	ရန်လိုခြင်းနှင့် ဒေါသထွက်ခြင်း`}
          titleNumberOfLines={200} />
          
  <List.Item title={`ရေရှည်သုံးစွဲသူများတွင် တွေ့ရသည့် \nရုပ်ပိုင်းဆိုင်ရာထိခိုက်မှုများ`}
titleNumberOfLines={500} style={styles.subp}/> 
 <List.Item title={`•	ရှူခြင်း၊ ရှုံ့ခြင်းကြောင့် နှာခေါင်းကြွက်သားမျှင် ပျက်စီးခြင်း
•	ရှူရှိုက်ခြင်းကြောင့် အသက်ရှုလမ်းကြောင်းထိခိုက်ခြင်းနှင့် အဆုတ်ကင်ဆာ ပိုမိုဖြစ်ပွားခြင်း
•	ဆေးထိုးအပ်တစ်ခုတည်းကို ဝေမျှသုံးစွဲခြင်းကြောင့် အိပ်ချ်အိုင်ဗွီ၊ အသည်းရောင်အသားဝါ (ဘီ)နှင့် (စီ) အပါအဝင် သွေးမှတဆင့် ကူးစက်တတ်သော ဗိုင်းရပ်စ်ရောဂါပိုး အန္တရာယ် ပိုမိုများပြားစေခြင်း
•	ခံတွင်းပျက်သောကြောင့် အာဟာရချို့တဲ့ခြင်း၊ ကိုယ်ခန္ဓာပိန်းချုံးခြင်း၊ အရေပြားရောဂါဖြစ်ခြင်း
•	သွားများ ထိခိုက်ပျက်စီးခြင်း`}
          titleNumberOfLines={200} />

<List.Item title="စိတ်ကြွရူးသွပ်ဆေးကို ရေရှည်သုံးစွဲခြင်းဖြင့် အောက်ပါတို့ကို ခံစားရနိုင်ပါသည်။"
titleNumberOfLines={500} style={styles.subp}/> 
          <List.Item title={`•	မှတ်ဉာဏ်စွမ်းရည် ဆုံးရှုံးခြင်း
•	ရေရှည်အိပ်ရေးပျက်ခြင်းကြောင့် မှန်မှန်ကန်ကန်ဝေခွဲမဆုံးဖြတ်နိုင်ခြင်း
•	မသုံးစွဲရ မနေနိုင်အောင် အလွန်အမင်းစွဲလမ်းလာခြင်း
•	ပျော်ရွှင်မှုခံစားနိုင်စွမ်း လျော့ပါးလာခြင်း
•	စိတ်ပိုင်းဆိုင်ရာ ဝေဒနာအခံရှိသူများသုံးစွဲလျှင် စိတ်ရောဂါဝေဒနာ ပိုမိုဆိုးရွားသွားနိုင်ခြင်း
•	သံသယလွန် စိတ်ရောဂါခံစားရခြင်း
•	စိတ်ဓာတ်ကျ၍ သတ်သေချင်စိတ်ဖြစ်ခြင်း`}
          titleNumberOfLines={200} />

<List.Item title="လူမှုရေးထိခိုက်မှုများ"
titleNumberOfLines={500} style={styles.subp}/> 
          <List.Item title={`•	ရာဇဝတ်မှုများ ကျူးလွန်နိုင်ခြင်း`}
          titleNumberOfLines={200} />

<List.Item title="ဆေးလွန်ကဲမှုလက္ခဏာများမှာ"
titleNumberOfLines={500} style={styles.subp}/> 
          <List.Item title={`(၁)	သူငယ်အိမ်ကျဉ်းမြောင်းသွားခြင်း
(၂)	စကားပြောရာတွင် မပီသတော့ခြင်း
(၃)	လှုပ်ရှားမှုနှေးကွေးလာခြင်း
(၄)	နှလုံးခုန်နှုန်းနှေးလာခြင်း
(၅)	အသက်ရှူနှုန်းနှေးလာခြင်း
(၆)	မေ့မြောခြင်း
(၇)	အသက်ဆုံးရှုံးရခြင်း`}
          titleNumberOfLines={200} />

<List.Item title="စိတ်ကြွရူးသွပ်ဆေးသုံးစွဲသည့် လက္ခဏာများ"
titleNumberOfLines={500} style={styles.subp}/> 
          <List.Item title={`•	မအိပ်ခြင်း၊
•	သွက်လက်နေခြင်း၊ စကားများခြင်း
•	ဂနာမငြိမ်ဖြစ်ခြင်း
•	စိုးရိမ်စိတ်များလာခြင်း။
•	စိတ်တိုခြင်း၊ ဒေါသကြီးခြင်း၊ ကြမ်းတမ်းခြင်း
•	စိတ်ဖောက်ပြန်ခြင်း`}
          titleNumberOfLines={200} />

<List.Item title="စိတ်ကြွရူးသွပ်ဆေးပြတ်သည့် လက္ခဏာများ"
titleNumberOfLines={500} style={styles.subp}/> 
          <List.Item title={`•	ခြေကုန်လက်ပန်းကျခြင်း။
•	အအိပ်အနေ အစားအသောက်မမှန်ခြင်း။
•	စိတ်ကျခြင်း။
•	မိမိကိုယ်ကို သေကြောင်းကြံစည်ခြင်း။`}
          titleNumberOfLines={200} />
</List.Accordion>

          <List.Accordion
          title="မက်သာဒုံးအစားထိုးကုသခြင်း" titleNumberOfLines={20} style={{backgroundColor:"#e5c6ad"}} theme={{colors:{primary:'#8e61ff'}}} >
          <List.Item title={`        မက်သာဒုံးဆိုသည်မှာ လူတို့၏ ဓာတုဗေဒနည်းဖြင့် ဖော်စပ်ထားသော ဘိန်းအာနိသင်ရှိ ဆေးတစ်မျိုးဖြစ်ပါသည်။
          မက်သာဒုံးဆေးသည် ဆေးစွဲခြင်းကို ပျောက်ကင်းအောင်ကုသနိုင်သော ဆေးမဟုတ်ပါ။  မက်သာဒုံးဆေးသည် ဆေးစွဲမှု၏ နောက်ဆက်တွဲ အန္တရာယ်များလျော့ချရန် ရည်ရွယ်ပါသည်။`}
          titleNumberOfLines={200} />
          <List.Item title="မက်သာဒုံးဆေး၏ အာနိသင်များ"
titleNumberOfLines={500} style={styles.subp}/> 
          <List.Item title={`•	ကိုယ်လက်နာကျင်ကိုက်ခဲမှု သက်သာစေခြင်း
•	စိတ်ကို လန်းဆန်းတက်ကြွစေခြင်း
•	ချောင်းဆိုးသက်သာစေခြင်း
•	ဘိန်းနှင့်အာနိသင်တူညီခြင်းကြောင့် ဘိန်းအစားထိုးဆေးဝါးအား အသုံးပြုနေသော ဝေဒနာရှင်လူနာများ၌ ဆေးဝါးပြတ်လပ်မှုကြောင့် ပေါ်ပေါက်လာသည့် သွင်ပြင်လက္ခဏာများ ပပျောက်ခြင်းနှင့်အတူ ဆေးကိုတောင့်တနေသည့် စိတ်ဆန္ဒကိုလည်း လျော့နည်းသက်သာစေခြင်း
•	ဆေးအာနိသင် တာရှည်ခံခြင်းကြောင့် တစ်နေ့တစ်ကြိမ် အသုံးပြုရသဖြင့် အခြားအလုပ်လုပ်ရန် အချိန်ပိုရရှိစေခြင်း`}
          titleNumberOfLines={200} />

<List.Item title="ဘေးထွက်ဆိုးကျိုးများ"
titleNumberOfLines={500} style={styles.subp}/> 
          <List.Item title={`•	မူးနောက်ရီဝေခြင်း
•	ဝမ်းချုပ်ခြင်း
•	ချွေးထွက်လွန်ခြင်း
•	အာခေါင်ခြောက်ကပ်ခြင်း
•	ကာမဆန္ဒလျော့နည်းခြင်း
•	အမျိုးသမီးများ ဓမ္မတာမမှန်ခြင်း`}
          titleNumberOfLines={200} />
          
  <List.Item title="သတိပြုရန်အချက်များ"
titleNumberOfLines={500} style={styles.subp}/> 
 <List.Item title={`•	မက်သာဒုံးဆေးကို နေ့စဉ်အချိန်မှန်မှန်သောက်ပါ။
•	အချိန်အတိုင်းအတာတစ်ခုအထိ အစားထိုးကုသမှုခံယူပါ။
•	မိမိနှင့်သင့်လျော်မည့် အမှန်တကယ် လုံလောက်သော ဆေးပမာဏကို ကျွမ်းကျင်သော ဆရာဝန်နှင့် ညှိနှိုင်းတိုင်ပင်ပါ။ အရက်၊ စိတ်ငြိမ်းဆေး (ဒိုင်ယာဇီပင်) တို့နှင့် ပူးတွဲ ရောနှော သောက်သုံးပါက ဆေးလွန်ခြင်း အန္တရာယ်ရှိနိုင်ပါသည်။
•	ကလေးသူငယ်များနှင့် သက်ကြီးရွယ်အိုများ သောက်သုံးမိပါက အသက်အန္တရာယ်ရှိနိုင်သဖြင့် မိမိသောက်သုံးမည့် ဆေးအား လုံခြုံစိတ်ချစွာ သိမ်းဆည်းပါ။`}
          titleNumberOfLines={200} />
         </List.Accordion>
         </View>
       </ScrollView>
     )
   }

   const styles = StyleSheet.create({
    body :{
      flex:1,
      backgroundColor:'#FFDDC1',
      marginBottom:10,
      marginBottom:20,
    },
  headtitle:{
    color:'#102027',
    fontSize:30,
    marginTop:10,
    
  },
  subtitle:{
    color:'#260e04',
    fontSize:15,
    textDecorationLine: 'underline',

  },
  p:{
    margin:7,
    color:'#4e342e',
    fontSize:15,
    lineHeight: 26,
  },
  subp:{
    color:'#4e342e',
    fontSize:15,
    backgroundColor:'#ecd7c5',
    textDecorationLine: 'underline',
  }
    
    })