import { Pressable, StyleSheet, Text, View } from 'react-native'
import React from 'react'
import { ScrollView } from 'react-native-gesture-handler'
import { List } from 'react-native-paper'


export default function enva({navigation}) {
    const onPresshundler = () => {
    
    navigation.goBack()
    }
     return(
      <ScrollView style={{backgroundColor:'#FFFFB0'}}>
         <View style={styles.body} >
         <List.Section title="(က) သန့်ရှင်းသော သောက်သုံးရေ သုံးစွဲရေး " style={styles.headtitle}>
    
  <List.Accordion
        title="သန့်ရှင်းသောသောက်သုံးရေသည်" titleNumberOfLines={20} style={{backgroundColor:"#e5e59e"}} theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`•	အနည်၊ အမှုန်ကင်းရမည်။	\n•	အရောင်အဆင်း၊ အနံ့အရသာကင်းရမည်။
•	ကျန်းမာရေးထိခိုက်စေသော ပိုးမွှားကင်းစင်ရမည်။	\n•	ဓါတ်သတ္တုများ ပါဝင်သည့်ပမာဏထက် မပိုရ။`}
        titleNumberOfLines={200} />
      </List.Accordion>

      <List.Accordion
        title="ရောဂါပိုးပါသည့်ရေကိုသောက်သုံးမိသည့်အတွက်" titleNumberOfLines={20} style={{backgroundColor:"#e5e59e" }}  theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`	 ဝမ်းပျက်၊ ဝမ်းလျှောရောဂါ၊ ကာလဝမ်းရောဂါ၊ အူရောင်ငန်းဖျားရောဂါ၊ အသည်းရောင် အသားဝါရောဂါ၊ ပိုလီယိုရောဂါ စသည့် ဝမ်းနှင့် ပတ်သက်သည့်ရောဂါများ ဖြစ်ပွားနိုင်ပါသည်။`}
titleNumberOfLines={200}/>
      </List.Accordion>

      <List.Accordion
        title="သောက်သုံးရေကို ညစ်ညမ်းစေသော အကြောင်းရင်းများ" titleNumberOfLines={20} style={{backgroundColor:"#e5e59e"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`•	သောက်သုံးရေကန် စတင်တည်ဆောက်စဉ်က စနစ်တကျမရှိခဲ့ခြင်း
•	သောက်ရေကန်မှ ရေရယူသုံးစွဲပုံစနစ် မှန်ကန်မှုမရှိခြင်း
•	သောက်သုံးရေကန် သန့်ရှင်းမှုရှိစေရန် သတိပေးနှိုးဆော်ချက်များကို လိုက်နာ ကျင့်သုံးမှု မရှိခဲ့ခြင်း
•	သောက်သုံးရေကန် အနီးဝန်းကျင်တွင် မစင်၊ အညစ်အကြေးနှင့် စွန့်ပစ်ပစ္စည်းများ ရှိနေခြင်း
•	စနစ်တကျတည်ဆောက်ပြီးသော သောက်သုံးရေကန်များကို ရေရှည်ထိန်းသိမ်း ပြုပြင်မှုမရှိခြင်း
•	သန့်ရှင်းစနစ်ကျသော သောက်သုံးရေတွင်းဖြစ်စေရန်အတွက် ရေတွင်းတူးရန် မြေနေရာကို ရွေးချယ်ရာ၌ မှန်ကန်မှုမရှိခြင်း`}
titleNumberOfLines={200}/>
        </List.Accordion>
        <Text style={styles.subtitle}>•	အညစ်အကြေးစွန့်ပစ်သောနေရာနှင့် ပေ(၅ဝ)ဝေးကွာပြီး မြင့်သော အပိုင်းတွင်ရှိရမည်။
        {"\n"}•	ရေဝပ်ရေလျှံသောနေရာ လုံးဝ(လုံးဝ)မဖြစ်စေရ။
</Text>
</List.Section>

<List.Section title="သောက်သုံးရေကန်သန့်ရှင်းရေးလုပ်ငန်းများ" style={styles.headtitle}>
    
  <List.Accordion
        title="ရေရယူသုံးစွဲပုံစနစ်" titleNumberOfLines={20} style={{backgroundColor:"#e5e59e"}} theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`•	ရေကန်အတွင်းမှ ရေကို ရယူသုံးစွဲရန် ကန်ဘောင်ပြင်ပတွင် လက်နှိပ်တုံကင် တပ်ဆင်၍ ရေကန်အတွင်းသို့ ရေပိုက်ဆက်သွယ်ကာ ရယူသုံးစွဲနိုင်ပါသည်။
•	ရေကန်အတွင်းသို့ လူကိုယ်တိုင်ဝင်ရောက်၊ ခပ်ယူ၊ သယ်ဆောင်ခြင်း လုံးဝ မပြုလုပ်ရပါ။`}
        titleNumberOfLines={200} />
      </List.Accordion>

      <List.Accordion
        title=" ကလိုရင်းဆေးခတ်ခြင်း" titleNumberOfLines={20} style={{backgroundColor:"#e5e59e" }}  theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`     ကလိုရင်းဓါတ်ငွေ့ကို  ရေထဲသို့ ပျံ့နှံ့သွားအောင်ပြုလုပ်ခြင်းသည် ရောဂါဖြစ်စေသည့် ပိုးမွှားများအား သေကြေပျက်စီးစေနိုင်သည့် နည်းလမ်းဖြင့် ထိန်းချုပ်ခြင်းဖြစ်သောကြောင့် သောက်သုံးရန် သင့်လျော်သော ရေကောင်းရေသန့် ရရှိခံစားရန်အတွက် ဆောင်ရွက်ပေးသော ရေသန့်စင်ရေး နည်းလမ်းကောင်းတစ်ရပ်ဖြစ်သည်။
•	ရေကန်ရှိ ရေဂါလန်ပေါင်း တွက်ချက်နိုင်ရန် ရေကန်၏ အလျား၊ အနံ(အချင်း)နှင့် ရေအနက်ကို ပေဖြင့် တိုင်းတာပါ။ ရေဂါလန်ပေါင်းကို လေးထောင့်ကန်အတွက် အလျား x အနံ x ရေအနက် x ၆.၂၅ ဖြင့်လည်းကောင်း၊ အဝိုင်းကန်အတွက် ၅ x အချင်း x အချင်း x ရေအနက်ဖြင့်လည်းကောင်း တွက်ရမည်။
•	ကလိုရင်း (၂၅-၃၅) ရာခိုင်နှုန်းပါသော ဘလိချင်းပေါင်ဒါကို အသုံးပြုပါက ရေဂါလံ တစ်ထောင်လျှင် ဆေးမှုန့် အောင်စဝက်မှ တစ်အောင်စ (ဟင်းစားစတီးဇွန်း တစ်ဇွန်း မှ နှစ်ဇွန်း)နှုန်းဖြင့်လည်းကောင်း၊ ကလိုရင်း (၆၅-၇၀) ရာခိုင်နှုန်းပါသော ဘလိချင်းပေါင်ဒါကို အသုံးပြုပါက ရေဂါလံတစ်ထောင်လျှင် ဆေးမှုန့် ၄ပုံ၁ပုံ အောင်စမှ အောင်စဝက် (ဟင်းစားစတီးဇွန်း ဇွန်းဝက်မှ တစ်ဇွန်း)နှုန်းဖြင့်လည်းကောင်း ဆေးပမာဏကို တွက်ရမည်။
•	ထို့နောက် ရေပုံးတွင် လက်နှစ်လုံးခန့်လျှော့၍ ရေဖြည့်ပါ။ ခွက်ငယ်တစ်ခုတွင် လိုအပ်သော ဆေးပမာဏကို ချိန်ထည့်ပြီး ရေအနည်းငယ်ထည့်၍ မုန့်နှစ်ရည်ကဲ့သို့ ဖြစ်အောင်မွှေပါ။ ၎င်းဆေးဖျော်ရည်အား ရေဖြည့်ထားသော ရေပုံးထဲသို့ထည့်၍  သမအောင်မွှေပါ။
•	ရေပုံးကို ရေကန်ထဲသို့(၂)ပေခန့် မြုပ်အောင်နှစ်ပြီး နေရာအနှံ့ နိမ့်ချည်မြင့်ချည် ပြုလုပ်ပါ။ ရေပုံးကို ပြန်ဆွဲတင်ပြီး ရေပုံးထဲမှရေကို ရေကန်ထဲသို့ ဖြေးညှင်းစွာ လောင်းချပါ။
•	ဆေးခတ်ပြီး မိနစ်(၃ဝ) အကြာတွင် ကလိုရင်းအကြွင်းအနံ့ရှိ၊ မရှိ စမ်းသပ်ပါ။ အကယ်၍ ကလိုရင်း အကြွင်းအနံ့မရှိပါက ပထမဆေးခတ်သည့်အတိုင်း ဆေးပမာဏတစ်ဝက်ခန့်ကို ထပ်ခပ်ပါ။ ကလိုရင်းအကြွင်း/အနံ့မရှိကြောင်း သိရှိပါက ကလိုရင်းဆေးခတ်ခြင်းပြီးမြောက်၍ အသုံးပြုနိုင်ပြီဖြစ်သည်။`}
titleNumberOfLines={200}/>
      </List.Accordion>

      <List.Accordion
        title="သောက်ရေအိုးများတွင် အသင့်ဖျော်ထားသော ကလိုရင်းဆေးခတ်နည်း" titleNumberOfLines={20} style={{backgroundColor:"#e5e59e"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`	ဘလိချင်းပေါင်ဒါဆေးမှုန့် ဟင်းစားဇွန်း(၂)ဇွန်းကို ရေ တစ်လီတာဘူးနှင့် ဖျော်ပါ။ ရေတစ်ဂါလံတွင် ၎င်းဆေးဖျော်ရည်ကြည် လက်ဖက်ရည်ဇွန်း(၁)ဇွန်းနှုန်းဖြင့် သောက်ရေအိုးထဲသို့ ခတ်၍သုံးပါ။ ဆေးရည်ခတ်ပြီး အနည်းဆုံး(၃၀)မိနစ်ကြာပြီးမှ သောက်သုံးသင့်ပါသည်။`}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="ကလိုရင်းအကြွင်းအနံ့(Chlorine residual) ရှိ/မရှိ စမ်းသပ်နည်း" titleNumberOfLines={20} style={{backgroundColor:"#e5e59e"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`နည်း(၁)	အနံ့ခံနည်း - ဆေးအသုံးမပြုသော ပုံး၊ ခွက်၊ လက်ဖြင့် ရေကိုယူ၍ အနံ့ခံစမ်းသပ်ပါ။ အနံ့ရှိလျှင် အကြွင်းရှိသည်။
နည်း(၂)	ကလိုရင်းဆေးခတ်ပြီး ရေတွင် ပိုတက်စီယမ်အိုင်အိုဒိုက် နှစ်ခဲ(သို့)သုံးခဲ ထည့်မွှေ၍ ထမင်းရည် ထည့်လိုက်လျှင် မိုးပြာရောင်ပြပါက အကြွင်းရှိပါသည်။
နည်း(၃)	ခေတ်မီ ကလိုရင်းအကြွင်းအနံ့ စမ်းသပ်ကိရိယာများဖြင့်လည်း စမ်းသပ်နိုင်ပါသည်။`}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="ရေကန်ကိုသန့်ရှင်းခြင်း" titleNumberOfLines={20} style={{backgroundColor:"#e5e59e"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`•	ရေကန်အတွင်းရှိပေါင်းပင်၊ မှော်ပင်များကို ပုံမှန်ရှင်းလင်းဖယ်ရှားပါ။
•	လိုအပ်လျှင် ကန်ထဲရှိရေကိုထုတ်၍ ကန်ဆယ်ရမည်။ ဆယ်ရာတွင် အောက်ခြေမြေသားမပေါက်စေရန် သတိပြုပါ။
•	ထိုသို့ဆောင်ရွက်မှုများကို ဒေသခံများနှင့် ညှိနှိုင်းဆောင်ရွက်သင့်ပါသည်။
•	လက်နှိပ်တုံကင်မှတစ်ဆင့် ရေကန်ပြင်ပ၌ ရေကျကန်ဆောက်လုပ်၍ ရေကိုရယူသုံးစွဲပါ။`}
titleNumberOfLines={200}/>
        </List.Accordion>

<Text style={styles.subtitle}>သတိပေးဆိုင်းဘုတ်
{"\n"}{"\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0"}“ရေကန်အတွင်းသို့ ဝင်ရောက်ပြီးရေမခပ်ရ။” ဆိုင်းဘုတ်ကို လူအများမြင်သာသည့်    နေရာတွင် စိုက်ထူထားရပါမည်။
</Text>
</List.Section>
<Text style={styles.subpp}>အစားအစာသန့်ရှင်းရေး</Text>
<Text style={styles.p}>{"\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0"}ကျန်းမာရေးနှင့် ညီညွတ်သန့်ရှင်းသော အစားအသောက် ပြင်ဆင်ချက်ပြုတ်စားသောက်ခြင်းသည် ခန္ဓာကိုယ်ကို ကျန်းမာဖွံ့ဖြိုးစေသည်။ ဝမ်းနှင့်ပတ်သက်သည့် ရောဂါများ ဖြစ်ပွားခြင်းကို ကာကွယ်သည်။</Text>

<List.Accordion
        title="မစင်မှတဆင့် ရောဂါပိုးများ အစာထဲသို့ ရောက်ရှိခြင်း" titleNumberOfLines={20} style={{backgroundColor:"#e5e59e"}} theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`•	ယင်ကောင်သည် မစင်တွင် ပေါက်ပွားသည့် လောက်ကောင်မှ ဖြစ်ပေါ်လာခြင်းဖြစ်သဖြင့် မစင်တွင်ပေါက်၊ မစင်တွင်နားကာ လူများစားမည့် အစာပေါ် နားနိုင်ပါသည်။
•	အစားအစာအရသာဘယ်လောက်ကောင်းကောင်း၊ အာဟာရဘယ်လောက်ရှိရှိ ယင်နားလိုက်သည်နှင့် မစင်များပေပြီး ရောဂါပိုး ဝင်ရောက်နိုင်ပါသည်။`}
        titleNumberOfLines={200} />
      </List.Accordion>

      <List.Accordion
        title="ရေမှတဆင့် ရောဂါပိုးများ အစာထဲသို့ ရောက်ရှိခြင်း" titleNumberOfLines={20} style={{backgroundColor:"#e5e59e" }}  theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`•	ယင်လုံအိမ်သာဖြစ်သော်လည်း ရေတွင်းနှင့် ပေ(၅၀)မကွာဘဲ ဆောက်လျှင်သော်လည်းကောင်း၊ အိမ်သာသည် ရေကန်အမြင့်ပိုင်းတွင် ရှိနေသော်လည်းကောင်း၊ မစင်နှင့် ရောဂါပိုးများ ရေထဲစိမ့်ဝင်နိုင်သည့် အန္တရာယ်ရှိပါသည်။
•	မသန့်စင်သောရေများနှင့် အိုး၊ ခွက်၊ ပန်းကန်၊ ဟင်းသီးဟင်းရွက်၊ သား၊ ငါးများကို ဆေးကြောမိလျှင် ရောဂါရနိုင်ပါသည်။
•	အစားအစာသည် အရသာနှင့် အာဟာရ မည်မျှပင်ရှိစေကာမူ သုံးရေမသန့်ရှင်းပါက မစင်ထဲမှ ရောဂါပိုးများ ဝင်ရောက်လာနိုင်ပါသည်။`}
titleNumberOfLines={200}/>
      </List.Accordion>

      <List.Accordion
        title="လူမှတဆင့် ရောဂါပိုးများ အစာထဲသို့ ရောက်ရှိလာခြင်း" titleNumberOfLines={20} style={{backgroundColor:"#e5e59e"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`•	လက်ကို ဆပ်ပြာဖြင့်မဆေးဘဲ အစားအစာကိုကိုင်လျှင် အစားအစာများထဲသို့ ရောဂါပိုးများ ရောက်ရှိသွားနိုင်ပါသည်။
•	အစားအစာသည် အရသာနှင့် အာဟာရမည်မျှပင်ရှိစေကာမူ လက်ကို သန့်ရှင်းအောင် မဆေးပါက ရောဂါပိုးများ ဝင်ရောက်လာနိုင်ပါသည်။`}
titleNumberOfLines={200}/>
        </List.Accordion>

<List.Accordion
        title="အခြားနည်းလမ်းများမှတဆင့် ရောဂါပိုးများ အစာထဲသို့ ရောက်ရှိလာခြင်း" titleNumberOfLines={20} style={{backgroundColor:"#e5e59e"}} theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`•	ပိုးဟပ်၊ ပုရွက်ဆိတ်စသည့် အင်းဆက်များ၊ ကြွက်၊ ကြောင်၊ ခွေးစသည့် တိရစ္ဆာန်များမှတဆင့် ရောဂါပိုးများ သယ်ဆောင်လာနိုင်ပါသည်။
•	မသန့်ရှင်းသော ရေနှင့်လောင်းပြီး စိုက်ပျိုးထားသည့် ဟင်းသီးဟင်းရွက်များ၊ ငါးနှင့် အခြားရေသတ္တဝါများ၊ ကြက်၊ ငှက်နှင့် အသား၊ ဉများ၊ တိရစ္ဆာန်ထွက်ပစ္စည်းများတွင်လည်း ရောဂါပိုများ ကပ်နေနိုင်ပါသည်။`}
        titleNumberOfLines={200} />
      </List.Accordion>

      <List.Accordion
        title="မစင်မှရောဂါပိုးများ အစာထဲမရောက်အောင် ကာကွယ်နိုင်မည့်နည်းလမ်းများ" titleNumberOfLines={20} style={{backgroundColor:"#e5e59e" }}  theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`•	အစားအစာကို ယင်မနားအောင် ဖုံးအုပ်ထားပါ။
•	အိုး၊ ခွက်၊ ပန်းကန်များကို သုံးရေသန့်နှင့်သာ ဆေးကြောပါ။
•	လက်ကို ဆပ်ပြာဖြင့် စင်အောင်ဆေးကြောပြီးမှ အစာနှင့် အစာထည့်မည့် ပန်းကန်ခွက်ယောက်များကို ကိုင်တွယ်ပါ။
•	ဟင်းသီးဟင်းရွက်၊ သီးနှံ၊ သားငါးများကို သန့်ရှင်းသောရေနှင့် စင်ကြယ်အောင် ဆေးကြောပါ။
•	အစားအစာများကို စားခါနီးမှ ချက်ပြုတ်ပြီး ပူပူနွေးနွေးစားသုံးပါ။
•	အသား၊ ငါး၊ ဉများကို ကိုင်တွယ်ပြီးတိုင်း လက်၊ ဓါး၊ စဉ်းတီတုံးများကို သေချာစွာဆေးကြောပါ။
•	အသားစိမ်း၊ ငါးစိမ်းနှင့် ဟင်းသီးဟင်းရွက်များကို သီးခြားစီထုပ်ပိုးရမည်။ (ဖြစ်နိုင်ပါက ပလပ်စတစ်အိတ်ပျော့၊ အင်ဖက်၊ ငှက်ပျောရွက်တို့ ဖြင့် ထုပ်ပိုးသင့်ပါသည်။)`}
titleNumberOfLines={200}/>
      </List.Accordion>
  </View>
       </ScrollView>
       
     )
   }

   const styles = StyleSheet.create({
    body :{
      flex:1,
      backgroundColor:'#FFFFB0',
      marginBottom:10,
      
    },
  headtitle:{
    color:'#102027',
    fontSize:30,
    marginTop:10,
    
  },
  subtitle:{
    color:'#260e04',
    fontSize:15,
    textDecorationLine: 'underline',
    backgroundColor:'#ffffcf',
  },
  p:{
    margin:7,
    color:'#4e342e',
    fontSize:15,
    lineHeight: 26,
  },
  subp:{
    color:'#4e342e',
    fontSize:15,
    backgroundColor:'#e5e59e',
    textDecorationLine: 'underline',
  }
  ,
  subpp:{
    color:'#4e342e',
    fontSize:18,
  }
    
    })