import { Pressable, StyleSheet, Text, View } from 'react-native'
import React from 'react'
import { ScrollView } from 'react-native-gesture-handler'
import { List } from 'react-native-paper'


export default function none({navigation}) {
    const onPresshundler = () => {
    
    navigation.goBack()
    }
     return(
       <ScrollView style={{backgroundColor:'#F8FFD7'}}>
         <View style={styles.body} >
         <Text style={styles.headtitle}>
         ၈.၅	ကင်ဆာရောဂါ
         </Text>
         <Text style={styles.p}>{"\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0"}
         လူ၏ ခန္ဓာကိုယ်ရှိအသေးငယ်ဆုံး အစိတ်အပိုင်းများမှာ ဆဲလ်များဖြစ်ကြသည်။ ကင်ဆာရောဂါသည် ၎င်းအသေးငယ်ဆုံးဆဲလ်များမှ စတင်ဖြစ်သော ရောဂါတစ်မျိုးဖြစ် သည်။ ခန္ဓာကိုယ်တွင် ပုံမှန်ဆဲလ်များ၏ ကြီးထွားမှု၊ ပွားများလာမှု၊ သေဆုံးမှုများကို အစီအစဉ်တကျ ဖြစ်အောင်စနစ်တစ်ခုဖြင့် ထိန်းချုပ်ထားသည်။ သို့သော်လည်း အကြောင်း အမျိုးမျိုးကြောင့် မူမမှန်သောဆဲလ်များ ထိန်းချုပ်မျုကင်းမဲ့စွာ ပွားများလာခြင်းဖြင့် ကင်ဆာ ရောဂါဖြစ်လာသည်။
         {"\n"}{"\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0"}
  ခန္ဓာကိုယ်မည်သည့်နေရာတွင်မဆို ကင်ဆာဖြစ်နိုင်ပါသည်။ ကင်ဆာရောဂါသည် မကူးစက်နိုင်ပါ။
  </Text>
         
  <List.Accordion
        title="ကင်ဆာအကျိတ်" titleNumberOfLines={20} style={{backgroundColor:"#dfe5c1"}} theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`ခန္ဓာကိုယ်တွင် ကင်ဆာအကျိတ် နှစ်မျိုးဖြစ်ပေါ်နိုင်သည်။
	၁။	ပြန်ရည်ကျိတ်များတွင် စတင်ဖြစ်သော ကင်ဆာရောဂါကြောင့်ဖြစ်သော အကျိတ်
	၂။	ခန္ဓာကိုယ်တစ်နေရာရာတွင်ဖြစ်သော ကင်ဆာရောဂါမှလာသော အကျိတ်
	ယင်းနှစ်မျိုးကို ခွဲခြားသိနိုင်ရန် ၎င်းအကျိတ်မှ အသားစ စစ်ဆေးခြင်းဖြင့် သိနိုင်ပါ သည်။`}
        titleNumberOfLines={200} />
      </List.Accordion>

      <List.Accordion
        title="ကင်ဆာပြန့်ပွားခြင်း" titleNumberOfLines={20} style={{backgroundColor:"#dfe5c1" }}  theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`	ကင်ဆာဆဲလ်များ ကြီးထွားလာသောအခါ အနီးအနားရှိ ကိုယ်ခန္ဓာအစိတ်အပိုင်းများ သို့ တိုက်ရိုက်ပြန့်ပွားနိုင်သည်။ ထို့အပြင် ပြန်ရည်ကြောများမှတဆင့် တစ်ကိုယ်လုံးရှိ ပြန်ရည်ကျိတ်များသို့ ပျံ့နှံ့နိုင်သည်။
သွေးကြောများမှတစ်ဆင့် ကျောက်ကပ်၊ အသည်း၊ အဆုတ်၊ ဦးနှောက်၊ အရိုး စသည့် အင်္ဂါအစိတ်အပိုင်းများသို့ ပျံ့နှံ့နိုင်ပါသည်။`}
titleNumberOfLines={200}/>
      </List.Accordion>

      <List.Accordion
        title="ကင်ဆာဖြစ်နိုင်သည့် ယေဘုယျအကြောင်းရင်းများ" titleNumberOfLines={20} style={{backgroundColor:"#dfe5c1"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`•	မျိုးရိုးဗီဇ
•	ဆေးလိပ်သောက်ခြင်း၊ ဆေးရွက်ကြီးငုံခြင်း၊ ကွမ်းစားခြင်း
•	အရက်သောက်ခြင်း
•	ကူးစက်ရောဂါပိုးများ (ဉပမာ-အသည်းရောင်အသားဝါ ဘီပိုး၊ စီပိုးနှင့် လိင်အင်္ဂါဗိုင်း ရပ်စ်ပိုး)
•	အစားအသောက်များ (ဉပမာ-ကြာရှည်ခံအောင် ပြုပြင်ထားသော အစားအစာများ၊ မုန့်ပဲသရေစာများ၊ ကျပ်တင်ထားသော အစာများ၊ ယမ်းစိမ်းဖြင့် ပြုပြင်ထားသော အစာများ၊ မှိုတက်နေသော အစာများ၊ အချဉ်သနပ်များ၊ အရောင်အဆင်းလှပအောင် ဆိုးဆေးအမျိုးမျိုးဖြင့် ပြုလုပ်ထားသော အသီးအနှံနှင့် အသားငါးများ)
•	လုပ်ငန်းခွင် ဓာတုဗေဒပစ္စည်းများ၊ စွန့်ပစ်ပစ္စည်းများ၊ ဆိုးဆေးများ၊ လယ်ယာစိုက်ပျိုးရေးလုပ်ငန်းသုံး ပိုးသတ်ဆေးများနှင့် ကြာရှည်စွာထိတွေ့ခြင်း
•	အချို့ဆေးဝါးများ (ဉပမာ-ဟော်မုန်းဆေးများ) ကြာရှည်စွာသုံးစွဲခြင်း
•	အသက်ငယ်စဉ် လိင်ဆက်ဆံမှုပြုခြင်း၊ လိင်ဆက်ဆံဖက်များခြင်း၊ လိင်အင်္ဂါကြွက်နို့ ပေါက်ခြင်း
•	ခရမ်းလွန်ရောင်ခြည်၊ ဓာတ်ရောင်ခြည်များနှင့် ထိတွေ့မှုရှိခြင်း`}
titleNumberOfLines={200}/>
        </List.Accordion>

        <List.Accordion
        title="ကာကွယ်နိုင်မည့် နည်းလမ်းများ" titleNumberOfLines={20} style={{backgroundColor:"#dfe5c1"}} theme={{colors:{primary:'#8e61ff'}}} >
        <List.Item title={`•	အများစုကို ကာကွယ်နိုင်ပါသည်။ ကင်ဆာရောဂါကို ဖြစ်ပွားနိုင်သည့်အချက်များကို လေ့လာ ရှောင်ရှား၍ ကျန်းမာရေးနှင့်ညီညွတ်သော လူနေမှုပုံစံကို ကျင့်သုံးခြင်းဖြင့် ကာကွယ်နိုင်ပါ သည်။
	ဉပမာ	-	ဆေးလိပ်၊ ဆေးရွက်ကြီး သောက်သုံးခြင်းကို ရှောင်ကြဉ်ခြင်းဖြင့် အဆုတ်ကင်ဆာ ရောဂါ၊ ခံတွင်းကင်ဆာရောဂါ၊ အသံအိုးကင်ဆာ ရောဂါ၊ စသည်တို့ကို ကာကွယ်နိုင်ပါသည်။
•	အချို့ကင်ဆာရောဂါများသည် ကာကွယ်ဆေးထိုး၍ ကာကွယ်နိုင်ပါသည်။
	ဉပမာ	-	အသည်းရောင်အသားဝါ ဘီကာကွယ်ဆေးထိုးခြင်းဖြင့် အသည်း ကင်ဆာကို ကာကွယ်နိုင်ပါသည်။ သားအိမ်ခေါင်းကင်ဆာ ကာကွယ်ဆေးထိုးခြင်းဖြင့် သားအိမ်ခေါင်း ကင်ဆာကို ကာကွယ် နိုင်ပါသည်။
ကင်ဆာရောဂါဖြစ်စေနိုင်သော အကြောင်းရင်းများကို ရှောင်ကြဉ်ခြင်းသည် ကင်ဆာရောဂါ ကို ကာကွယ်ခြင်းဖြစ်ပါသည်။
•	ဆေးလိပ်၊ ဆေးရွက်ကြီး၊ အရက်၊ ကွမ်းစားခြင်းမှ ရှောင်ကြဉ်ခြင်း
•	ကိုယ်လက်လှုပ်ရှားမှုများ ပုံမှန်ပြုလုပ်ခြင်း၊ အဝလွန်ခြင်းမှ ရှောင်ကြဉ်ခြင်း
•	တာရှည်ခံအောင် ပြုပြင်ထားသော အစားအစာများ၊ မုန့်ပဲသရေစာများ၊ ကျပ်တင် ထားသောအစာများ၊ ယမ်းစိမ်းဖြင့် ပြုပြင်ထားသောအစာများနှင့် အချဉ်၊ သနပ်များ၊ (အရောင်အဆင်းလှပအောင် ဆိုးဆေးအမျိုးမျိုးဖြင့် ပြုလုပ်ထားသော အသီးအနှံနှင့် အသား/ငါးများ) အလွန်အကျွံ စားသုံးခြင်းမှ ရှောင်ကြဉ်ခြင်း
•	ကျန်းမာရေးနှင့်ညီညွတ်သော အစားအစာများ စားသုံးခြင်း
•	ပြင်းထန်သော နေရောင်ခြည်ကို ကြာရှည်စွာထိတွေ့ခြင်းမှ ရှောင်ကြဉ်ခြင်း
•	တစ်လင်တစ်မယားစနစ်ကျင့်သုံးခြင်း
•	လုပ်ငန်းခွင် ဓာတုဗေဒပစ္စည်များ၊ ဆိုးဆေးများ၊ လယ်ယာစိုက်ပျိုးရေးသုံး ပိုးသတ် ဆေးပစ္စည်းများ ကိုင်တွယ်ရာတွင် လက်အိတ်၊ နှာခေါင်းစည်းနှင့် မျက်လုံးအကာ အကွယ်များ အသုံးပြုခြင်း`}
titleNumberOfLines={200}/><Text style={styles.subtitle}>ကျန်းမာရေးစစ်ဆေးမှု ပုံမှန်ပြုလုပ်ပါ။ ကင်ဆာရောဂါလက္ခဏာများကို တွေ့ရှိပါက နီးစပ်ရာ ကျန်းမာရေးဝန်ထမ်းများနှင့် တိုင်ပင်ဆွေးနွေးပါ။</Text>
        </List.Accordion>

        <List.Accordion
        title="ကင်ဆာရောဂါဖြစ်ပွားနိုင်သည်ဟု ယူဆရသော လက္ခဏာများ" titleNumberOfLines={20} style={{backgroundColor:"#dfe5c1"}} theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`•	အချိန်အခါမဟုတ်ဘဲ သွေးဆင်းခြင်း၊ အဖြူဆင်းခြင်း
•	လည်ပင်း၊ ချိုင်း၊ သားမြတ်၊ ပေါင်းရင်း စသည်တို့တွင် အလုံးအကျိတ်အခဲတွေ့ရှိခြင်း
•	ပျောက်သင့်သည့်အချိန်ကျော်၍ မပျောက်သောအနာများ
•	ဝမ်း/ဆီးသွားသည့် အလေ့အထပြောင်းလဲလာခြင်း
•	ကြာရှည်စွာအသံဝင်ခြင်း၊ အမြဲမပြတ်ချောင်းဆိုးလာခြင်း
•	အစာမျိုရခက်ခဲခြင်း၊ အစာမကြေသလို၊ မစားချင်သလို မကြာခဏဖြစ်ပေါ်လာခြင်း
•	ကိုယ်ပေါ်ရှိ မှဲ့ (သို့မဟုတ်) ကြွက်နို့၊ မွေးရာပါအမှတ်များ၊ ကြီးထွားလာခြင်း၊ သွေးထွက်ခြင်း၊ အရောင်ပြောင်းခြင်း
အမှတ်။ ။ ဤလက္ခဏာများ တွေ့ရှိတိုင်းလည်း ကင်ဆာရောဂါဖြစ်ပွားပြီဟု မဆိုနိုင်သေးပါ။ သက်ဆိုင်ရာဆရာဝန်နှင့် တိုင်ပင်ပြသပြီး လိုအပ်သည်များကို ဆက်လက်စစ်ဆေးရန် လိုအပ် ပါသည်။`}
        titleNumberOfLines={200} />
      </List.Accordion>

      <List.Accordion
        title="ကင်ဆာရောဂါကို ကုသခြင်း" titleNumberOfLines={20} style={{backgroundColor:"#dfe5c1" }}  theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title={`•	အချို့ကင်ဆာရောဂါများကို စောစီးစွာသိရှိ၍ အချိန်မီထိရောက်စွာ ကုသမှုခံယူပါက ပျောက် ကင်းနိုင်ပါသည်။ 
•	ရောဂါအဆင့်လွန်မှ ကုသလျှင် ပျောက်ကင်းရန်မလွယ်ပါ.
•	ဆေးမြီးတိုများနှင့် မကုသသင့်ပါ။`}
titleNumberOfLines={200}/>
      </List.Accordion>
      <Text style={styles.subtitle}></Text>
{/*    1.1    */}

      <List.Accordion
        title="၈.၅.၁	သားအိမ်ခေါင်းကင်ဆာရောဂါ" titleNumberOfLines={20} style={{backgroundColor:"#dfe5c1" }} 
 theme={{colors:{primary:'#8e61ff'}}}
        >
          <List.Item title={`     သားအိမ်ခေါင်းကင်ဆာရောဂါသည် ကာကွယ်နိုင်သောရောဂါဖြစ်သည်။ သားအိမ်ခေါင်းဝ အရည်ကြည်ကို စစ်ဆေး၍ စောစီးစွာသိလျှင် လုံးဝပျောက်ကင်းအောင် ကုသနိုင်သောရောဂါဖြစ်သည်။ အသက် (၃၅) နှစ်အထက် အိမ်ထောင်ရှိသူ အမျိုးသမီးတိုင်း ယင်းစစ်ဆေးမှုကို ပြုလုပ်သင့်ပါသည်။`}
titleNumberOfLines={500} />

        <List.Item title="သားအိမ်ခေါင်းကင်ဆာဖြစ်စေနိုင်သည့် အကြောင်းအရာများ"
titleNumberOfLines={500} style={styles.subp}/>
<List.Item title={`•	အသက်ငယ်ရွယ်စဉ် လိင်ဆက်ဆံမှုပြုဖူးသူ အမျိုးသမီးများ
•	လိင်ဆက်ဆံဖက်များသူများ
•	လိင်နှင့်ပတ်သက်သော ရောဂါများရှိသည့် ယောကျ်ားနှင့် လိင်ဆက်ဆံသူ
•	သန္ဓေတားဆေးများ ကြာရှည်စွာသောက်သုံးသူများ
•	သားသမီးများများ မွေးဖူးသူများ
•	ဆေးလိပ်သောက်သော အမျိုးသမီးများ
•	မိန်းမကိုယ်နှင့် သားအိမ်ခေါင်းတွင် ကြွက်နို့များပေါက်ခြင်း၊ ရေယုန်ပေါက်ခြင်း`}
titleNumberOfLines={500} />

<List.Item title="ရောဂါလက္ခဏာများ"
titleNumberOfLines={500} style={styles.subp}/>
<List.Item title={`•	အဖြူဆင်းခြင်း
•	ပုံမှန်မဟုတ်ဘဲ သွေးဆင်းခြင်း
•	ဆီးစပ်နှင့် ခါးနာကျင်ကိုက်ခဲခြင်း
•	လိင်ဆက်ဆံမှုပြုပြီးပါက သွေးဆင်းခြင်း၊ နာကျင်ခြင်း
•	ဆီးသွားခြင်းနှင့် ပတ်သက်၍ အခက်အခဲဖြစ်ခြင်း (ဆီးထဲသွေးပါခြင်း၊ ဆီးသွားရခက် ခဲခြင်း)`}
titleNumberOfLines={500} />

<List.Item title="ကာကွယ်နိုင်မည့် နည်းလမ်းများ"
titleNumberOfLines={500} style={styles.subp}/>
<List.Item title={`•	အသက်ငယ်ရွယ်စဉ် လိင်ဆက်ဆံမှုမပြုရန်
•	တစ်ကိုယ်ရည်သန့်ရှင်းရေး အထူးသဖြင့် မိန်းမကိုယ်နှင့် သားအိမ်ခေါင်း သန့်ရှင်းရေး ဂရုပြုရန်
•	လိင်ဆက်ဆံဖက်မများရန်
•	ဆေးလိပ်မသောက်ရန်
•	စားသုံးသော အစားအစာတွင် ဗီတာမင်အေ၊ ဗီတာမင်စီနှင့် အခြားဗီတာမင် ချို့တဲ့မှု မရှိအောင် စားသုံးရန် `}
titleNumberOfLines={500} /><Text style={styles.subtitle}>ရောဂါရှိ၊ မရှိ ကြိုတင်စမ်းသပ်ခြင်း {"\n"}
{"\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0"}သားအိမ်ခေါင်းကင်ဆာဖြစ်ရန် နှစ်ပေါင်းများစွာ ကြာမြင့်ပါသည်။
အသက် (၂၀) နှစ်နှင့် အသက် (၆၀)နှစ်အကြား လိင်ဆက်ဆံမှုရှိသူတိုင်း တစ်နှစ် တစ်ကြိမ် (၃) နှစ်ဆက်တိုက် စစ်ဆေး၍ ရောဂါမရှိပါက နောက်ပိုင်း (၃)နှစ် တစ်ကြိမ် စမ်းသပ်ရန်လို ပါသည်။</Text>

      </List.Accordion>
      <Text style={styles.subtitle}></Text>
{/* 1.2 */}
      <List.Accordion
        title="၈.၅.၂	ခံတွင်းကင်ဆာရောဂါ" titleNumberOfLines={20} style={{backgroundColor:"#dfe5c1" }} 
 theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title="ခံတွင်းတွင်ဖြစ်တတ်သောကင်ဆာများ"
titleNumberOfLines={500} style={styles.subp}/>
<List.Item title={`•	လျှာကင်ဆာ
•	လျှာအောက်ကင်ဆာ
•	နှုတ်ခမ်းကင်ဆာ
•	ပါးစောင်ကင်ဆာ
•	သွားဖုံးကင်ဆာ
•	အာသီးကင်ဆာ
•	အာခေါင်ကင်ဆာ`}
titleNumberOfLines={500} />

<List.Item title="ခံတွင်းကင်ဆာဖြစ်စေနိုင်သော အကြောင်းအရာများ"
titleNumberOfLines={500} style={styles.subp}/>
<List.Item title={`•	ဆေးလိပ်သောက်ခြင်း
•	ကွမ်းစားခြင်း
•	ကွမ်းနှင့်ဆေးရွက်ကြီးငုံခြင်း
•	အရက်သောက်ခြင်း
•	ချွန်ထက်သောသွားများဖြင့် အစဉ်အမြဲ ထိခိုက်နေခြင်း
•	ခံတွင်းသန့်ရှင်းမှု မရှိခြင်း
•	ဗီတာမင်အေနှင့် ချို.တဲ့ခြင်း`}
titleNumberOfLines={500} />

<List.Item title="ခံတွင်းကင်ဆာရောဂါ လက္ခဏာများ"
titleNumberOfLines={500} style={styles.subp}/>
<List.Item title={`•	ပါးစပ်တွင် ကျက်ရန်ခက်ခဲသောအနာဖြစ်ခြင်း
•	လျှာ၊ သွားဖုံး၊ ပါးစောင်း၊ လည်ချောင်း ကြာရှည်စွာနာနေခြင်း။
•	လျှာ၊ ပါးရောင်ခြင်း
•	နားကိုက်ခြင်း
•	လည်ပင်းတွင် အကျိတ်စမ်းမိခြင်း
•	ပါးစပ်မဟနိုင်ခြင်း
•	အစာမျိုရန်ခက်ခဲခြင်း`}
titleNumberOfLines={500} />

<List.Item title="ကာကွယ်နိုင်မည့် နည်းလမ်းများ"
titleNumberOfLines={500} style={styles.subp}/>
<List.Item title={`•	ဆေးလိပ်မသောက်ရန်
•	ကွမ်းမစားရန်
•	ဆေးမငုံရန်
•	အရက်မသောက်ရန်
•	သွားနှင့်ခံတွင်း သန့်ရှင်းရေး ဂရုစိုက်ရန်`}
titleNumberOfLines={500} />
</List.Accordion>
<Text style={styles.subtitle}></Text>
{/* 1.3 */}
<List.Accordion
        title="၈.၅.၃	အဆုတ်ကင်ဆာ" titleNumberOfLines={20} style={{backgroundColor:"#dfe5c1" }} 
 theme={{colors:{primary:'#8e61ff'}}}
        >
          <List.Item title={`    အဆုတ်ကင်ဆာသည် မြန်မာနိုင်ငံတွင် အမျိုးသားများ၌ အဖြစ်အများဆုံး ကင်ဆာ ဖြစ်ပြီး အမျိုးသမီးများတွင် တတိယအများဆုံးကင်ဆာဖြစ်သည်။ ကင်ဆာဖြင့် သေဆုံးသူ (၅) ယောက်တွင် (၁) ယောက်သည် အဆုတ်ကင်ဆာကြောင့်ဖြစ်သည်။ အဆုတ်ကင်ဆာ ဖြစ်ပွားမှု၏ (၈၅%) မှာ ဆေးလိပ်သောက်ခြင်းကြောင့် ဖြစ်သည်။ ဆေးလိပ်သောက်သော သူသည် မသောက်သောသူထက် (၁၅)ဆမှ (၂၅) ဆ ပို၍ အဆုတ်ကင်ဆာဖြစ်ရန် အလား အလာရှိပါသည်။`}
titleNumberOfLines={500} />
        <List.Item title="အဆုတ်ကင်ဆာဖြစ်စေသော အကြောင်းများ"
titleNumberOfLines={500} style={styles.subp}/>
<List.Item title={`•	ဆေးလိပ်သောက်ခြင်းသည် အဆုတ်ကင်ဆာဖြစ်စေသော အရေးကြီးဆုံး အကြောင်း တစ်ရပ်ဖြစ်သည်။ ကာလကြာရှည်စွာ ဆေးလိပ်သောက်ခြင်း၊ သောက်သုံးသည့် ဆေးလိပ်အရေအတွက်များခြင်း၊ သောက်သုံးသည့်ဆေးလိပ်တွင် ကတ္တရာနှင့် နီကို တင်းများခြင်းသည် အဆုတ်ကင်ဆာဖြစ်စေသည်။ စီးကရက်သောက်ခြင်းကြောင့် အဆုတ်ကင်ဆာ ပိုမိုဖြစ်စေနိုင်ပါသည်။
•	အန္တရာယ်ရှိသော ပတ်ဝန်းကျင်တွင် အလုပ်လုပ်မှု၊ ဓါတ်သတ္တုများနှင့် ထိတွေ့ခြင်းတို့ ကြောင့် ကင်ဆာဖြစ်ရန် အလားအလာ ပိုမိုများပြားစေပါသည်။ ဉပမာ-ကျောက်မီး သွေးဓာတ်ငွေ့၊ ကရိုမိတ်၊ နီကယ်၊ အာဆင်းနစ်၊ ဗီနိုင်ကလိုရိုက်၊ မတ်စတတ်ဓါတ်ငွေ့၊ ဓါတ်ရောင်ခြည်ထွက်ပစ္စည်းများ တူးဖော်ခြင်း၊ 
•	မီးခံပြားမှုန့်နှင့် ထိတွေ့သူများသည် ဆေးလိပ်သောက်သော အလေ့အကျင့်ရှိပါက အဆုတ်ကင်ဆာဖြစ်ရန် အဆပေါင်း (၆၀) ပိုမိုဖြစ်စေပါသည်။
•	မိမိကိုယ်တိုင် ဆေးလိပ်မသောက်သော်လည်း မိမိခင်ပွန်းသောက်သော ဆေးလိပ်ငွေ့ ကို ရှူရှိုက်ရသော အမျိုးသမီး (၁၀) ယောက်အနက် (၅) ယောက်ခန့်တွင် အဆုတ် ကင်ဆာရောဂါဖြစ်ရန် အလားအလာရှိသည်။
•	ယခင်က အဆုတ်တွင် တီဘီရောဂါဖြစ်ဖူးသူများသည် အမာရွတ်များ ကျန်ခဲ့ပါသည်။ ၎င်းတီဘီအမာရွတ်များမှ ကာလကြာသောအခါ အဆုတ်ကင်ဆာ ဖြစ်နိုင်ပါသည်။`}
titleNumberOfLines={500} />

<List.Item title="ရောဂါလက္ခဏာများ"
titleNumberOfLines={500} style={styles.subp}/>
<List.Item title={`•	အဆက်မပြတ်ချောင်းဆိုးခြင်း
•	အသက်ရှူမဝခြင်း
•	သလိပ်ထဲတွင် သွေးစများပါခြင်း
•	ရင်ဘတ်အောင့်ခြင်း
•	မကြာခဏ အဆုတ်အအေးမိခြင်း၊ ဖျားခြင်း၊ ကိုယ်အလေးချိန်ကျခြင်း
•	အဆုတ်ကင်ဆာသည် ခန္ဓာကိုယ်၏ အခြားအစိတ်အပိုင်းများသို့ ရောက်ရှိပါက ၎င်းရောက်ရှိသည့် နေရာအလိုက် ရောဂါလက္ခဏာများပြပါသည်။ (ဉပမာ-အကျိတ် များသို့ရောက်လျှင် အကျိတ်များကြီးခြင်း၊ အသည်းသို့ရောက်လျှင် အသည်းကြီးခြင်း)
	အဆုတ်ကင်ဆာရောဂါဖြစ်ရန် (၁၀) နှစ်မှ အနှစ် (၂၀) ကြာတတ်၍ လူလတ်ပိုင်းနှင့် လူကြီးပိုင်းတွင် အများအားဖြင့် တွေ့ရပါသည်။ အဆုတ်ကင်ဆာ ဖြစ်သောအခါ အသက်ရှု လမ်းကြောင်းရှိ ကလာပ်စည်းများ အထိန်းအကွပ်မဲ့ပွားများသဖြင့် အကျိတ်အဖုဖြစ်လာ သည်။ ကင်ဆာကလာပ်စည်းများ တခြားခန္ဓာကိုယ် အစိတ်အပိုင်းများသို့ လျင်မြန်စွာ ပြန့်သွားတတ်ပါသည်။ အဘယ်ကြောင့်ဆိုသော အဆုတ်တွင် သွေးကြောနှင့် ပြန်ရည်ကြော များ များပြားသောကြောင့် ဖြစ်ပါသည်။ ပြန်ရည်ကြောမှ ပြန့်လျှင် အကျိတ်များကြီးလာ၍ သွေးကြောမှ ပြန့်လျှင် အသည်း၊ အရိုး၊ ဦးနှောက်နှင့် အခြားအဆုတ်ဘက်သို့ ပြန့်သွားနိုင်ပါ သည်။`}
titleNumberOfLines={500} /><Text style={styles.subtitle}>‌
အဆုတ်ကင်ဆာရောဂါမဖြစ်ရန် အကောင်းဆုံး ကာကွယ်နည်းမှာ ဆေးလိပ်လုံးဝ မသောက်ရန်ပင်ဖြစ်သည်။
</Text>
     </List.Accordion>
     <Text style={styles.subtitle}></Text>
{/* 1.4 */}
<List.Accordion
        title="၈.၅.၄	ရင်သားကင်ဆာ" titleNumberOfLines={20} style={{backgroundColor:"#dfe5c1" }} 
 theme={{colors:{primary:'#8e61ff'}}}
        >
          <List.Item title={`•	ရင်သားကင်ဆာသည် မြန်မာနိုင်ငံတွင် အမျိုးသမီးများ၌ ဒုတိယအဖြစ်အများဆုံး ကင်ဆာ ဖြစ်ပါသည်။
•	ရင်သားတွင် အကျိတ်အဖုတွေ့တိုင်း ကင်ဆာမဟုတ်ပါ။
•	ရင်သားကင်ဆာဖြစ်စတွင် နာကျင်မှုမရှိပါ။`}
titleNumberOfLines={500} />
        <List.Item title="ကင်ဆာမဟုတ်သော ရင်သားအကျိတ်"
titleNumberOfLines={500} style={styles.subp}/>
<List.Item title={`•	၎င်းအကျိတ်များသည် ခွဲစိတ်၍ ထုတ်ပြီးလျှင် တခြားပျံ့နှံ့ခြင်း မပြုပါ။
•	အသက်အန္တရာယ် မရှိပါ။`}
titleNumberOfLines={500} />

<List.Item title="ရင်သားကင်ဆာအကျိတ်"
titleNumberOfLines={500} style={styles.subp}/>
<List.Item title={`နီးစပ်ရာ ခန္ဓာကိုယ်အစိတ်အပိုင်းသို့ ပျံ့နှံ့နိုင်သည်။ သွေးကြော၊ ပြန်ရည်ကြောများမှ တဆင့် ခန္ဓာကိုယ်၏ အခြားအစိတ်အပိုင်းရောက်ရှိသွားနိုင်သည်။ အသက်အန္တရာယ်ရှိသည်။ စောစီးစွာ သိရှိကုသပါက ပျောက်ကင်းနိုင်သည်။`}
titleNumberOfLines={500} />

<List.Item title="မိမိရင်သားကို မိမိကိုယ်တိုင်စမ်းသပ်ခြင်း"
titleNumberOfLines={500} style={styles.subp}/>
<List.Item title={`မိမိရင်သားကို မိမိကိုယ်တိုင် စမ်းသပ်ရန်အတွက် မိနစ်အနည်းငယ်သာ လိုအပ်ပါ သည်။ ရာသီလာပြီးသည် အချိန်တွင် စမ်းသပ်ရမည်။ (အိပ်၍ဖြစ်စေ၊ မတ်တပ်ရပ်၍ ဖြစ်စေ၊ စမ်းသပ်နိုင်သည်။ တစ်လတစ်ကြိမ် မှန်မှန်စမ်းသပ်ခြင်းဖြင့် မိမိရင်သားတွင် အကျိတ်အဖု ပေါ်လာပါက ချက်ချင်းသိရှိနိုင်မည်) ရာသီမမှန်သော အမျိုးသမီးများ လစဉ် ရက်တစ်ရက်ကို သတ်မှတ်၍ ၎င်းရက်အတိုင်း ပုံမှန် စမ်းသပ်ရမည်။
၁။	အိပ်လျက်အနေအထားဖြင့် စမ်းသပ်မည်ဆိုပါက ယာဘက်ရင်သားကို စမ်းရန် ယာဘက်ပခုံးအောက်တွင် ခေါင်းအုံးတစ်လုံးထား၍ ယာဘက်လက်ကို ဦးခေါင်း နောက်သို့ မြှောက်ထားပြီး ဝဲဘက်လက်တွင် စမ်းသပ်ရမည်။ ဝဲဘက်ရင်သား စမ်းသပ် ရန် ဝဲဘက်ပခုံးအောက်တွင် ခေါင်းအုံးတစ်လုံးထား၍ ဝဲဘက်လက်ကို ဦးခေါင်း နောက်သို့ မြှောက်ထားပြီး ယာဘက်လက်ဖြင့် စမ်းသပ်ရမည်။
၂။	စမ်းသပ်သောအခါ လက်ညှိုး၊ လက်ခလယ်၊ လက်သူကြွယ် (၃) ချောင်းဖြင့် စမ်းပါ။
၃။	သေသေချာချာဖိ၍ စမ်းပါ။
၄။	ရင်သားကို စနစ်တကျ လှည့်ပတ်၍ စမ်းရပါမည်။
၅။	ညှပ်ရိုး၏အပေါ်နှင့် အောက်တို့အပြင် ချိုင်းကိုလည်း စမ်းရပါမည်။
၆။	မှန်ရှေ့တွင် မိမိရင်သား၌ ချိုင့်နေခြင်း၊ နို့သီးခေါင်းအနေအထား အရောင်ပြောင်းလဲ ခြင်း၊ ရောင်ရမ်းခြင်း ရှိ/မရှိ ကြည့်ရှုစစ်ဆေးပါ။`}
titleNumberOfLines={500} />

<List.Item title="ထိုသို့ကြည့်ရာ၌"
titleNumberOfLines={500} style={styles.subp}/>
<List.Item title={`၁။	ရင်သားနှစ်ဘက် အနိမ့်အမြင့် မတူခြင်း
၂။	ရင်သားပေါ်ရှိ အရေပြားချိုင့်ဝင်ခြင်း
၃။	ရင်သားတွင် မြင်သာသော အဖုအကျိတ်ရှိ/မရှိ
၄။	နို့သီးခေါင်းဝင်နြေင်း ရှိ/မရှိ
၅။	နို့သီးခေါင်း၏ အရေပြားတွင် ပြောင်းလဲမှု ရှိ/မရှိ
၆။	ရင်သားနှစ်ဘက် အရွယ်ပမာဏ မတူညီခြင်း
၇။	လက်မောင်းရောင်နေခြင်း ရှိ/မရှိ
၈။	နို့သီးခေါင်းမှ အရည် (သို့မဟုတ်) သွေးထွက်ခြင်း ရှိ/မရှိ
၉။	လည်ပင်းနှင့် ချိုင်းအောက်တွင် အကျိတ်အဖု ရှိ/မရှိ`}
titleNumberOfLines={500} /><Text style={styles.subtitle}>သံသယရှိဖွယ် အကျိတ်အဖုတွေ့လျှင် တတ်ကျွမ်းသူဖြင့် ပြသစစ်ဆေးပါ။</Text>
</List.Accordion>

         </View>
       </ScrollView>
     )
   }

   const styles = StyleSheet.create({
    body :{
      flex:1,
      backgroundColor:'#F8FFD7',
      marginBottom:10,
      marginBottom:20,
    },
  headtitle:{
    color:'#102027',
    fontSize:30,
    marginTop:10,
    
  },
  subtitle:{
    color:'#260e04',
    fontSize:18,
    textDecorationLine: 'underline',
  },
  p:{
    margin:7,
    color:'#4e342e',
    fontSize:15,
    lineHeight: 26,
  },
  subp:{
    color:'#4e342e',
    fontSize:15,
    backgroundColor:'#dfe5c1',
    textDecorationLine: 'underline',
  }
    
    })