import { Pressable, StyleSheet, Text, View } from 'react-native'
import React from 'react'
import { ScrollView } from 'react-native-gesture-handler'
import { List } from 'react-native-paper'


export default function noon({navigation}) {
    const onPresshundler = () => {
    
    navigation.goBack()
    }
     return(
       <ScrollView style={{backgroundColor:'#F8FFD7'}}>
         <View style={styles.body} >
         <Text style={styles.subtitle}>
         ၈။ မကူးစက်နိုင်သော ရောဂါများအကြောင်း
         </Text>
         <Text style={styles.p}>{"\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0"}
         လူတစ်ဦးမှတစ်ဦးသို့ ရောဂါကူးစက်ခြင်းကြောင့်မဟုတ်ဘဲ ကျန်းမာရေးနှင့် မညီညွတ်သော အစားအစာများ စားသောက်ခြင်းနှင့် ကျန်းမာရေးနှင့် မညီညွတ်သော လူမှုဘ၀နေထိုင်မှုပုံစံများတွင် ကြာရှည်စွာ စားသောက်နေထိုင် ထိတွေ့နေရခြင်းကြောင့် ဖြစ်ပေါ်လာသော ရောဂါအစုအဝေးကို ခေါ်ပါသည်။
         {"\n"}{"\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0"}	မကူးစက်နိုင်သောရောဂါများတွင် အောက်ပါရောဂါနှင့် ကျန်းမာရေးပြဿနာများ ပါဝင်ပါသည်။
         {"\n"}(၁)	သွေးတိုးရောဂါ	{"\n"}(၂)	ဆီးချိုသွေးချိုရောဂါ
         {"\n"}(၃)	နှလုံးသွေးကြောကျဉ်းရောဂါ	{"\n"}(၄)	လေဖြတ်ခြင်း
         {"\n"}(၅)	ကင်ဆာရောဂါ	{"\n"}(၆)	နာတာရှည်အဆုတ်ပွရောဂါ၊လေပြွန်ကျဉ်းနှင့် ပန်းနာရင်ကြပ်ရောဂါ
         {"\n"}(၇)	စိတ်ကျန်းမာရေးပြဿနာ	{"\n"}(၈)	အတက်ရောဂါ
         {"\n"}(၉)	နားလေးရောဂါ	{"\n"}(၁၀)	မတော်တဆဖြစ်ခြင်းနှင့် ထိခိုက်မှုအန္တရာယ်
         {"\n"}(၁၁)	ဆေးလိပ်ဆေးရွက်ကြီးအန္တရာယ်	{"\n"}(၁၂)	အရက်စွဲအန္တရာယ်
         {"\n"}(၁၃)	မူးယစ်ဆေးဝါးအန္တရာယ်	{"\n"}(၁၄)	မြွေကိုက်အန္တရာယ်တို့ ပါဝင်ပါသည်။
         {"\n"}{"\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0"}	မြန်မာနိုင်ငံတွင် သေဆုံးသူ (၁၀၀) လျှင် (၅၉) ဦးသည် မကူးစက်နိုင်သော ရောဂါများကြောင့် သေဆုံးနေကြောင်း တွေ့ရှိရသည်။
         {"\n"}{"\u00a0\u00a0\u00a0\u00a0\u00a0\u00a0"}	မြန်မာနိုင်ငံတွင် အဖြစ်များသော နာတာရှည်ရောဂါ (၄) မျိုးရှိပါသည်။ {"\n"}(၁) နှလုံးသွေး ကြောရောဂါ {"\n"}(၂) ဆီးချိုသွေးချိုရောဂါ {"\n"}(၃) ကင်ဆာရောဂါ {"\n"}(၄) နာတာရှည်အဆုတ်ရောဂါ</Text>
         
         <List.Accordion
        title="ကာကွယ်နိုင်မည့်နည်းလမ်းများ" titleNumberOfLines={20} style={{backgroundColor:"#dfe5c1" }} 
 theme={{colors:{primary:'#8e61ff'}}}
        >
        <List.Item title="(၁)	ကျန်းမာရေးနှင့် ညီညွတ်စွာ စားသုံးပါ။"
titleNumberOfLines={500} style={styles.subp}/>
<List.Item title={`•	ချိုလွန်း၊ ငန်လွန်း၊ အဆီများလွန်းသော၊ အသင့်စားထုပ်ပိုးထားသော အစားအစာများကို ‌လျှော့၍ စားသုံးပါ။
   -	ချိုလွန်းသည့် အစားအစာများမှာ - အချိုရည်များ၊ သကြားနှင့် နို့ဆီပါသော အစားအစာများ၊ ထန်းလျက်၊ မလိုင်၊ ကြံသကာ စသည့် အစားအစာများ
   -	ငန်လွန်းသည့် အစားအစာများမှာ - ငါးပိ၊ ငါးခြောက်၊ ငံပြာရည်၊ ပုစွန်ခြောက် စသည့် အစားအစာများနှင့် ဟင်းချိုမှုန့်
•	တိရစ္ဆာန်မှရသော အဆီများ (အမဲဆီ၊ ဝက်ဆီ) စားသုံးခြင်းမှ ရှောင်ကြဉ်ပါ။ စားအုန်းဆီကို အလွန်အကျွံမစားသုံးသင့်ပါ။
•	ကွမ်းစားခြင်းကို ရှောင်ကြဉ်ပါ။
•	အမျှင်ဓါတ်ပါသော ဟင်းသီးဟင်းရွက်နှင့် သစ်သီးဝလံများကို များများစားသုံးပေးပါ။
   -	ကန်စွန်းရွက်၊ ချဉ်ပေါင်ရွက်၊ ဘူးရွက်နှင့် ဘူးသီး၊ ဟင်းနုနယ်ရွက်စသည့် ဟင်းသီးဟင်းရွက်များ 
   -	ငှက်ပျောသီး၊ သင်္ဘောသီး၊ ဖရဲသီး၊ သရက်သီး၊ မာလကာသီး၊ စပျစ်သီးစသည့် သစ်သီးဝလံများ`}
titleNumberOfLines={500} />

<List.Item title="(၂)	ကိုယ်ကာယ လှုပ်ရှားမှု လေ့ကျင့်ခန်းများ မှန်မှန်ပြုလုပ်ပါ။"
titleNumberOfLines={500} style={styles.subp}/>
<List.Item title={`•	တစ်နေ့လျှင် မိနစ် (၃၀)၊ တစ်ပတ်လျှင် (၅)ရက် သင့်လျော်သော ကိုယ်လက် လှုပ်ရှားမှု ပြုလုပ်ပါ။ (လမ်းလျှောက်ခြင်း၊ ရေကူးခြင်း၊ အလေးမခြင်း၊ စက်ဘီးစီး ခြင်း စသည့် မိမိလုပ်နိုင်သည့် လေ့ကျင့်ခန်းကို လုပ်နိုင်ပါသည်။)
•	သွက်လက်တက်ကြွစွာ နေထိုင်ပါ။
•	အထိုင်များခြင်း၊ လှုပ်ရှားမှုနည်းခြင်းကို ရှောင်ကြဉ်ပါ။
•	တီဗီ၊ တီဗီဂိမ်းရှေ့တွင် ကြာရှည်စွာထိုင်ခြင်းနှင့် ကွန်ပျူတာ၊ အင်တာနက် ဆက်တိုက်ကြာရှည်စွာ အသုံးပြုခြင်းများ ရှောင်ကြဉ်ပါ။`}
titleNumberOfLines={500} />

<List.Item title="(၃)	ဆေးလိပ်နှင့် ဆေးရွက်ကြီး သုံးစွဲမှုကို ရှောင်ကြဉ်ပါ။"
titleNumberOfLines={500} style={styles.subp}/>
<List.Item title={`•	ကိုယ်တိုင်ဆေးလိပ်သောက်ခြင်းနှင့် သူတစ်ပါးဆေးလိပ်ငွေ့ရှူခြင်းကို ရှောင်ကြဉ်ပါ။
•	ဆေးရွက်ကြီးနှင့် နှပ်ဆေးအမျိုးမျိုးပါဝင်သော ကွမ်းစားခြင်းကို ရှောင်ကြဉ်ပါ။
•	ဆေးငုံခြင်းကို ရှောင်ကြဉ်ပါ။`}
titleNumberOfLines={500} />

<List.Item title="(၄)	အရက်အလွန်အကျွံသောက်သုံးမှုကို ရှောင်ကြဉ်ပါ။"
titleNumberOfLines={500} style={styles.subp}/>


<List.Item title="(၅)	ကိုယ်ခန္ဓာ ရှိသင့်သည်ထက် ပိုဝမလာအောင် ထိန်းသိမ်းပါ။"
titleNumberOfLines={500} style={styles.subp}/>
<List.Item title={`•	မိမိအရပ်အလိုက် ရှိသင့်သော ကိုယ်အလေးချိန်ကို ထိန်းသိမ်းနိုင်ရန်နှင့်
•	ကိုယ်အလေးချိန်များလာလျှင် လျှော့ချရန် ကြိုးစားပါ။`}
titleNumberOfLines={500} />

<List.Item title="(၆)	ရေလုံလောက်စွာ သောက်ပါ။"
titleNumberOfLines={500} style={styles.subp}/>
<List.Item title={`လူတစ်ယောက်သည် ရေကို တစ်နေ့လျှင် ရေဖန်ခွက် (၈)ခွက် (သို့) (၂)လီတာခန့် သောက်သုံးရန် လိုအပ်ပါသည်။`}
titleNumberOfLines={500} />

<List.Item title="(၇)	စိတ်သောကများကို လျှော့နိုင်အောင် ကြိုးစားနေထိုင်ပါ။"
titleNumberOfLines={500} style={styles.subp}/>
<List.Item title={`•	အပြုသဘောဖြင့် အရာရာကို အကောင်းမြင်နိုင်အောင် ကြိုးစားပါ။
•	အပြုံးဖြင့် လောကဓံကို ကြံ့ကြံ့ခံရင်ဆိုင်နိုင်အောင် ကြိုးစားပါ။

•	မကူးစက်နိုင်သော ရောဂါများအား ကာကွယ်ရန် ကျန်းမာရေးနှင့်ညီညွတ်သော နေထိုင်စားသောက်မှု အလေ့အထများကို လိုက်နာကျင့်သုံးသင့်ပါသည်။
•	အသက် (၄၀) ကျော်သူများအနေဖြင့် ဆီးချိုသွေးချိုနှင့် သွေးတိုးရောဂါများ ဖြစ်ပွားနေမှု ရှိ/မရှိ ပုံမှန်စစ်ဆေးသင့်ပါသည်။
•	ရောဂါဖြစ်ပွားမှုကို သိရှိပါက ကျန်းမာရေးဝန်ထမ်းနှင့် ဆောလျင်စွာ ပြသ၍ ပုံမှန် စစ်ဆေးကုသမှု ခံယူသင့်ပါသည်။`}
titleNumberOfLines={500} />

      </List.Accordion>

         </View>
       </ScrollView>
     )
   }

   const styles = StyleSheet.create({
    body :{
      flex:1,
      backgroundColor:'#F8FFD7',
      marginBottom:10,
      marginBottom:20,
    },
  headtitle:{
    color:'#102027',
    fontSize:30,
    marginTop:10,
    
  },
  subtitle:{
    color:'#260e04',
    fontSize:18,
    textDecorationLine: 'underline',
  },
  p:{
    margin:7,
    color:'#4e342e',
    fontSize:15,
    lineHeight: 26,
  },
  subp:{
    color:'#4e342e',
    fontSize:15,
    backgroundColor:'#dfe5c1',
    textDecorationLine: 'underline',
  }
    
    })